gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
#include <Arduino.h>
#include "logging.h"
#include "lx200_protocol.h"
#include "mount_transport.h"
#include "nexstar_protocol.h"
#include "observer_time.h"
#include "position_cache.h"
#include "settings.h"
#include "slew_controller.h"
#include <math.h>
#include <stddef.h>
#include <stdlib.h>
#include <string.h>
#if defined(ESP8266)
  #include <LittleFS.h>
#else
  #include <FS.h>
  #include <LittleFS.h>
#endif

#if defined(ESP8266)
  #include <ESP8266WiFi.h>
  #include <ESP8266HTTPClient.h>
  #include <ESP8266WebServer.h>
  #include <WiFiUdp.h>
#else
  #include <WiFi.h>
  #include <HTTPClient.h>
  #include <WebServer.h>

  #include <WiFiUdp.h>
  #include <BluetoothSerial.h>
  extern "C" {
    #include "esp_https_server.h"
    #include "esp_coexist.h"
  }
  #include "esp_system.h"
  #include "freertos/FreeRTOS.h"
  #include "freertos/task.h"
#endif

#if defined(ESP32) && !defined(CONFIG_IDF_TARGET_ESP32S2)
  // Classic BT shares radio resources with WiFi on ESP32. Keep the feature in
  // the sketch, but make it an explicit build-time mode while WiFi/TCP is debugged.
  #ifndef ENABLE_CLASSIC_BT
    #define ENABLE_CLASSIC_BT 1
  #endif
  #define HAS_CLASSIC_BT ENABLE_CLASSIC_BT
#else
  #define HAS_CLASSIC_BT 0
#endif

// Optional hardware startup-mode override pins.
// Wire selected pin to GND before reset/power-up. Pins use INPUT_PULLUP.
// These overrides are runtime-only; they do not erase the saved boot mode.
// Avoid GPIO16/17 because they are used for mount UART.
#define GPIO_STARTUP_MODE_ENABLED 1
#define GPIO_STARTUP_ACTIVE_LOW 1
#define GPIO_STARTUP_FULL_WIFI_PIN 32       // GND at boot: Full WiFi web mode
#define GPIO_STARTUP_BT_WEB_PIN 33          // GND at boot: BT + tiny web
#define GPIO_STARTUP_BT_TELNET_PIN 25       // GND at boot: BT Telnet-only
#define GPIO_STARTUP_SAMPLE_DELAY_MS 75

// ESP32 keeps AP fallback up, but saved STA credentials should survive reboot.
const bool ESP32_FORCE_AP_DEFAULTS = false;
const bool ESP32_DISABLE_LITTLEFS_SETTINGS = true; // ESP32 uses Preferences/NVS instead
const bool ESP32_BOOT_AP_ONLY = false;
const bool ESP32_BOOT_DISABLE_BACKGROUND_POLLING = false;
const bool ESP32_BOOT_WEB_ONLY = false;
bool bluetoothRuntimeEnabled = false;
String coexPreferenceText = "default";
int coexPreferenceResult = 0;

const unsigned long WIFI_CONNECT_TIMEOUT_MS = 15000;
const char* BT_NAME = "NexStar_Bridge";

const char* FW_VERSION = "v5.29";
const char* FW_NAME = "NexStar Protocol Converter";

// Stability defaults: preserve all features, but avoid surprise background load.
const bool WEB_STARTUP_READ_MOUNT = false;
const unsigned long WEB_STATUS_REFRESH_MS = 8000;
const unsigned long WEB_LOG_REFRESH_MS = 5000;
extern const bool SERIAL_MIRROR_FULL_WIFI_LOGS = true; // mirror the same formatted Full WiFi log lines to USB serial


const uint16_t HTTP_WEB_PORT = 80;
const uint16_t ALPACA_DISCOVERY_PORT = 32227;

#if defined(ESP8266)
  ESP8266WebServer *webServer = nullptr;
  ESP8266WebServer *alpacaServer = nullptr;
  ESP8266WebServer *activeServer = nullptr;
#else
  WebServer *webServer = nullptr;
  WebServer *alpacaServer = nullptr;
  WebServer *activeServer = nullptr;
#endif
#define server (*activeServer)

// HTTPS setup credentials and state are stored separately.
#include "https_credentials.h"



WiFiUDP discoveryUdp;
WiFiServer *lx200ServerPtr = nullptr;
#define lx200Server (*lx200ServerPtr)
WiFiClient lx200Client;
bool lx200WifiClientConnected = false;

bool lx200BtClientConnected = false;
uint32_t positionApiCacheReplies = 0;
uint32_t positionApiCacheMisses = 0;
WiFiServer *stellariumServerPtr = nullptr;
#define stellariumServer (*stellariumServerPtr)
WiFiServer *telnetServerPtr = nullptr;
#define telnetServer (*telnetServerPtr)
WiFiServer tinySetupServer(80);
WiFiClient telnetClient;
bool telnetClientConnected = false;
bool telnetAuthenticated = false;
String telnetLine = "";
bool telnetLastWasCR = false;
unsigned long telnetLastRxMs = 0;
uint32_t telnetRxCommands = 0;
uint32_t telnetAuthFailures = 0;
bool telnetLiveLogEnabled = true;          // mirror filtered firmware logs to authenticated Telnet clients
uint32_t telnetLiveLogLines = 0;
String telnetPendingConfirmCommand = "";
String telnetPendingConfirmDescription = "";
String serialPendingConfirmCommand = "";
String serialPendingConfirmDescription = "";
bool telnetMonitorActive = false;
bool telnetMonitorSavedLiveLog = true;
unsigned long telnetMonitorLastDrawMs = 0;
unsigned long telnetMonitorRefreshMs = 2000;
bool telnetTasksActive = false;
bool telnetTasksSavedLiveLog = true;
unsigned long telnetTasksLastDrawMs = 0;
unsigned long telnetTasksRefreshMs = 5000;
unsigned long telnetTasksLastIdle0 = 0;
unsigned long telnetTasksLastIdle1 = 0;
unsigned long telnetTasksLastRuntimeTotal = 0;
unsigned long telnetTasksLastLoadMs = 0;
int telnetTasksCpuLoadPct = -1;
unsigned long webCpuLastIdle0 = 0;
unsigned long webCpuLastIdle1 = 0;
unsigned long webCpuLastRuntimeTotal = 0;
int webCpuLoadPct = -1;
WiFiClient stellariumClient;
bool stellariumClientConnected = false;
unsigned long stellariumLastRxMs = 0;
unsigned long stellariumLastTxMs = 0;
uint32_t stellariumRxPackets = 0;
uint32_t stellariumTxPackets = 0;
uint32_t stellariumBadPackets = 0;

bool restartPending = false;
unsigned long restartAtMs = 0;
bool apRestartPending = false;
unsigned long apRestartAtMs = 0;
bool staConnected = false;
bool apRunning = false;
bool tinyWebServerRuntimeEnabled = true;  // Runtime-only serial console toggle. Reboot restores from btLiteBootWebEnabled.
bool wifiRuntimeEnabled = true;           // Runtime-only serial console WiFi radio toggle. Reboot restores saved WiFi mode.
const bool BT_AUTO_WIFI_OFF_ON_CLIENT = false;
unsigned long btClientConnectedAtMs = 0;
bool btAutoWifiOffDone = false;
String wifiModeText = "AP";
String lastWifiStatus = "AP fallback";
String startupModeSource = "saved settings";
int startupModePinUsed = -1;

double approxIpLatitudeDeg = 0.0;
double approxIpLongitudeDeg = 0.0;
String approxIpLocationText = "";
String approxIpLocationStatus = "Not fetched";
bool approxIpLocationValid = false;

#if HAS_CLASSIC_BT
BluetoothSerial SerialBT;
#endif

