gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
const char* currentWebRequestPath = "";


bool alpacaConnected = true;
uint32_t alpacaHttpRequests = 0;
const unsigned long POST_GOTO_POLL_QUIET_MS = 60000;
const unsigned long BT_POST_GOTO_FAST_POLL_MS = 300;
const unsigned long SKYSAFARI_RECENT_GUARD_MS = 90000;
const unsigned long SKYSAFARI_BT_TRAFFIC_GUARD_MS = 250;
const unsigned long SKYSAFARI_BT_COMMAND_POLL_QUIET_MS = 1500;
unsigned long lastLoopTimeMs = 0;
unsigned long maxLoopTimeMs = 0;
unsigned long lastLoopLatencyMs = 0;
unsigned long maxLoopLatencyMs = 0;

// Site/time updates received through Alpaca are staged here and applied from loop(),
// not inside the HTTP handler. This avoids ESP8266 crashes caused by doing
// String-heavy logging/recomputation while the web server is processing PUTs.
bool pendingSiteTimeUpdate = false;
bool pendingSiteLatitudeSet = false;
bool pendingSiteLongitudeSet = false;
bool pendingSiteElevationSet = false;
bool pendingUtcDateSet = false;
double pendingSiteLatitudeDeg = 0.0;
double pendingSiteLongitudeDeg = 0.0;
double pendingSiteElevationMeters = 0.0;
int pendingLocalYear = 2026;
int pendingLocalMonth = 1;
int pendingLocalDay = 1;
int pendingLocalHour = 0;
int pendingLocalMinute = 0;
int pendingLocalSecond = 0;

uint32_t serverTransactionID = 0;

void handleAlpacaDiscovery();
void handleLX200Server();
void handleStellariumServer();
void handleBluetoothLX200();
void serviceGotoCompletionWatch();
void serviceGotoQueue();
void startFallbackAP();

// Full WiFi log lines are mirrored to serial by addLogLine().
// Use LOG_* / LOG_*_CAT macros for formatted serial-visible logging.

double rateToNudgeStep(double rate) {
  double r = fabs(rate);
  if (r <= 0.0001) return 0.0;
  if (r <= 0.25) return nudgeRateDeg[0];
  if (r <= 0.50) return nudgeRateDeg[1];
  if (r <= 1.00) return nudgeRateDeg[2];
  return nudgeRateDeg[3];
}

void serviceHttpServers() {
  if (bridgeMode != BRIDGE_MODE_WIFI_FULL) return;

  if (webServer) {
    activeServer = webServer;
    webServer->handleClient();
  }
  if (alpacaServer) {
    activeServer = alpacaServer;
    alpacaServer->handleClient();
  }
}

void serviceNetworkDuringMountWait() {
  serviceHttpServers();

  if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
    // Full WiFi has been the stable reference path. Keep its normal network
    // servicing during mount waits so HTTP/LX200/Stellarium stay responsive.
    handleLX200Server();
    handleStellariumServer();
    handleAlpacaDiscovery();
  }

#if HAS_CLASSIC_BT
  if (bridgeMode == BRIDGE_MODE_BT_MIN_WEB) {
    // Do NOT call handleBluetoothLX200() here.
    // The original NexStar mount is strictly single-command. Re-entering the
    // Bluetooth LX200 parser while a mount transaction is waiting for bytes can
    // allow SkySafari polls or staged commands to run in the middle of the
    // mount's '?'/'E'/'Z'/'R'/'A' transaction. BT should use the
    // same stable single-command discipline as the Full WiFi path.
    delay(1);
    yield();
  }
#endif

  serviceNtpSync();
  delay(1);
  yield();
}

bool nudgeAxis(int axis, double rate) {
  double step = rateToNudgeStep(rate);

  if (step <= 0.0) {
    LOGI("Nudge stop command accepted: axis=%d rate=%.6f", axis, rate);
    return true;
  }

  if (axis == 0) return nudgeRelativeAltAz(0.0, rate > 0 ? step : -step);
  if (axis == 1) return nudgeRelativeAltAz(rate > 0 ? step : -step, 0.0);

  LOGE("Nudge failed: unsupported axis=%d", axis);
  return false;
}

void lx200Send(uint8_t source, const String &s) {
  if (source == LX_SRC_WIFI) {
    if (lx200Client && lx200Client.connected()) {
      lx200Client.print(s);
      lx200Client.flush();
      lx200WifiLastTxMs = millis();
      lx200WifiTxReplies++;
      if (!lx200SuppressNextReplyLog) {
        LOG_SKY_I("LX200 WiFi TX reply #%lu: %s", (unsigned long)lx200WifiTxReplies, s.c_str());
      }
    } else {
      LOG_SKY_W("LX200 WiFi TX dropped; no connected SkySafari client: %s", s.c_str());
    }
  }

#if HAS_CLASSIC_BT
  if (source == LX_SRC_BT) {
    if (SerialBT.hasClient()) {
      SerialBT.print(s);
      SerialBT.flush();
      lx200BtLastTxMs = millis();
      lx200BtTxReplies++;
      lx200BtLastReply = s;
      if (!lx200SuppressNextReplyLog) {
        LOG_SKY_D("LX200 BT TX reply #%lu: %s", (unsigned long)lx200BtTxReplies, s.c_str());
      }
    }
  }
#endif
}

bool positionDemandClientConnected() {
  if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
    if (lx200Client && lx200Client.connected()) return true;
    if (stellariumClientConnected) return true;
  }
#if HAS_CLASSIC_BT
  if (bluetoothRuntimeEnabled && SerialBT.hasClient()) return true;
#endif
  return false;
}

bool routeLX200SourceThroughCommonMountCore(uint8_t source) {
  if (source == LX_SRC_WIFI) {
    return processLX200Stream(lx200Client, source);
  }

#if HAS_CLASSIC_BT
  if (source == LX_SRC_BT) {
    return processLX200Stream(SerialBT, source);
  }
#endif

  return false;
}

uint16_t readLE16(const uint8_t *p) {
  return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}

int32_t readLE32s(const uint8_t *p) {
  uint32_t v = (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
  return (int32_t)v;
}

uint32_t readLE32u(const uint8_t *p) {
  return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

int64_t readLE64s(const uint8_t *p) {
  uint64_t v = 0;
  for (int i = 7; i >= 0; i--) {
    v <<= 8;
    v |= p[i];
  }
  return (int64_t)v;
}

void writeLE16(uint8_t *p, uint16_t v) {
  p[0] = v & 0xFF;
  p[1] = (v >> 8) & 0xFF;
}

void writeLE32(uint8_t *p, uint32_t v) {
  p[0] = v & 0xFF;
  p[1] = (v >> 8) & 0xFF;
  p[2] = (v >> 16) & 0xFF;
  p[3] = (v >> 24) & 0xFF;
}

void writeLE64(uint8_t *p, int64_t v) {
  uint64_t u = (uint64_t)v;
  for (int i = 0; i < 8; i++) {
    p[i] = (uint8_t)(u & 0xFF);
    u >>= 8;
  }
}

uint32_t stellariumRaToUint(double raDeg) {
  raDeg = normalizeRA(raDeg);
  double v = (raDeg / 360.0) * 4294967296.0;
  if (v < 0) v = 0;
  if (v > 4294967295.0) v = 4294967295.0;
  return (uint32_t)(v + 0.5);
}

int32_t stellariumDecToInt(double decDeg) {
  double v = (decDeg / 360.0) * 4294967296.0;
  if (v < -2147483648.0) v = -2147483648.0;
  if (v > 2147483647.0) v = 2147483647.0;
  return (int32_t)(v + (v >= 0 ? 0.5 : -0.5));
}

