gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
double stellariumUintToRaDeg(uint32_t raw) {
  return normalizeRA(((double)raw / 4294967296.0) * 360.0);
}

double stellariumIntToDecDeg(int32_t raw) {
  return ((double)raw / 4294967296.0) * 360.0;
}

void sendStellariumPosition() {
  if (!stellariumClient || !stellariumClient.connected()) return;
  markPositionDemand("Stellarium position TX");

  double ra = 0.0;
  double dec = 0.0;

  if (!mountPositionApiRaDec(ra, dec, nullptr)) {
    LOGW("Stellarium position send skipped: no RA/Dec cache");
    return;
  }

  uint8_t pkt[24];
  memset(pkt, 0, sizeof(pkt));

  writeLE16(pkt + 0, 24);
  writeLE16(pkt + 2, 0); // current position
  writeLE64(pkt + 4, (int64_t)millis());
  writeLE32(pkt + 12, stellariumRaToUint(ra));
  writeLE32(pkt + 16, (uint32_t)stellariumDecToInt(dec));
  writeLE32(pkt + 20, 0); // status OK/idle

  stellariumClient.write(pkt, sizeof(pkt));
  stellariumLastTxMs = millis();
  stellariumTxPackets++;
  LOG_STEL_D("Stellarium TX position packet #%lu RA=%.6f DEC=%.6f",
       (unsigned long)stellariumTxPackets, ra, dec);
}

void handleStellariumPacket(uint8_t *pkt, uint16_t len) {
  markPositionDemand("Stellarium RX");
  stellariumLastRxMs = millis();
  stellariumRxPackets++;

  if (len < 4) {
    stellariumBadPackets++;
    LOGW("Stellarium RX bad short packet len=%u", len);
    return;
  }

  uint16_t type = readLE16(pkt + 2);
  LOGD("Stellarium RX packet #%lu len=%u type=%u",
       (unsigned long)stellariumRxPackets, len, type);

  if (LOG_LEVEL >= LOG_TRACE) {
    String raw = "Stellarium raw:";
    for (uint16_t i = 0; i < len && i < 32; i++) {
      char b[5];
      snprintf(b, sizeof(b), " %02X", pkt[i]);
      raw += b;
    }
    LOGT("%s", raw.c_str());
  }

  // Stellarium telescope-control client sends a 20-byte GOTO packet:
  // uint16 length, uint16 type, int64 time, uint32 RA, int32 DEC.
  if (len >= 20) {
    uint32_t rawRa = readLE32u(pkt + 12);
    int32_t rawDec = readLE32s(pkt + 16);

    double raDeg = stellariumUintToRaDeg(rawRa);
    double decDeg = stellariumIntToDecDeg(rawDec);

    LOG_STEL_I("Stellarium RX packet len=%u type=%u GOTO RA_deg=%.6f DEC_deg=%.6f",
         len, type, raDeg, decDeg);

    if (mountCommandPathBusy()) {
      LOG_STEL_W("Stellarium GOTO queued: mount busy");
      enqueueGotoRaDec(raDeg, decDeg, LX_SRC_WIFI, "Stellarium GOTO while mount busy");
    } else {
      queueAsyncSlew(raDeg, decDeg);
    }

    // Do not overwrite current-position cache with Stellarium target.
    markGotoQueueImmediateAck("Stellarium", "binary GOTO accepted; position response sent from cache");
    sendStellariumPosition();
    return;
  }

  stellariumBadPackets++;
  LOG_STEL_W("Stellarium RX short/unknown packet len=%u type=%u", len, type);
}

void handleStellariumServer() {
  if (!stellariumClient || !stellariumClient.connected()) {
    if (stellariumClientConnected) {
      LOG_STEL_I("Stellarium client disconnected");
      stellariumClientConnected = false;
    }

    WiFiClient newClient = stellariumServer.available();
    if (newClient) {
      stellariumClient = newClient;
      stellariumClientConnected = true;
      stellariumLastRxMs = 0;
      stellariumLastTxMs = 0;
      LOG_STEL_I("Stellarium client connected from %s:%u",
           stellariumClient.remoteIP().toString().c_str(),
           stellariumClient.remotePort());
      markPositionDemand("Stellarium connect");
      sendStellariumPosition();
    }
    return;
  }

  int avail = stellariumClient.available();
  if (avail > 0) {
    LOG_STEL_D("Stellarium client has %d byte(s) available", avail);
  }

  static uint8_t stellariumRxBuf[64];
  static uint8_t stellariumRxLen = 0;

  while (stellariumClient.available() > 0 && stellariumRxLen < sizeof(stellariumRxBuf)) {
    int ch = stellariumClient.read();
    if (ch < 0) break;
    stellariumRxBuf[stellariumRxLen++] = (uint8_t)ch;
  }

  while (stellariumRxLen >= 2) {
    uint16_t len = readLE16(stellariumRxBuf);

    if (len < 4 || len > sizeof(stellariumRxBuf)) {
      stellariumBadPackets++;
      LOGW("Stellarium bad packet length %u; dropping client", len);
      stellariumClient.stop();
      stellariumClientConnected = false;
      stellariumRxLen = 0;
      return;
    }

    if (stellariumRxLen < len) {
      LOGD("Stellarium partial packet: have=%u need=%u", (unsigned)stellariumRxLen, len);
      return;
    }

    uint8_t pkt[64];
    memcpy(pkt, stellariumRxBuf, len);

    if (stellariumRxLen > len) {
      memmove(stellariumRxBuf, stellariumRxBuf + len, stellariumRxLen - len);
      stellariumRxLen -= len;
    } else {
      stellariumRxLen = 0;
    }

    handleStellariumPacket(pkt, len);
  }

  static unsigned long lastStellariumPositionMs = 0;
  if (millis() - lastStellariumPositionMs > 1000) {
    lastStellariumPositionMs = millis();
    sendStellariumPosition();
  }
}

void handleLX200Server() {
  if (!lx200Client || !lx200Client.connected()) {
    if (lx200WifiClientConnected) {
      LOGI("LX200/SkySafari WiFi client disconnected");
      lx200WifiClientConnected = false;
    }

    WiFiClient newClient = lx200Server.available();
    if (newClient) {
      lx200Client = newClient;
      lx200Client.setNoDelay(true);
      lx200WifiClientConnected = true;
      lx200WifiLastRxMs = 0;
      lx200WifiLastTxMs = 0;
      LOGI("LX200/SkySafari WiFi client connected from %s:%u",
           lx200Client.remoteIP().toString().c_str(),
           lx200Client.remotePort());
    }
    return;
  }

  int avail = lx200Client.available();
  if (avail > 0) {
    LOGD("LX200/SkySafari WiFi has %d byte(s) available", avail);
  }

  for (uint8_t i = 0; i < 8 && routeLX200SourceThroughCommonMountCore(LX_SRC_WIFI); i++) {
    yield();
  }
}

void handleBluetoothLX200() {
#if HAS_CLASSIC_BT
  if (!bluetoothRuntimeEnabled) return;
  bool nowConnected = SerialBT.hasClient();

  if (nowConnected && !lx200BtClientConnected) {
    LOG_BT_I("Bluetooth LX200/SkySafari client connected");
    LOG_BT_D("Bluetooth SkySafari connected: idle background mount polling remains enabled; SkySafari polls use latest cache");
    LOG_BT_I("Bluetooth client active; WiFi/Telnet will remain enabled unless wifi off is requested");
    btClientConnectedAtMs = millis();
    btAutoWifiOffDone = false;
    lx200BtLastRxMs = 0;
    lx200BtLastTxMs = 0;
    lx200BtLastCommand = "";
    lx200BtLastReply = "";
    lx200BtLastUnhandled = "";
    lx200BtGotoStageCommands = 0;
    lx200BtPollOnlyHintCount = 0;
    resetMountPollFailures();
    invalidateCachesAfterGoto();
  } else if (!nowConnected && lx200BtClientConnected) {
    LOG_BT_I("Bluetooth LX200/SkySafari client disconnected");
    btClientConnectedAtMs = 0;
  }

  lx200BtClientConnected = nowConnected;
  if (!nowConnected) return;

  // Match the stable Full WiFi LX200 behavior: process one complete command
  // per loop pass through the same shared LX200-to-mount command core used by WiFi.
  routeLX200SourceThroughCommonMountCore(LX_SRC_BT);
#endif
}

String jsonEscape(const String &s) {
  String out = "";
  for (size_t i = 0; i < s.length(); i++) {
    char c = s[i];
    if (c == '"') out += "\\\"";
    else if (c == '\\') out += "\\\\";
    else if (c == '\n') out += "\\n";
    else if (c == '\r') out += "\\r";
    else if (c == '\t') out += "\\t";
    else out += c;
  }
  return out;
}

String htmlEscape(const String &s) {
  String out = "";
  for (size_t i = 0; i < s.length(); i++) {
    char c = s[i];
    if (c == '"') out += "&quot;";
    else if (c == '<') out += "&lt;";
    else if (c == '>') out += "&gt;";
    else if (c == '&') out += "&amp;";
    else out += c;
  }
  return out;
}

bool webTraceEnabled() {
  return LOG_LEVEL >= LOG_TRACE && (LOG_SUBSYSTEM_MASK & LOG_CAT_WEB);
}

const char* currentRouteForLog() {
  if (currentWebRequestPath && currentWebRequestPath[0]) return currentWebRequestPath;
  return "";
}

