gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
bool isAlpacaPathForLogging() {
  String p = server.uri();
  return p.startsWith("/management") || p.startsWith("/api/");
}

void traceWebResponse(const char* type, int statusCode, unsigned int bodyLen) {
  if (!webTraceEnabled()) return;
  if (isAlpacaPathForLogging()) return; // prevent Alpaca debug/trace from crashing/flooding ESP8266

  LOG_WEB_T("HTTP response %s status=%d path=%s bytes=%u",
            type,
            statusCode,
            currentRouteForLog(),
            bodyLen);
}

void sendNoCacheHeaders() {
  server.sendHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "0");
}

void sendJson(const String &body) {
  traceWebResponse("json", 200, (unsigned)body.length());
  sendNoCacheHeaders();
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Connection", "close");
  server.send(200, "application/json", body);
}

void sendPlain(const String &body) {
  traceWebResponse("plain", 200, (unsigned)body.length());
  sendNoCacheHeaders();
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Connection", "close");
  server.send(200, "text/plain", body);
}

void sendAjaxOK(const String &message) {
  String body = "{\"ok\":true,\"message\":\"" + jsonEscape(message) + "\"}";
  if (webTraceEnabled()) LOG_WEB_T("AJAX OK path=%s message=%s", currentRouteForLog(), message.c_str());
  sendJson(body);
}

void sendAjaxRedirectOK(const String &message, const String &redirectUrl, unsigned long delayMs) {
  String body = "{\"ok\":true,\"message\":\"" + jsonEscape(message) + "\",\"redirectUrl\":\"" + jsonEscape(redirectUrl) + "\",\"redirectDelayMs\":" + String(delayMs) + "}";
  if (webTraceEnabled()) LOG_WEB_T("AJAX REDIRECT path=%s message=%s url=%s delay=%lu", currentRouteForLog(), message.c_str(), redirectUrl.c_str(), delayMs);
  sendJson(body);
}

void sendAjaxFail(const String &message) {
  String body = "{\"ok\":false,\"message\":\"" + jsonEscape(message) + "\"}";
  if (LOG_SUBSYSTEM_MASK & LOG_CAT_WEB) LOG_WEB_D("AJAX FAIL path=%s message=%s", currentRouteForLog(), message.c_str());
  sendJson(body);
}

bool wantsAjax() {
  return server.hasArg("ajax") && server.arg("ajax") == "1";
}

int clientTransactionID() {
  if (server.hasArg("ClientTransactionID")) return server.arg("ClientTransactionID").toInt();
  if (server.hasArg("ClientID")) return server.arg("ClientID").toInt();
  return 0;
}

String alpacaResponseValue(const String &valueJson, int errorNumber = 0, const String &errorMessage = "") {
  serverTransactionID++;
  String s = "{";
  s += "\"ClientTransactionID\":" + String(clientTransactionID()) + ",";
  s += "\"ServerTransactionID\":" + String(serverTransactionID) + ",";
  s += "\"ErrorNumber\":" + String(errorNumber) + ",";
  s += "\"ErrorMessage\":\"" + jsonEscape(errorMessage) + "\"";
  if (valueJson.length() > 0) s += ",\"Value\":" + valueJson;
  s += "}";
  return s;
}

void sendAlpacaValue(const String &valueJson) {
  sendJson(alpacaResponseValue(valueJson));
}

void sendAlpacaOK() {
  sendJson(alpacaResponseValue(""));
}

void sendAlpacaError(int code, const String &message) {
  LOG_ALP_W("Alpaca error %d: %s", code, message.c_str());
  sendJson(alpacaResponseValue("", code, message));
}

String argAny(const char* name) {
  if (server.hasArg(name)) return server.arg(name);
  return "";
}

String argAnyCI(const char* name) {
  String wanted = String(name);
  for (uint8_t i = 0; i < server.args(); i++) {
    String n = server.argName(i);
    if (n.equalsIgnoreCase(wanted)) return server.arg(i);
  }
  return "";
}

String alpacaPutValue(const char* primaryName) {
  String v = argAnyCI(primaryName);
  if (v.length() > 0) return v;
  v = argAnyCI("Value");
  if (v.length() > 0) return v;
  return "";
}

String currentUtcIsoString() {
  int y, mo, d, h, mi, se;
  currentUtcParts(y, mo, d, h, mi, se);
  char buf[28];
  snprintf(buf, sizeof(buf), "%04d-%02d-%02dT%02d:%02d:%02d", y, mo, d, h, mi, se);
  return String(buf);
}

bool safeFloatValue(const String &v, double &out) {
  if (v.length() == 0 || v.length() > 32) return false;
  out = v.toFloat();
  return !isnan(out) && !isinf(out);
}

String formatUptime() {
  unsigned long seconds = millis() / 1000;
  unsigned long days = seconds / 86400;
  seconds %= 86400;
  unsigned long hours = seconds / 3600;
  seconds %= 3600;
  unsigned long minutes = seconds / 60;
  seconds %= 60;

  String s = "";
  if (days) s += String(days) + "d ";
  s += String(hours) + "h ";
  s += String(minutes) + "m ";
  s += String(seconds) + "s";
  return s;
}

String resetReasonText() {
#if defined(ESP8266)
  return ESP.getResetReason();
#else
  esp_reset_reason_t r = esp_reset_reason();
  switch (r) {
    case ESP_RST_POWERON: return "Power on";
    case ESP_RST_EXT: return "External reset";
    case ESP_RST_SW: return "Software reset";
    case ESP_RST_PANIC: return "Panic/exception";
    case ESP_RST_INT_WDT: return "Interrupt watchdog";
    case ESP_RST_TASK_WDT: return "Task watchdog";
    case ESP_RST_WDT: return "Other watchdog";
    case ESP_RST_DEEPSLEEP: return "Deep sleep wake";
    case ESP_RST_BROWNOUT: return "Brownout";
    case ESP_RST_SDIO: return "SDIO reset";
    default: return "Unknown";
  }
#endif
}

String twoDigits(int v) {
  return (v < 10 ? "0" : "") + String(v);
}

String formatDurationHoursMinutes(unsigned long spanMs) {
  unsigned long totalMinutes = spanMs / 60000UL;
  unsigned long hours = totalMinutes / 60UL;
  unsigned long minutes = totalMinutes % 60UL;
  return String(hours) + ":" + twoDigits(minutes);
}

String formatLastSuccessfulMountPollTime() {
  if (lastSuccessfulMountPollMs == 0) return "none";
  String s = String(lastSuccessfulMountPollYear) + "-" + twoDigits(lastSuccessfulMountPollMonth) + "-" + twoDigits(lastSuccessfulMountPollDay);
  s += " " + twoDigits(lastSuccessfulMountPollHour) + ":" + twoDigits(lastSuccessfulMountPollMinute) + ":" + twoDigits(lastSuccessfulMountPollSecond);
  String tz = currentTimezoneAbbrev();
  if (tz.length()) s += " " + tz;
  return s;
}

String formatSuccessfulMountPollSpan() {
  if (firstSuccessfulMountPollMs == 0 || lastSuccessfulMountPollMs == 0) return "0:00";
  return formatDurationHoursMinutes(lastSuccessfulMountPollMs - firstSuccessfulMountPollMs);
}

String formatMountUptime() {
  return formatSuccessfulMountPollSpan();
}

String formatHmsFromHours(double hours, int decimals = 1) {
  while (hours < 0.0) hours += 24.0;
  while (hours >= 24.0) hours -= 24.0;

  int h = (int)floor(hours);
  double rem = (hours - h) * 60.0;
  int m = (int)floor(rem);
  double sec = (rem - m) * 60.0;

  if (sec >= 59.95 && decimals == 1) {
    sec = 0.0;
    m++;
  }
  if (m >= 60) {
    m = 0;
    h = (h + 1) % 24;
  }

