gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  String s = twoDigits(h) + ":" + twoDigits(m) + ":";
  if (decimals <= 0) s += twoDigits((int)round(sec));
  else {
    if (sec < 10.0) s += "0";
    s += String(sec, decimals);
  }
  return s;
}

String observerTimeText() {
  String s;
  s += "TIME\n";
  s += "Offset: " + String(utcOffsetMinutes) + " min";
  String tz = currentTimezoneAbbrev();
  if (tz.length()) s += " " + tz;
  s += "\n";

  if (!timeValid) {
    s += "Local: not set\n";
    s += "UTC: not set\n";
    s += "Sidereal: unavailable\n";
    return s;
  }

  int ly, lmo, ld, lh, lmi, ls;
  int uy, umo, ud, uh, umi, us;
  currentLocalParts(ly, lmo, ld, lh, lmi, ls);
  currentUtcParts(uy, umo, ud, uh, umi, us);

  double lstH = normalizeRA(gmstDegrees() + siteLongitudeDeg) / 15.0;

  s += "Local: " + String(ly) + "-" + twoDigits(lmo) + "-" + twoDigits(ld) + " ";
  s += twoDigits(lh) + ":" + twoDigits(lmi) + ":" + twoDigits(ls);
  if (tz.length()) s += " " + tz;
  s += "\n";
  s += "UTC: " + String(uy) + "-" + twoDigits(umo) + "-" + twoDigits(ud) + "T";
  s += twoDigits(uh) + ":" + twoDigits(umi) + ":" + twoDigits(us) + "Z\n";
  s += "Sidereal: " + formatHmsFromHours(lstH, 1) + " LST\n";
  return s;
}

String basicStatusText() {
  String s;
  s += "MOUNT\n";
  s += "State: " + mountHealthLine() + "\n";
  s += "Operation: ";
  if (mountBusy || asyncSlewRunning || asyncSlewPending) s += "Slewing / waiting for completion";
  else if (hasQueuedGoto()) s += "GOTO queued";
  else s += "Idle";
  s += "\n";
  s += "Last response: " + String(lastMountResponseMs == 0 ? 0 : millis() - lastMountResponseMs) + " ms ago\n";
  s += "Mount uptime: " + formatMountUptime() + " h:mm\n";
  s += "Current polling: " + String(effectiveMountPollIntervalMs()) + " ms (" + String(positionDemandActive() ? "active" : "idle") + ")\n";
  s += "Idle poll interval: " + String(idlePollIntervalMs) + " ms\n";
  if (mountCommFault && lastMountFault.length()) s += "Fault: " + lastMountFault + "\n";
  s += "\nPOSITION\n";
  s += "RA / Dec: ";
  if (mountCurrentRaDecValid) s += String(mountCurrentRA_deg / 15.0, 6) + " h / " + String(mountCurrentDec_deg, 6) + " deg";
  else s += "unavailable";
  s += "\nAlt / Az: ";
  if (mountCurrentAltAzValid) s += String(mountCurrentAlt_deg, 6) + " deg / " + String(mountCurrentAz_deg, 6) + " deg";
  else s += "unavailable";
  s += "\nPosition source: " + String(altAzComputed ? "computed" : "mount/cache") + "\n";
  s += "\n";
  s += observerTimeText();
  s += "\nLOCATION\n";
  s += "Status/source: " + String(siteValid ? "valid / " : "not valid / ") + currentLocationSource + "\n";
  s += "Latitude: " + String(siteLatitudeDeg, 6) + " deg\n";
  s += "Longitude: " + String(siteLongitudeDeg, 6) + " deg east-positive\n";
  s += "Elevation: " + String(siteElevationMeters, 2) + " m\n";
  return s;
}

String taskStatsSectionText(bool basicMode);

String basicSystemHealthText() {
  String s;
  s += "SCHEDULER\n";
  s += "Active poll interval: " + String(pollIntervalMs) + " ms\n";
  s += "Idle poll interval: " + String(idlePollIntervalMs) + " ms\n";
  s += "Effective poll interval: " + String(effectiveMountPollIntervalMs()) + " ms\n";
  s += "Position demand: " + String(positionDemandActive() ? "active" : "idle") + "\n";
  s += "Poll latency current/max: " + String(lastPollSchedulerLatencyMs) + "/" + String(maxPollSchedulerLatencyMs) + " ms\n";
  s += "Missed poll deadlines: " + String(mountPollsMissedDeadline) + "\n";
  s += "Mount uptime: " + formatMountUptime() + " h:mm\n";
  s += "Loop latency current/max: " + String(lastLoopLatencyMs) + "/" + String(maxLoopLatencyMs) + " ms\n";
  s += "\nRELIABILITY\n";
  s += "Poll failures: " + String(backgroundPollFailCount) + "\n";
  s += "Polling auto-disabled: " + String(backgroundPollingAutoDisabled ? "yes" : "no") + "\n";
  s += "Free heap: " + String(ESP.getFreeHeap()) + " bytes\n";
  s += "Uptime: " + formatUptime() + "\n";
  s += "\n";
  s += taskStatsSectionText(true);
  s += "\nNETWORK\n";
  s += "Mode: " + wifiModeText + " / " + String(bridgeModeName()) + "\n";
  s += "STA: " + String(staConnected && WiFi.status() == WL_CONNECTED ? "connected" : "not connected") + "\n";
  return s;
}

String systemHealthText() {
  String s;
  s += "=== POLL SCHEDULER ===\n";
  s += "Policy: fixed interval, highest loop priority\n";
  s += "Interval: " + String(pollIntervalMs) + " ms\n";
  s += "Scheduler latency current/max: " + String(lastPollSchedulerLatencyMs) + "/" + String(maxPollSchedulerLatencyMs) + " ms\n";
  s += "Polls started: " + String(mountPollsStarted) + "\n";
  s += "Mount uptime: " + formatMountUptime() + " h:mm\n";
  s += "Deferred while command active: " + String(mountPollsDeferredBusy) + "\n";
  s += "Missed deadlines: " + String(mountPollsMissedDeadline) + "\n";
  s += "Background poll failures: " + String(backgroundPollFailCount) + "\n";
  s += "Polling auto-disabled: " + String(backgroundPollingAutoDisabled ? "yes" : "no") + "\n\n";
  s += "=== LOOP PERFORMANCE ===\n";
  s += "Loop latency current/max: " + String(lastLoopLatencyMs) + "/" + String(maxLoopLatencyMs) + " ms\n";
  s += "Loop execution current/max: " + String(lastLoopTimeMs) + "/" + String(maxLoopTimeMs) + " ms\n";
  s += "Uptime: " + formatUptime() + "\n\n";
  s += taskStatsSectionText(false);
  s += "\n";
  s += "=== MOUNT TRANSACTIONS ===\n";
  s += "Single-command discipline: enabled\n";
  s += "Position cache replies/misses: " + String(positionApiCacheReplies) + "/" + String(positionApiCacheMisses) + "\n";
  s += "Cached replies while queued/slewing: " + String(queuedGotoPositionCacheReplies) + "\n";
  s += "LX200 common-router commands: " + String(lx200CommonRouterCommands) + "\n";
  s += "LX200 GOTO started/completed/stop requests: " + String((unsigned long)lx200GotoUiStartedCount) + "/" + String((unsigned long)lx200GotoUiCompletedCount) + "/" + String((unsigned long)lx200GotoUiStopRequests) + "\n\n";
  s += "=== GOTO QUEUE ===\n";
  s += "Active/type: " + String(hasQueuedGoto() ? "yes / " : "no / ") + queuedGotoTypeName(queuedGotoType) + "\n";
  s += "Accepted/started/timed out/replaced: " + String(gotoQueueAccepted) + "/" + String(gotoQueueStarted) + "/" + String(gotoQueueTimedOut) + "/" + String(gotoQueueReplaced) + "\n";
  s += "Nudge queue requests: " + String(nudgeGotoQueueRequests) + "\n";
  s += "Immediate caller ACKs: " + String(gotoQueueImmediateAcks) + "\n";
  s += "Configured/effective timeout: " + String(gotoQueueTimeoutMs) + "/" + String(effectiveGotoQueueTimeoutMs()) + " ms\n\n";
  s += "=== MEMORY AND PLATFORM ===\n";
  s += "Board: " + String(BOARD_NAME) + "\n";
  s += "CPU: " + String(ESP.getCpuFreqMHz()) + " MHz\n";
  s += "Free heap: " + String(ESP.getFreeHeap()) + " bytes\n";
#if defined(ESP32)
  s += "Minimum free heap: " + String(ESP.getMinFreeHeap()) + " bytes\n";
#endif
  s += "Flash/sketch/free sketch: " + String(ESP.getFlashChipSize()) + "/" + String(ESP.getSketchSize()) + "/" + String(ESP.getFreeSketchSpace()) + " bytes\n";
  s += "Reset reason: " + resetReasonText() + "\n\n";
  s += "=== NETWORK ===\n";
  s += "WiFi/bridge mode: " + wifiModeText + " / " + String(bridgeModeName()) + "\n";
  s += "WiFi status: " + lastWifiStatus + "\n";
  s += "STA configured/connected: " + String(staConfigured ? "yes" : "no") + "/" + String(staConnected && WiFi.status() == WL_CONNECTED ? "yes" : "no") + "\n";
  s += "STA SSID/IP: " + staSsid + " / " + WiFi.localIP().toString() + "\n";
  s += "AP SSID/IP/clients: " + apSsid + " / " + WiFi.softAPIP().toString() + " / " + String(WiFi.softAPgetStationNum()) + "\n\n";
  s += "=== CLOCK AND PERSISTENCE ===\n";
  s += "NTP enabled/synced: " + String(ntpEnabled ? "yes" : "no") + "/" + String(ntpSyncValid ? "yes" : "no") + "\n";
  s += "NTP last-sync age: " + String(lastNtpSyncMs == 0 ? 0 : millis() - lastNtpSyncMs) + " ms\n";
  s += "Persistent saves: " + String(persistentSaveCount) + "\n";
  s += "Last save age: " + String(lastPersistentSaveMs == 0 ? 0 : millis() - lastPersistentSaveMs) + " ms\n";
  s += gpioStartupModeText();
  return s;
}

