gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
String mountHealthLine() {
  if (mountCommFault) return "Mount Not Responding";
  if (mountBusy || asyncSlewRunning || asyncSlewPending) return "Mount Busy / Slewing";
  if (lastMountResponseMs > 0) return "Mount Connected";
  return "Mount Unknown";
}

String currentStateText() {
  String s;
  s += "=== MOUNT AND MOTION ===\n";
  s += "Mount state: " + mountHealthLine() + "\n";
  s += "Last response age: " + String(mountLastResponseAge()) + " ms\n";
  if (mountCommFault) s += "Last fault: " + lastMountFault + "\n";
  s += "Command active: " + String(mountBusy ? "yes" : "no") + "\n";
  s += "Slew pending/running: " + String((asyncSlewPending || asyncAltAzSlewPending || asyncSlewRunning) ? "yes" : "no") + "\n";
  s += "GOTO queued: " + String(hasQueuedGoto() ? queuedGotoTypeName(queuedGotoType) : "no") + "\n";
  s += "SkySafari GOTO state: " + String(lx200GotoUiActive ? "active" : "idle") + "\n\n";
  s += "=== POSITION ===\n";
  s += "RA: " + String(cachedRA_deg / 15.0, 6) + " h (" + String(cachedRA_deg, 6) + " deg)\n";
  s += "Dec: " + String(cachedDec_deg, 6) + " deg\n";
  s += "Alt: " + String(cachedAlt_deg, 6) + " deg\n";
  s += "Az: " + String(cachedAz_deg, 6) + " deg\n";
  s += "RA/Dec cache valid: " + String(cacheValid ? "yes" : "no") + "\n";
  s += "Alt/Az cache valid: " + String(altAzCacheValid ? "yes" : "no") + "\n";
  s += "Alt/Az source: " + String(altAzComputed ? "computed" : "mount/cache") + "\n\n";
  s += "=== TIME AND SITE ===\n";
  s += "Time valid/source: " + String(timeValid ? "yes / " : "no / ") + String(timeSourceName(currentTimeSource)) + "\n";
  s += "Location valid/source: " + String(siteValid ? "yes / " : "no / ") + currentLocationSource + "\n";
  s += "Latitude: " + String(siteLatitudeDeg, 6) + " deg\n";
  s += "Longitude: " + String(siteLongitudeDeg, 6) + " deg east-positive\n";
  s += "Elevation: " + String(siteElevationMeters, 2) + " m\n";
  s += observerTimeText();
  s += "\n";
  s += "=== CLIENTS AND SERVICES ===\n";
  s += "Bridge mode: " + String(bridgeModeName()) + "\n";
  s += "Alpaca client active: " + String(alpacaConnected ? "yes" : "no") + "\n";
  s += "SkySafari/LX200 WiFi: " + String((lx200Client && lx200Client.connected()) ? "connected" : "idle") + "\n";
  s += "Stellarium: " + String((bridgeMode == BRIDGE_MODE_WIFI_FULL && stellariumClientConnected) ? "connected" : "idle") + "\n";
  s += "Bluetooth enabled: " + String(bluetoothRuntimeEnabled ? "yes" : "no") + "\n";
#if HAS_CLASSIC_BT
  s += "Bluetooth client: " + String((bluetoothRuntimeEnabled && SerialBT.hasClient()) ? "connected" : "idle") + "\n";
#endif
  s += "Web HTTP port: " + String(HTTP_WEB_PORT) + "\n";
  s += "Alpaca/LX200/Discovery ports: " + String(bridgeMode == BRIDGE_MODE_WIFI_FULL ? ALPACA_PORT : 0) + "/" + String(bridgeMode == BRIDGE_MODE_WIFI_FULL ? LX200_PORT : 0) + "/" + String(bridgeMode == BRIDGE_MODE_WIFI_FULL ? ALPACA_DISCOVERY_PORT : 0) + "\n\n";
  s += "=== CONTROL SETTINGS ===\n";
  s += "Active poll interval: " + String(pollIntervalMs) + " ms\n";
  s += "Idle poll interval: " + String(idlePollIntervalMs) + " ms\n";
  s += "Effective poll interval: " + String(effectiveMountPollIntervalMs()) + " ms (" + String(positionDemandActive() ? "active" : "idle") + ")\n";
  s += "Client throttle: " + String(minClientPollIntervalMs) + " ms\n";
  s += "Selected nudge rate: " + String(webSelectedRateIndex + 1) + " (" + String(nudgeRateDeg[webSelectedRateIndex], 3) + " deg)\n";
  s += "Log level: " + String(logLevelName(LOG_LEVEL)) + "\n";
  return s;
}

String getLogText() {
  String out;
  int count = logWrapped ? LOG_BUFFER_LINES : logWriteIndex;
  if (count <= 0) return "";

  // Newest first. Filtering happens at write time with lightweight subsystem masks.
  for (int i = 0; i < count; i++) {
    int idx = logWriteIndex - 1 - i;
    while (idx < 0) idx += LOG_BUFFER_LINES;
    out += logBuffer[idx];
    out += "\n";
    yield();
  }

  return out;
}



bool syncTimeFromNTP(bool forceLog = true) {
  if (forceLog) {
    LOG_TIME_I("NTP sync requested: enabled=%d staConnected=%d wifiStatus=%d server1=%s server2=%s tz=%s",
               ntpEnabled ? 1 : 0,
               (staConnected && WiFi.status() == WL_CONNECTED) ? 1 : 0,
               (int)WiFi.status(),
               ntpServer1,
               ntpServer2,
               tzRule);
  }

  if (!ntpEnabled) {
    if (forceLog) LOG_TIME_W("NTP sync skipped: NTP is disabled");
    return false;
  }

  if (!staConnected || WiFi.status() != WL_CONNECTED) {
    if (forceLog) LOG_TIME_W("NTP sync skipped: STA WiFi is not connected");
    return false;
  }

  if (forceLog) LOG_TIME_D("NTP configTzTime starting");
  configTzTime(tzRule, ntpServer1, ntpServer2);

  struct tm tminfo;
  if (forceLog) LOG_TIME_T("NTP getLocalTime waiting up to 10000 ms");
  bool ok = getLocalTime(&tminfo, 10000);
  if (!ok) {
    ntpSyncValid = false;
    if (forceLog) LOG_TIME_W("NTP sync failed: getLocalTime timed out or returned false");
    return false;
  }

  localYear = tminfo.tm_year + 1900;
  localMonth = tminfo.tm_mon + 1;
  localDay = tminfo.tm_mday;
  localHour = tminfo.tm_hour;
  localMinute = tminfo.tm_min;
  localSecond = tminfo.tm_sec;
  timeSetMillis = millis();
  timeValid = true;
  ntpSyncValid = true;
  lastNtpSyncMs = millis();
  markTimeSource(TIME_SRC_NTP);

  if (forceLog) {
    LOG_TIME_I("NTP sync successful: local=%04d-%02d-%02d %02d:%02d:%02d source=NTP",
               localYear, localMonth, localDay, localHour, localMinute, localSecond);
    LOG_TIME_D("NTP state updated: timeValid=%d ntpSyncValid=%d lastNtpSyncMs=%lu",
               timeValid ? 1 : 0, ntpSyncValid ? 1 : 0, lastNtpSyncMs);
  }

  return true;
}

void serviceNtpSync() {
  static unsigned long lastAttemptMs = 0;
  if (!ntpEnabled || !staConnected || WiFi.status() != WL_CONNECTED) return;

  unsigned long now = millis();
  if (!timeValid) {
    if (now - lastAttemptMs > 5000) {
      lastAttemptMs = now;
      syncTimeFromNTP(false);
    }
    return;
  }

  if (now - lastNtpSyncMs > 6UL * 3600UL * 1000UL && now - lastAttemptMs > 5000) {
    lastAttemptMs = now;
    syncTimeFromNTP(false);
  }
}
String urlDecodeSimple(String s) {
  s.replace("+", " ");
  String out = "";
  char hex[3] = {0, 0, 0};
  for (unsigned int i = 0; i < s.length(); i++) {
    if (s[i] == '%' && i + 2 < s.length()) {
      hex[0] = s[i + 1];
      hex[1] = s[i + 2];
      out += (char)strtol(hex, NULL, 16);
      i += 2;
    } else {
      out += s[i];
    }
  }
  return out;
}



bool parseIpAddress(const String &s, IPAddress &ip) {
  int parts[4] = {0, 0, 0, 0};
  int part = 0;
  String cur = "";

  for (unsigned int i = 0; i <= s.length(); i++) {
    char c = (i < s.length()) ? s[i] : '.';
    if (c == '.') {
      if (cur.length() == 0 || part > 3) return false;
      int v = cur.toInt();
      if (v < 0 || v > 255) return false;
      parts[part++] = v;
      cur = "";
    } else if (c >= '0' && c <= '9') {
      cur += c;
    } else {
      return false;
    }
  }

  if (part != 4) return false;
  ip = IPAddress(parts[0], parts[1], parts[2], parts[3]);
  return true;
}

String wifiStatusCodeText(wl_status_t st) {
  switch (st) {
    case WL_IDLE_STATUS: return "IDLE";
    case WL_NO_SSID_AVAIL: return "NO_SSID_AVAIL";
    case WL_SCAN_COMPLETED: return "SCAN_COMPLETED";
    case WL_CONNECTED: return "CONNECTED";
    case WL_CONNECT_FAILED: return "CONNECT_FAILED";
    case WL_CONNECTION_LOST: return "CONNECTION_LOST";
    case WL_DISCONNECTED: return "DISCONNECTED";
    default: return "UNKNOWN(" + String((int)st) + ")";
  }
}

