gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
void scheduleRestart(const String &reason) {
  restartPending = true;
  restartAtMs = millis() + 1500;
  LOGW("Restart scheduled: %s", reason.c_str());
}

void scheduleApRestart(const String &reason) {
  apRestartPending = true;
  apRestartAtMs = millis() + 1500;
  LOG_WIFI_W("Soft AP restart scheduled: %s", reason.c_str());
}

void serviceRestart() {
  if (apRestartPending && millis() >= apRestartAtMs) {
    apRestartPending = false;
    LOG_WIFI_W("Restarting soft AP now to apply AP settings");
#if defined(ESP32)
    WiFi.softAPdisconnect(true);
    delay(150);
    apRunning = false;
    startFallbackAP();
#endif
  }

  if (restartPending && millis() >= restartAtMs) {
    LOGW("Restarting now to apply network/server configuration");
#if HAS_CLASSIC_BT
    if (bluetoothRuntimeEnabled) {
      SerialBT.disconnect();
      delay(100);
      SerialBT.end();
      delay(250);
    }
#endif
    delay(100);
    ESP.restart();
  }
}

void runtimeWifiOff() {
#if defined(ESP32)
  tinyWebServerRuntimeEnabled = false;
  wifiRuntimeEnabled = false;

  if (telnetClient) telnetClient.stop();
  telnetClientConnected = false;
  telnetAuthenticated = false;
  telnetLine = "";
  telnetLastWasCR = false;

  // Drop clients and radio state. This is runtime-only and does not erase saved STA/AP settings.
  WiFi.disconnect(true, true);
  delay(100);
  WiFi.softAPdisconnect(true);
  delay(100);
  WiFi.mode(WIFI_OFF);
  delay(150);

  apRunning = false;
  staConnected = false;
  wifiModeText = "WiFi runtime OFF";
  lastWifiStatus = "WiFi runtime OFF from serial command";
  Serial.println("WiFi runtime OFF: AP/STA/tiny web stopped. Bluetooth SPP remains active.");
  Serial.printf("Free heap after WiFi off: %u bytes\n", ESP.getFreeHeap());
#if defined(ESP32)
  Serial.printf("Min free heap after WiFi off: %u bytes\n", ESP.getMinFreeHeap());
#endif
#else
  Serial.println("WiFi runtime OFF is only implemented for ESP32 in this build.");
#endif
}

void runtimeWifiOn() {
#if defined(ESP32)
  if (bridgeMode != BRIDGE_MODE_BT_MIN_WEB) {
    Serial.println("wifi on runtime restore is intended for BT mode only.");
    return;
  }

  wifiRuntimeEnabled = true;
  tinyWebServerRuntimeEnabled = btLiteBootWebEnabled;

  Serial.println("WiFi runtime ON: restoring saved BT WiFi mode...");
  WiFi.persistent(false);
  WiFi.disconnect(true, true);
  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_OFF);
  delay(150);

  setupWiFiFromSavedConfig();
  if (btLiteBootWebEnabled) {
    tinySetupServer.begin();
    Serial.println("[BT_MIN] tiny setup web server restored by wifi on");
  } else {
    Serial.println("[BT_MIN] tiny setup web server remains disabled by saved Telnet-only option");
  }
  startTelnetConsoleServer("BT wifi on");

  wifiModeText = String("BT runtime WiFi + ") + wifiModeText;
  lastWifiStatus = String("BT runtime WiFi restored. ") + lastWifiStatus;
  Serial.printf("WiFi runtime ON: mode=%s AP=%s APIP=%s STAIP=%s\n",
                wifiModeText.c_str(),
                runtimeApSsid().c_str(),
                WiFi.softAPIP().toString().c_str(),
                WiFi.localIP().toString().c_str());
  Serial.printf("Free heap after WiFi on: %u bytes\n", ESP.getFreeHeap());
#if defined(ESP32)
  Serial.printf("Min free heap after WiFi on: %u bytes\n", ESP.getMinFreeHeap());
#endif
#else
  Serial.println("WiFi runtime ON is only implemented for ESP32 in this build.");
#endif
}

const char* bridgeModeName() {
  return bridgeMode == BRIDGE_MODE_BT_MIN_WEB ? "BT / tiny setup AP" : "Full WiFi web";
}

bool readStartupModePinActive(int pin) {
#if defined(ESP32)
  if (!GPIO_STARTUP_MODE_ENABLED) return false;
  if (pin < 0) return false;
  pinMode(pin, INPUT_PULLUP);
  delay(GPIO_STARTUP_SAMPLE_DELAY_MS);
  int v = digitalRead(pin);
#if GPIO_STARTUP_ACTIVE_LOW
  return v == LOW;
#else
  return v == HIGH;
#endif
#else
  return false;
#endif
}

void applyGpioStartupModeOverride() {
#if defined(ESP32)
  if (!GPIO_STARTUP_MODE_ENABLED) {
    startupModeSource = "saved settings";
    startupModePinUsed = -1;
    return;
  }

  if (readStartupModePinActive(GPIO_STARTUP_FULL_WIFI_PIN)) {
    bridgeMode = BRIDGE_MODE_WIFI_FULL;
    btLiteBootWebEnabled = true;
    tinyWebServerRuntimeEnabled = true;
    startupModeSource = "GPIO force Full WiFi";
    startupModePinUsed = GPIO_STARTUP_FULL_WIFI_PIN;
    Serial.printf("[BOOT] GPIO startup override: GPIO%d active -> Full WiFi web mode\n", startupModePinUsed);
    return;
  }

  if (readStartupModePinActive(GPIO_STARTUP_BT_WEB_PIN)) {
    bridgeMode = BRIDGE_MODE_BT_MIN_WEB;
    btLiteBootWebEnabled = true;
    tinyWebServerRuntimeEnabled = true;
    startupModeSource = "GPIO force BT + web";
    startupModePinUsed = GPIO_STARTUP_BT_WEB_PIN;
    Serial.printf("[BOOT] GPIO startup override: GPIO%d active -> BT + tiny web\n", startupModePinUsed);
    return;
  }

  if (readStartupModePinActive(GPIO_STARTUP_BT_TELNET_PIN)) {
    bridgeMode = BRIDGE_MODE_BT_MIN_WEB;
    btLiteBootWebEnabled = false;
    tinyWebServerRuntimeEnabled = false;
    startupModeSource = "GPIO force BT Telnet-only";
    startupModePinUsed = GPIO_STARTUP_BT_TELNET_PIN;
    Serial.printf("[BOOT] GPIO startup override: GPIO%d active -> BT Telnet-only\n", startupModePinUsed);
    return;
  }

  startupModeSource = "saved settings";
  startupModePinUsed = -1;
  Serial.println("[BOOT] GPIO startup override: no startup mode pin active; using saved settings");
#else
  startupModeSource = "saved settings";
  startupModePinUsed = -1;
#endif
}

String gpioStartupModeText() {
  String s;
#if defined(ESP32)
  s += "GPIO startup override: ";
  s += GPIO_STARTUP_MODE_ENABLED ? "enabled" : "disabled";
  s += "\n";
  s += "Startup mode source: ";
  s += startupModeSource;
  s += "\n";
  s += "Startup mode pin used: ";
  s += String(startupModePinUsed);
  s += "\n";
  s += "Pins active-low to GND: Full WiFi GPIO";
  s += String(GPIO_STARTUP_FULL_WIFI_PIN);
  s += ", BT+Web GPIO";
  s += String(GPIO_STARTUP_BT_WEB_PIN);
  s += ", BT Telnet-only GPIO";
  s += String(GPIO_STARTUP_BT_TELNET_PIN);
  s += "\n";
  s += "Priority if multiple pins are grounded: Full WiFi, then BT+Web, then BT Telnet-only\n";
#else
  s += "GPIO startup override: unavailable on this board\n";
#endif
  return s;
}



void handleSetModePage() {
  String m = webServer->arg("mode");
  m.toLowerCase();
  String ret = requestedReturnUrl();
  if (ret.length() == 0 || !ret.startsWith("http://")) ret = currentRequestBaseUrl();

  if (m == "wifi") {
    saveBridgeMode(BRIDGE_MODE_WIFI_FULL);
    String page;
    page.reserve(900);
    page += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
    page += F("<meta http-equiv='refresh' content='7;url=");
    page += ret;
    page += F("'><script>setTimeout(function(){location.replace('");
    page += ret;
    page += F("')},7000)</script></head><body><h3>Switched to Full WiFi web mode</h3><p>Rebooting...</p><p><a href='");
    page += ret;
    page += F("'>Open previous page</a></p></body></html>");
    webServer->sendHeader("Cache-Control", "no-store");
    webServer->send(200, "text/html", page);
    delay(900);
    ESP.restart();
    return;
  }

