gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  if (m == "bt") {
    saveBridgeMode(BRIDGE_MODE_BT_MIN_WEB);
    String page;
    page.reserve(900);
    page += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
    page += F("<meta http-equiv='refresh' content='7;url=");
    page += ret;
    page += F("'><script>setTimeout(function(){location.replace('");
    page += ret;
    page += F("')},7000)</script></head><body><h3>Switched to BT mode</h3><p>Rebooting...</p><p>Returning to the same host that called this page.</p><p><a href='");
    page += ret;
    page += F("'>Open previous page</a></p></body></html>");
    webServer->sendHeader("Cache-Control", "no-store");
    webServer->send(200, "text/html", page);
    delay(900);
    ESP.restart();
    return;
  }

  webServer->send(400, "text/plain", "Unknown mode");
}

void tinySetupSendHtml(WiFiClient &c, const String &body) {
  c.print("HTTP/1.1 200 OK\r\n");
  c.print("Content-Type: text/html; charset=utf-8\r\n");
  c.print("Cache-Control: no-store\r\n");
  c.print("Connection: close\r\n\r\n");
  c.print(body);
}

void tinySetupSendJson(WiFiClient &c, const String &body) {
  c.print("HTTP/1.1 200 OK\r\n");
  c.print("Content-Type: application/json\r\n");
  c.print("Cache-Control: no-store\r\n");
  c.print("Connection: close\r\n\r\n");
  c.print(body);
}

void tinySetupSendRedirect(WiFiClient &c, const String &where) {
  c.print("HTTP/1.1 303 See Other\r\n");
  c.print("Location: ");
  c.print(where);
  c.print("\r\nCache-Control: no-store\r\nConnection: close\r\n\r\n");
}


String tinyUrlDecode(String s) {
  String out;
  out.reserve(s.length());
  for (int i = 0; i < (int)s.length(); i++) {
    char c = s[i];
    if (c == '+') {
      out += ' ';
    } else if (c == '%' && i + 2 < (int)s.length()) {
      char h1 = s[i + 1];
      char h2 = s[i + 2];
      auto hexVal = [](char h)->int {
        if (h >= '0' && h <= '9') return h - '0';
        if (h >= 'a' && h <= 'f') return h - 'a' + 10;
        if (h >= 'A' && h <= 'F') return h - 'A' + 10;
        return -1;
      };
      int v1 = hexVal(h1);
      int v2 = hexVal(h2);
      if (v1 >= 0 && v2 >= 0) {
        out += char((v1 << 4) | v2);
        i += 2;
      } else {
        out += c;
      }
    } else {
      out += c;
    }
  }
  return out;
}

String tinyQueryParam(const String &req, const String &name) {
  int q = req.indexOf('?');
  if (q < 0) return "";
  int sp = req.indexOf(' ', q);
  String qs = (sp > q) ? req.substring(q + 1, sp) : req.substring(q + 1);
  String key = name + "=";
  int start = 0;
  while (start < (int)qs.length()) {
    int amp = qs.indexOf('&', start);
    if (amp < 0) amp = qs.length();
    String part = qs.substring(start, amp);
    if (part.startsWith(key)) return tinyUrlDecode(part.substring(key.length()));
    start = amp + 1;
  }
  return "";
}

String tinyEsc(const String &s) {
  String o;
  o.reserve(s.length() + 8);
  for (size_t i = 0; i < s.length(); i++) {
    char c = s[i];
    if (c == '&') o += F("&amp;");
    else if (c == '<') o += F("&lt;");
    else if (c == '>') o += F("&gt;");
    else if (c == '"') o += F("&quot;");
    else if (c == '\'') o += F("&#39;");
    else o += c;
  }
  return o;
}

String sampleWebCpuLoadText();

String tinyRequestHost(const String &req) {
  int h = req.indexOf("\nHost:");
  if (h < 0) h = req.indexOf("\nhost:");
  if (h < 0) return "";
  int p = req.indexOf(':', h + 1);
  if (p < 0) return "";
  int e = req.indexOf('\n', p + 1);
  if (e < 0) e = req.length();
  String host = req.substring(p + 1, e);
  host.trim();
  return host;
}

String tinyDefaultReturnUrl(const String &req) {
  String host = tinyRequestHost(req);
  if (host.length() > 0) return String("http://") + host + "/";
  if (WiFi.status() == WL_CONNECTED) return String("http://") + WiFi.localIP().toString() + "/";
  if (apRunning) return String("http://") + WiFi.softAPIP().toString() + "/";
  return "/";
}

String tinyReturnUrlFromRequest(const String &req) {
  String ret = tinyQueryParam(req, "return");
  ret.trim();
  if (ret.startsWith("http://")) return ret;
  return tinyDefaultReturnUrl(req);
}

String tinyRebootRedirectPage(const String &title, const String &ret) {
  String page;
  page.reserve(900);
  page += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
  page += F("<meta http-equiv='refresh' content='8;url=");
  page += ret;
  page += F("'><script>setTimeout(function(){location.replace('");
  page += ret;
  page += F("')},8000)</script>");
  page += F("<style>body{font-family:Arial,Helvetica,sans-serif;background:#0b1020;color:#edf2ff;margin:0;padding:20px}.card{max-width:560px;margin:25px auto;background:#151c2f;border:1px solid #2b3654;border-radius:12px;padding:18px}a{color:#8cc7ff}</style>");
  page += F("</head><body><div class='card'><h2>");
  page += title;
  page += F("</h2><p>Rebooting. The browser should return to the root menu automatically.</p><p><a href='");
  page += ret;
  page += F("'>Open root menu</a></p></div></body></html>");
  return page;
}

String tinyBtStatusJson() {
  bool btConnected = false;
#if HAS_CLASSIC_BT
  btConnected = bluetoothRuntimeEnabled && SerialBT.hasClient();
#endif
  String json;
  json.reserve(1300);
  json += "{";
  json += "\"bridgeMode\":\"" + jsonEscape(String(bridgeModeName())) + "\",";
  json += "\"btName\":\"" + jsonEscape(runtimeBtName()) + "\",";
  json += "\"apIp\":\"" + WiFi.softAPIP().toString() + "\",";
  json += "\"staIp\":\"" + WiFi.localIP().toString() + "\",";
  json += "\"staConnected\":" + String((staConnected && WiFi.status() == WL_CONNECTED) ? "true" : "false") + ",";
  json += "\"bluetoothEnabled\":" + String(bluetoothRuntimeEnabled ? "true" : "false") + ",";
  json += "\"bluetoothConnected\":" + String(btConnected ? "true" : "false") + ",";
  json += "\"lx200BtRxCommands\":" + String(lx200BtRxCommands) + ",";
  json += "\"lx200BtTxReplies\":" + String(lx200BtTxReplies) + ",";
  json += "\"lx200BtLastCommand\":\"" + jsonEscape(lx200BtLastCommand) + "\",";
  json += "\"lx200BtLastReply\":\"" + jsonEscape(lx200BtLastReply) + "\",";
  json += "\"lx200BtLastUnhandled\":\"" + jsonEscape(lx200BtLastUnhandled) + "\",";
  json += "\"mountCommFault\":" + String(mountCommFault ? "true" : "false") + ",";
  json += "\"mountBusy\":" + String(mountBusy ? "true" : "false") + ",";
  json += "\"mountUptime\":\"" + jsonEscape(formatMountUptime()) + "\",";
  json += "\"cpuLoad\":\"" + jsonEscape(sampleWebCpuLoadText()) + "\",";
  json += "\"freeHeap\":" + String(ESP.getFreeHeap());
  json += "}";
  return json;
}

void appendTinyBanner(String &page) {
  int y, mo, d, h, mi, se;
  currentLocalParts(y, mo, d, h, mi, se);
  page += F("<div class='card wide'><div class='v'>Time ");
  page += String(y) + "-" + twoDigits(mo) + "-" + twoDigits(d) + " " + twoDigits(h) + ":" + twoDigits(mi) + ":" + twoDigits(se);
  page += F("<br>Lat ");
  page += String(siteLatitudeDeg, 6);
  page += F(" / Lon ");
  page += String(siteLongitudeDeg, 6);
  page += F("<br>");
  page += sampleWebCpuLoadText();
  page += F("</div></div>");
}


