gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  page += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
  page += F("<title>");
  page += FW_NAME;
  page += F(" ");
  page += FW_VERSION;
  page += F(" BT</title>");
  page += F("<style>");
  page += F(":root{--bg:#0b1020;--panel:#151c2f;--panel2:#101729;--text:#edf2ff;--muted:#a9b4cf;--line:#2b3654;--accent:#4aa3ff;--bad:#ff8d8d;--ok:#8dffba}");
  page += F("*{box-sizing:border-box}body{margin:0;background:var(--bg);color:var(--text);font-family:Arial,Helvetica,sans-serif;font-size:16px}");
  page += F(".top{position:sticky;top:0;z-index:2;background:#080d1a;border-bottom:1px solid var(--line);padding:10px 14px;display:flex;align-items:center;justify-content:space-between;gap:12px;flex-wrap:wrap}.topActions{display:flex;gap:8px;align-items:center;flex-wrap:wrap}.brand{white-space:nowrap}");
  page += F(".brand{font-size:18px;font-weight:700}.brand small{display:block;font-size:12px;color:var(--muted);font-weight:400;margin-top:2px}.pill{border:1px solid var(--line);border-radius:999px;padding:5px 10px;color:var(--muted);background:var(--panel2);font-size:13px}");
  page += F(".wrap{max-width:920px;margin:0 auto;padding:14px}.grid{display:grid;grid-template-columns:1fr 1fr;gap:14px}.card{background:var(--panel);border:1px solid var(--line);border-radius:12px;padding:14px;box-shadow:0 1px 3px #0006}.wide{grid-column:1/-1}");
  page += F("h2{font-size:18px;margin:0 0 12px 0}p{color:var(--muted);line-height:1.35}.kv{display:grid;grid-template-columns:150px 1fr;gap:7px 12px;align-items:center}.k{color:var(--muted)}.v{font-family:Consolas,monospace;word-break:break-word}pre{white-space:pre-wrap;word-break:break-word;background:#090f1d;border:1px solid var(--line);border-radius:9px;padding:10px;margin:0;font-family:Consolas,monospace;font-size:13px;line-height:1.35}");
  page += F("form{margin:0}.row{display:grid;grid-template-columns:150px minmax(0,1fr);gap:10px 12px;align-items:center;margin:9px 0}label{color:var(--muted);font-weight:600;text-align:left}");
  page += F("input{width:100%;min-width:0;border:1px solid var(--line);background:#0a1122;color:var(--text);border-radius:8px;padding:9px 10px;font-size:15px}input:focus{outline:2px solid var(--accent);border-color:var(--accent)}");
  page += F(".hint{font-size:13px;color:var(--muted);margin:8px 0 0 162px}.actions{display:flex;gap:10px;flex-wrap:wrap;margin-top:12px}.btn,button{display:inline-flex;align-items:center;justify-content:center;border:1px solid var(--line);background:#1b2742;color:var(--text);border-radius:9px;padding:10px 12px;text-decoration:none;font:inherit;font-weight:700;cursor:pointer;line-height:1.2}.topActions .btn,.topActions button{min-width:76px;min-height:42px}.btn.primary,button.primary{background:#174b80;border-color:#2b72b9}.btn.warn{background:#4b2630;border-color:#88485a}");
  page += F("@media(max-width:760px){.grid{grid-template-columns:1fr}.row,.kv{grid-template-columns:1fr}label{text-align:left}.hint{margin-left:0}.top{align-items:flex-start}.brand{font-size:16px}}");
  page += F("body.themeLight{--bg:#f3f6fb;--panel:#ffffff;--panel2:#e9eef7;--text:#172033;--muted:#56627a;--line:#b9c5d8;--accent:#1769aa;--bad:#a00000;--ok:#08752f}.themeLight .top{background:#e9eef7}.themeLight .btn,.themeLight button{background:#e4eaf4;color:#172033}.themeLight .btn.primary,.themeLight button.primary{background:#d4e7f7;border-color:#1769aa}.themeLight pre,.themeLight input{background:#f7f9fc;color:#172033}.themeNight{--bg:#050000;--panel:#110000;--panel2:#190000;--text:#ff4a4a;--muted:#d42d2d;--line:#650000;--accent:#ff3030;--bad:#ff6060;--ok:#ff4040}.themeNight .top{background:#080000}.themeNight .card,.themeNight pre,.themeNight input{background:#100000!important;color:#ff4a4a!important}.themeNight .btn,.themeNight button{background:#260000!important;color:#ff4a4a!important;border-color:#750000!important}.themeNight .btn.primary,.themeNight button.primary{background:#520000!important;border-color:#a00000!important}.themeNight .btn.warn{background:#3a0000!important;border-color:#8a0000!important}.nightBtn.active{background:#7a0000!important;color:#ffb0b0!important;border-color:#ff3030!important}.statusModeBtn.active{border-color:var(--accent)!important}");
  page += F(".themeNight input[type=checkbox]{accent-color:#ff2020!important}.themeLight input[type=checkbox]{accent-color:#1769aa}.themeDark input[type=checkbox]{accent-color:#4aa3ff}</style><script>let baseTheme=localStorage.getItem('baseTheme')||'dark',nightMode=localStorage.getItem('nightMode')==='1',statusAdvanced=localStorage.getItem('statusAdvanced')==='1';function applyTinyTheme(){document.body.classList.remove('themeLight','themeDark','themeNight');document.body.classList.add(nightMode?'themeNight':(baseTheme==='light'?'themeLight':'themeDark'));let b=document.getElementById('nightModeBtn');if(b){b.classList.toggle('active',nightMode);b.textContent='Red'}let lb=document.getElementById('themeLightBtn'),db=document.getElementById('themeDarkBtn');if(lb)lb.classList.toggle('active',baseTheme==='light');if(db)db.classList.toggle('active',baseTheme==='dark')}function setBaseTheme(t){baseTheme=(t==='light')?'light':'dark';nightMode=false;localStorage.setItem('baseTheme',baseTheme);localStorage.setItem('nightMode','0');applyTinyTheme()}function toggleTinyNight(){nightMode=!nightMode;localStorage.setItem('nightMode',nightMode?'1':'0');applyTinyTheme()}function applyTinyStatusMode(){let b=document.getElementById('tinyBasic'),a=document.getElementById('tinyAdvanced'),x=document.getElementById('tinyStatusModeBtn');if(b)b.style.display=statusAdvanced?'none':'block';if(a)a.style.display=statusAdvanced?'block':'none';if(x){x.textContent=statusAdvanced?'Basic':'Advanced';x.classList.toggle('active',statusAdvanced)}}function toggleTinyStatusMode(){statusAdvanced=!statusAdvanced;localStorage.setItem('statusAdvanced',statusAdvanced?'1':'0');applyTinyStatusMode()}document.addEventListener('DOMContentLoaded',function(){applyTinyTheme();applyTinyStatusMode()});</script></head><body>");

  page += F("<div class='top'><div class='brand'>");
  page += FW_NAME;
  page += F(" ");
  page += FW_VERSION;
  page += F("</div><div class='topActions'>");
  page += F("<button id='nightModeBtn' class='btn warn nightBtn' type='button' onclick='toggleTinyNight()'>Red</button><button id='themeLightBtn' class='btn' type='button' onclick=\"setBaseTheme('light')\">Light</button><button id='themeDarkBtn' class='btn' type='button' onclick=\"setBaseTheme('dark')\">Dark</button>");
  page += F("<a class='btn warn' href='#' onclick=\"location.href='/reboot?return='+encodeURIComponent(location.href);return false\">Reboot</a>");
  page += F("<a class='btn primary' href='/mode?radio=wifi'>WiFi</a>");
  page += F("</div></div>");

  page += F("<div class='wrap'>");
  page += F("<div class='grid'>");
  appendTinyBanner(page);

  page += F("<!-- BT_LITE_MAIN_PAGE_v4.80 -->");
  page += F("<div class='actions wide' style='justify-content:space-between;align-items:center;margin-bottom:0'><button id='tinyStatusModeBtn' class='statusModeBtn' type='button' onclick='toggleTinyStatusMode()'>Advanced</button><a class='btn' href='#' onclick='location.reload();return false'>Refresh</a></div>");
  page += F("<div id='tinyBasic' class='wide'><div class='grid'><div class='card'><h2>Observer Status</h2><pre>");
  page += tinyEsc(basicStatusText());
  page += F("</pre></div><div class='card'><h2>System Health</h2><pre>");
  page += tinyEsc(basicSystemHealthText());
  page += F("</pre></div></div></div>");
  page += F("<div id='tinyAdvanced' class='wide' style='display:none'><div class='grid'><div class='card'><h2>Observer Status - Advanced</h2><pre>");
  page += tinyEsc(currentStateText());
  page += F("</pre></div><div class='card'><h2>System Health - Advanced</h2><pre>");
  page += tinyEsc(systemHealthText());
  page += F("</pre></div></div></div>");

  page += F("</div></div></body></html>");
  return page;
}

void serviceTinySetupServer() {
#if defined(ESP32)
  if (bridgeMode != BRIDGE_MODE_BT_MIN_WEB) return;
  if (!wifiRuntimeEnabled) return;
  if (!tinyWebServerRuntimeEnabled) return;
  WiFiClient c = tinySetupServer.available();
  if (!c) return;

  c.setTimeout(700);
  String req = c.readStringUntil('\r');
  c.readStringUntil('\n');

  while (c.connected()) {
    String h = c.readStringUntil('\n');
    if (h == "\r" || h.length() == 0) break;
  }

  String tinyPath = "/";
  int tinySp1 = req.indexOf(' ');
  int tinySp2 = tinySp1 >= 0 ? req.indexOf(' ', tinySp1 + 1) : -1;
  if (tinySp1 >= 0 && tinySp2 > tinySp1) {
    tinyPath = req.substring(tinySp1 + 1, tinySp2);
  }

  // Some clients/proxies can send an absolute URI in the request line.
  // Convert "http://host/status?x=1" to "/status?x=1" before routing.
  if (tinyPath.startsWith("http://") || tinyPath.startsWith("https://")) {
    int scheme = tinyPath.indexOf("://");
    int slash = scheme >= 0 ? tinyPath.indexOf('/', scheme + 3) : -1;
    tinyPath = slash >= 0 ? tinyPath.substring(slash) : String("/");
  }

  int tinyQ = tinyPath.indexOf('?');
  String tinyPathOnly = tinyQ >= 0 ? tinyPath.substring(0, tinyQ) : tinyPath;
  tinyPathOnly.trim();

  LOG_WEB_D("BT tiny request route: req='%s' path='%s' pathOnly='%s'", req.c_str(), tinyPath.c_str(), tinyPathOnly.c_str());

  String tinyPageMode = tinyQueryParam(req, "page");
  tinyPageMode.toLowerCase();
  if (tinyPageMode == "status") {
    tinySetupSendHtml(c, tinyStatusPage());
    c.stop();
    return;
  }

  if (tinyPathOnly == "/status") {
    tinySetupSendRedirect(c, "/?page=status");
    c.stop();
    return;
  }

  if (tinyPathOnly == "/btstatus") {
    tinySetupSendJson(c, tinyBtStatusJson());
    c.stop();
    return;
  }

  if (tinyPathOnly == "/btpoll") {
    int p = tinyQueryParam(req, "poll").toInt();
    if (p < 0) p = 0;
    if (p > 60000) p = 60000;
    pollIntervalMs = (unsigned long)p;
    resetMountPollScheduler();
    bool saved = saveBluetoothLitePollInterval(pollIntervalMs);

    tinySetupSendRedirect(c, "/");
    c.stop();
    return;
  }

  if ((tinyPathOnly == "/mode" && tinyPath.indexOf("radio=wifi") >= 0) ||
      (tinyPathOnly == "/setmode" && tinyPath.indexOf("mode=wifi") >= 0)) {
    saveBridgeMode(BRIDGE_MODE_WIFI_FULL);
    String ret = tinyQueryParam(req, "return");
    if (!ret.startsWith("http://")) ret = String("http://") + (WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : WiFi.softAPIP().toString()) + "/";
    String page;
    page.reserve(900);
    page += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'><meta http-equiv='refresh' content='7;url=");
    page += ret;
    page += F("'><script>setTimeout(function(){location.replace('");
    page += ret;
    page += F("')},7000)</script></head><body><h2>Full WiFi mode saved</h2><p>Rebooting into full WiFi mode...</p><p>The page should return to the same host automatically.</p><p><a href='");
    page += ret;
    page += F("'>Open main UI</a></p></body></html>");
    tinySetupSendHtml(c, page);
    c.stop();
    delay(900);
    ESP.restart();
    return;
  }

  if (tinyPathOnly == "/mode" && tinyPath.indexOf("radio=bt") >= 0) {
    saveBridgeMode(BRIDGE_MODE_BT_MIN_WEB);
    tinySetupSendRedirect(c, "/");
    c.stop();
    return;
  }

  if (tinyPathOnly == "/wifi_save") {
    loadWiFiConfig();
    String target = tinyQueryParam(req, "target");
    String ssid = tinyQueryParam(req, "ssid");
    String pass = tinyQueryParam(req, "pass");

