gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
    ssid.trim();

    bool ok = true;
    String msg;
    if (target == "sta") {
      staSsid = ssid;
      staPass = pass;
      staRuntimeDisabled = false;  // STA Setup means boot BT in STA mode.
      staConnected = false;
      msg = "STA settings saved; STA enabled for STA boot";
    } else if (target == "ap") {
      if (ssid.length() == 0) {
        ok = false;
        msg = "AP SSID cannot be blank";
      } else if (pass.length() > 0 && pass.length() < 8) {
        ok = false;
        msg = "AP password must be blank/open or at least 8 characters";
      } else {
        String ip = tinyQueryParam(req, "ip");
        ip.trim();
        IPAddress testIp;
        if (ip.length() == 0) ip = apIp;
        if (!parseIpAddress(ip, testIp)) {
          ok = false;
          msg = "AP IP is invalid";
        } else {
          String suffix = deviceMacSuffix();
          if (suffix.length() > 0 && ssid.endsWith("-" + suffix)) {
            ssid = ssid.substring(0, ssid.length() - suffix.length() - 1);
          }
          apSsid = ssid;
          apPass = pass;
          apIp = ip;
          staRuntimeDisabled = true;   // AP Setup means boot BT in AP-only mode.
          staConnected = false;
          msg = "AP settings saved; STA disabled for AP-only boot";
        }
      }
    } else {
      ok = false;
      msg = "Unknown WiFi settings target";
    }

    bool saveOk = false;
    if (ok) {
      LOG_WIFI_I("BT WiFi save target=%s apSsid=%s apIp=%s staRuntimeDisabled=%d", target.c_str(), apSsid.c_str(), apIp.c_str(), staRuntimeDisabled ? 1 : 0);
      if (target == "sta") {
        saveOk = saveWiFiConfig(staSsid, staPass) && saveBluetoothLiteStaModeFlag(false);
      } else if (target == "ap") {
        saveOk = saveBluetoothLiteApOnlySettings();
      }

      if (!saveOk) {
        String page = F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'></head><body><h2>Save failed</h2><p>Could not write WiFi settings to storage.</p><p><a href='/'>Back</a></p></body></html>");
        tinySetupSendHtml(c, page);
        c.stop();
        return;
      }

      String page = F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'></head><body><h2>");
      page += msg;
      if (target == "ap") {
        page += F("</h2><p>Rebooting into BT AP-only mode. Reconnect to the AP SSID shown on the setup page after reboot.</p>");
      } else if (target == "sta") {
        page += F("</h2><p>Rebooting into BT STA mode. Use the router-assigned STA IP after reboot, or fall back to AP if STA cannot connect.</p>");
      } else {
        page += F("</h2><p>Rebooting so BT uses the new saved WiFi configuration...</p>");
      }
      page += F("</body></html>");
      tinySetupSendHtml(c, page);
      c.stop();
      delay(900);
      ESP.restart();
      return;
    } else {
      String page = F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'></head><body><h2>Save failed</h2><p>");
      page += tinyEsc(msg);
      page += F("</p><p><a href='/'>Back</a></p></body></html>");
      tinySetupSendHtml(c, page);
      c.stop();
      return;
    }
  }

  if (tinyPathOnly == "/reboot") {
    String ret = tinyReturnUrlFromRequest(req);
    tinySetupSendHtml(c, tinyRebootRedirectPage("Rebooting", ret));
    c.stop();
    delay(900);
    ESP.restart();
    return;
  }

  tinySetupSendHtml(c, tinySetupPage());
  c.stop();
#endif
}



void handleSetBtPollPage() {
  logHttpRequest("SET_BT_POLL");
  int p = server.hasArg("poll") ? server.arg("poll").toInt() : (int)pollIntervalMs;
  if (p < 0) p = 0;
  if (p > 60000) p = 60000;
  pollIntervalMs = (unsigned long)p;
  resetMountPollScheduler();
  bool saved = savePersistentSettings();

  String msg = String("Mount poll interval set to ") + String(pollIntervalMs) + " ms";
  if (!saved) msg += " (save failed)";

  if (wantsAjax()) {
    if (saved) sendAjaxOK(msg);
    else sendAjaxFail(msg);
  } else {
    server.sendHeader("Location", "/");
    server.send(303, "text/plain", msg);
  }
}

void startFallbackAP() {
  if (!apRunning) {
#if defined(ESP32)
    // Make AP the recovery path. Even if STA is later used, AP must remain up.
    WiFi.mode(staRuntimeDisabled ? WIFI_AP : WIFI_STA);
#endif
    IPAddress ip;
    if (!parseIpAddress(apIp, ip)) {
      LOG_WIFI_W("Invalid AP IP '%s', using 192.168.4.1", apIp.c_str());
      ip = IPAddress(192, 168, 4, 1);
      apIp = "192.168.4.1";
    }

    IPAddress gw = ip;
    IPAddress mask(255, 255, 255, 0);
    bool cfgOk = WiFi.softAPConfig(ip, gw, mask);
    bool apOk = WiFi.softAP(runtimeApSsid().c_str(), apPass.length() ? apPass.c_str() : nullptr);
    apRunning = cfgOk && apOk;
    if (!apRunning) {
      LOG_WIFI_E("Fallback AP start FAILED: cfg=%d ap=%d ssid=%s ip=%s", cfgOk ? 1 : 0, apOk ? 1 : 0, apSsid.c_str(), apIp.c_str());
    }
  }
  LOG_WIFI_I("Fallback AP active: SSID=%s IP=%s running=%d", apSsid.c_str(), WiFi.softAPIP().toString().c_str(), apRunning ? 1 : 0);
}

bool connectConfiguredSTA() {
  staConnected = false;

  if (!staConfigured || staSsid.length() == 0) {
    lastWifiStatus = "No STA configured; AP fallback active";
    startFallbackAP();
    wifiModeText = "AP";
    return false;
  }

#if defined(ESP32)
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.disconnect(false, true);   // reset STA state, keep saved ESP32 SDK config untouched
  delay(150);
#endif

  LOG_WIFI_I("Connecting STA to SSID '%s' passLen=%u", staSsid.c_str(), (unsigned)staPass.length());
  WiFi.begin(staSsid.c_str(), staPass.c_str());

  unsigned long start = millis();
  wl_status_t lastStatusSeen = WiFi.status();
  while (millis() - start < WIFI_CONNECT_TIMEOUT_MS) {
    wl_status_t s = WiFi.status();
    if (s != lastStatusSeen) {
      lastStatusSeen = s;
      LOG_WIFI_I("STA status: %s", wifiStatusCodeText(s).c_str());
    }

    if (s == WL_CONNECTED) {
      staConnected = true;
      lastWifiStatus = "STA connected";
      wifiModeText = apRunning ? "STA-only/AP-only" : "STA";
      LOG_WIFI_I("STA connected: SSID=%s IP=%s RSSI=%d", staSsid.c_str(), WiFi.localIP().toString().c_str(), WiFi.RSSI());
      saveLastStaIp(WiFi.localIP().toString());

      // v5.09: Internet-backed STA operation should use NTP by default.
      // A previously saved disabled value must not leave time synchronization
      // silently off after a successful STA connection.
      if (!ntpEnabled) {
        ntpEnabled = true;
        bool ntpSaveOk = savePersistentSettings();
        LOG_TIME_I("STA connected: NTP automatically enabled and persistent save=%s",
                   ntpSaveOk ? "ok" : "failed");
      }
      syncTimeFromNTP(true);
      return true;
    }

    delay(250);
    yield();
  }

  wl_status_t finalStatus = WiFi.status();
  staConnected = false;
  lastWifiStatus = "STA failed: " + wifiStatusCodeText(finalStatus);
  LOG_WIFI_W("STA connect failed for SSID '%s'; finalStatus=%s; keeping AP fallback active", staSsid.c_str(), wifiStatusCodeText(finalStatus).c_str());
  startFallbackAP();
  wifiModeText = "AP fallback";
  return false;
}

