gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
void setupWiFiFromSavedConfig() {
  loadWiFiConfig();

#if defined(ESP32)
  WiFi.persistent(false);
  WiFi.disconnect(true, true);
  WiFi.softAPdisconnect(true);
  delay(150);
#endif

  apRunning = false;
  staConnected = false;

  // IMPORTANT STABILITY RULE:
  // Never run AP and STA at the same time.
  // If STA is configured and not disabled, try STA-only first.
  // If STA is missing or fails, switch completely to AP-only fallback.
  if (!staRuntimeDisabled && staSsid.length() > 0) {
#if defined(ESP32)
    WiFi.mode(WIFI_STA);
    delay(100);
#endif
    wifiModeText = "STA only";
    lastWifiStatus = "Trying STA-only connection";
    Serial.printf("[WIFI] Exclusive mode: STA-only, SSID=%s\n", staSsid.c_str());

    connectConfiguredSTA();

    if (WiFi.status() == WL_CONNECTED) {
      staConnected = true;
      apRunning = false;
      wifiModeText = "STA only";
      lastWifiStatus = String("STA connected: ") + WiFi.localIP().toString();
      Serial.printf("[WIFI] STA-only connected, IP=%s\n", WiFi.localIP().toString().c_str());
      return;
    }

    Serial.println("[WIFI] STA-only failed; switching to AP-only fallback");
#if defined(ESP32)
    WiFi.disconnect(true, true);
    delay(150);
    WiFi.mode(WIFI_OFF);
    delay(100);
#endif
  }

  // AP-only fallback. STA is fully off here.
#if defined(ESP32)
  WiFi.mode(WIFI_AP);
  delay(100);
#endif
  staConnected = false;
  apRunning = false;
  startFallbackAP();
  wifiModeText = "AP only";
  lastWifiStatus = String("AP-only mode: ") + WiFi.softAPIP().toString();
  Serial.printf("[WIFI] AP-only active, IP=%s\n", WiFi.softAPIP().toString().c_str());
}


// Bright Star Catalog data is stored separately.
#include "bsc5_catalog_data.h"

void handleBsc5DataPage() {
  logHttpRequest("BSC5 data");
  sendNoCacheHeaders();
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/plain", "");
  for (uint16_t i = 0; i < BSC5_CHUNK_COUNT; i++) {
    const char* p = (const char*)pgm_read_ptr(&BSC5_CHUNKS[i]);
#if defined(ESP8266)
    server.sendContent_P(p);
#else
    server.sendContent_P(p);
#endif
    delay(1);
    yield();
  }
  server.sendContent("");
}

void sendWebPage() {
  // Stream the page in chunks instead of building one huge String.
  // This avoids ESP8266 heap fragmentation/crashes when the UI grows.
  server.sendHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "0");
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", "");

  server.sendContent(F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'><meta http-equiv='Cache-Control' content='no-store, no-cache, must-revalidate, max-age=0'><meta http-equiv='Pragma' content='no-cache'><meta http-equiv='Expires' content='0'><title>NexStar Converter</title>"));
  server.sendContent(F("<style>body{font-family:Arial,Helvetica,sans-serif;background:#0b1020;color:#edf2ff;margin:0;padding:10px;font-size:var(--ui-scale,16px)}.topbar{position:sticky;top:0;z-index:2;background:#080d1a;border:1px solid #2b3654;border-radius:12px;padding:10px 14px;display:flex;align-items:center;justify-content:space-between;gap:12px;margin-bottom:10px;box-shadow:0 1px 3px #0006}.scaleCtl{margin-left:auto;display:flex;align-items:center;gap:6px;background:#101729;border:1px solid #2b3654;border-radius:10px;padding:4px 6px;white-space:nowrap;flex-wrap:nowrap}.scaleCtl button{min-width:2em;padding:.25em .5em}.scaleCtl span{display:inline-block;min-width:2.7em;text-align:center;font-size:.95em}h2{margin:4px 0 10px}.topbar h2{font-size:18px;margin:0;font-weight:700}h3{margin:4px 0 8px}button,input,select{font-size:1em;margin:.2em;padding:.48em .55em;max-width:100%;box-sizing:border-box}input{width:120px;max-width:95%;border:1px solid #2b3654;background:#0a1122;color:#edf2ff;border-radius:8px}select{border:1px solid #2b3654;background:#0a1122;color:#edf2ff;border-radius:8px;color-scheme:dark;-webkit-appearance:auto;appearance:auto}select option{background:#0a1122;color:#edf2ff}select option:disabled{color:#7f899f!important;background:#101729!important}select option:checked{background:#174b80;color:#fff}input:focus,select:focus{outline:2px solid #4aa3ff;border-color:#4aa3ff}button{border-radius:9px;border:1px solid #2b3654;background:#1b2742;color:#edf2ff;font-weight:700;cursor:pointer}.quick{font-size:.9em;background:#151c2f;border:1px solid #2b3654;border-radius:12px;padding:8px;margin:8px 0;box-shadow:0 1px 3px #0006}.tabs{display:flex;gap:6px;overflow-x:auto;margin:8px 0 12px}.tabs button{white-space:nowrap;padding:8px 11px;background:#1b2742;border-color:#2b3654}.tabs button.active{background:#174b80;color:#edf2ff;font-weight:bold;border-color:#2b72b9}.tab{display:none}.tab.active{display:block}.grid{display:block}.tab .card{margin-bottom:10px}.card{background:#151c2f;padding:14px;border-radius:12px;border:1px solid #2b3654;min-width:0;box-shadow:0 1px 3px #0006}.row{display:flex;flex-wrap:wrap;align-items:center;gap:4px}.formrow{display:grid;grid-template-columns:150px minmax(0,1fr);gap:10px 12px;align-items:center;margin:9px 0}.formrow label{color:#a9b4cf;font-weight:bold;text-align:left}.formrow input,.formrow select{width:100%;max-width:100%;margin:0}.hint{font-size:13px;color:#a9b4cf;margin:8px 0 0 162px;line-height:1.35}.actions{display:flex;gap:8px;flex-wrap:wrap;margin-top:10px}.pad{text-align:center}.pad button{min-width:5.5em;min-height:3.25em;font-size:1.15em}pre{background:#080d1a;color:#8dffba;border:1px solid #2b3654;padding:8px;overflow:auto;white-space:pre-wrap;border-radius:8px;min-height:260px}.small{font-size:13px;color:#a9b4cf}.msg{padding:6px;border-radius:8px;background:#101729;color:#edf2ff;border:1px solid #2b3654;margin:5px 0;min-height:18px}.ok{color:#8dffba}.bad{color:#ff8d8d}.health{font-size:18px;font-weight:bold;padding:8px;border-radius:8px;margin-bottom:6px;background:#101729;border:1px solid #2b3654}.alive{border-color:#8dffba!important}.busy{border-color:#ffcc66!important}.idle{border-color:#2b3654!important}.fault{border-color:#ff0000!important;animation:flash .7s infinite}@keyframes flash{0%{border-color:#ff0000}50%{border-color:#550000}100%{border-color:#ff0000}}@media (max-width:699px){.topbar{flex-wrap:wrap}.scaleCtl{margin-left:0;width:100%;max-width:100%;overflow-x:auto;box-sizing:border-box}.tabs{max-width:100%;box-sizing:border-box}.grid{grid-template-columns:1fr}.card{width:100%;box-sizing:border-box}.row{display:block}.formrow{grid-template-columns:1fr}.formrow label{text-align:left}.hint{margin-left:0}.row button,.row select{display:block;width:100%;margin:6px 0}.pad button{min-width:72px}.msg,pre{max-width:100%;overflow:auto}}@media (min-width:700px){.grid{display:block}.tab.active{display:grid;grid-template-columns:1fr 1fr;gap:10px}.status{grid-column:auto}.logs{grid-column:auto}.tab .card{margin-bottom:0}}@media (min-width:1100px){.tab.active{grid-template-columns:1fr 1fr 1fr}}.logAlert{font-weight:bold;color:#ffcc00;animation:blinkAlert 1s step-start infinite;cursor:pointer}.logAlert.off{display:none}@keyframes blinkAlert{50%{opacity:0}}.catBtns button{margin:4px}.catInfo{font-size:.9em;background:#101729;padding:6px;border-radius:8px;margin:6px 0;display:block;width:100%;box-sizing:border-box;border:1px solid #2b3654;color:#edf2ff;line-height:1.35}.dark .catInfo{background:#101729}.logs pre{height:360px;overflow-y:auto;scroll-behavior:auto}.loggrid{display:grid;grid-template-columns:repeat(3,minmax(150px,1fr));gap:8px 18px;align-items:center;margin:8px 0}.loggrid label{display:grid;grid-template-columns:22px 1fr;align-items:center;column-gap:6px;margin:0;white-space:nowrap}.loggrid input[type=checkbox]{margin:0;width:18px;height:18px;justify-self:start}@media(max-width:520px){.loggrid{grid-template-columns:repeat(2,minmax(130px,1fr))}}.themeLight{background:#f3f5f8!important;color:#172033!important}.themeLight .topbar{background:#fff!important;border-color:#bcc5d2!important;box-shadow:0 1px 4px #0002}.themeLight .scaleCtl,.themeLight .quick,.themeLight .card,.themeLight .msg,.themeLight .health,.themeLight .catInfo{background:#fff!important;color:#172033!important;border-color:#bcc5d2!important;box-shadow:0 1px 3px #0002}.themeLight input,.themeLight select,.themeLight pre{background:#f8fafc!important;color:#172033!important;border-color:#aab4c2!important}.themeLight select{color-scheme:light!important}.themeLight select option{background:#f8fafc!important;color:#172033!important}.themeLight select option:disabled{background:#eef1f5!important;color:#8993a3!important}.themeLight select option:checked{background:#1769aa!important;color:#fff!important}.themeLight button,.themeLight .tabs button,.themeLight .badge{background:#e5eaf1!important;color:#172033!important;border-color:#aab4c2!important}.themeLight .tabs button.active{background:#1769aa!important;color:#fff!important;border-color:#12568c!important}.themeLight .formrow label,.themeLight .hint,.themeLight .small{color:#4b5668!important}.themeLight pre{color:#163b22!important}.themeNight{background:#050000!important;color:#ff3a3a!important}.themeNight *{text-shadow:none!important}.themeNight .topbar{background:#100000!important;border-color:#5a0000!important;box-shadow:none!important}.themeNight .scaleCtl,.themeNight .quick,.themeNight .card,.themeNight .msg,.themeNight .health,.themeNight .catInfo{background:#100000!important;color:#ff3a3a!important;border-color:#5a0000!important;box-shadow:none!important}.themeNight input,.themeNight select,.themeNight pre{background:#050000!important;color:#ff3a3a!important;border-color:#650000!important}.themeNight select{color-scheme:dark!important}.themeNight select option{background:#050000!important;color:#ff3a3a!important}.themeNight select option:disabled{background:#100000!important;color:#7f2020!important}.themeNight select option:checked{background:#5a0000!important;color:#ff7070!important}.themeNight button,.themeNight .tabs button,.themeNight .badge{background:#260000!important;color:#ff4a4a!important;border-color:#750000!important}.themeNight button:hover{background:#3a0000!important}.themeNight .tabs button.active{background:#5a0000!important;color:#ff7070!important;border-color:#a00000!important}.themeNight .formrow label,.themeNight .hint,.themeNight .small,.themeNight .ok,.themeNight .bad{color:#ff3a3a!important}.themeNight .alive,.themeNight .busy,.themeNight .idle,.themeNight .fault{border-color:#8a0000!important}.themeNight .logAlert{color:#ff3a3a!important}.nightBtn.active{background:#7a0000!important;color:#ffb0b0!important;border-color:#ff3030!important}.statusModeBtn.active{border-color:var(--accent)!important}.themeChoice{display:flex;gap:8px;flex-wrap:wrap}.themeChoice button.active{outline:2px solid #4aa3ff}.themeNight .themeChoice button.active{outline-color:#ff3030}.themeLight .themeChoice button.active{outline-color:#1769aa}.statusPair{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:10px;grid-column:1/-1}.statusPair>.card{margin-bottom:0}@media(max-width:760px){.statusPair{grid-template-columns:1fr}}input[type=checkbox]{accent-color:#1769aa}.themeDark input[type=checkbox]{accent-color:#4aa3ff}.themeLight input[type=checkbox]{accent-color:#1769aa}.themeNight input[type=checkbox]{accent-color:#d40000!important;filter:brightness(.9) saturate(1.4)}.themeNight input[type=checkbox]:checked{accent-color:#ff2020!important}</style>"));
  server.sendContent(F("<script>"));
  server.sendContent(F("const FW_VERSION='"));
  server.sendContent(FW_VERSION);
  server.sendContent(F("';let busy=false,uiScale=parseFloat(localStorage.getItem('uiScale')||'1'),baseTheme=localStorage.getItem('baseTheme')||'dark',nightMode=localStorage.getItem('nightMode')==='1',statusAdvanced=localStorage.getItem('statusAdvanced')==='1';function id(x){return document.getElementById(x)}function enc(v){return encodeURIComponent(v)}function cb(u){return u+(u.includes('?')?'&':'?')+'fw='+enc(FW_VERSION)+'&t='+Date.now()}function setMsg(n,t,c){let e=id(n);if(e){e.textContent=t;e.className='msg '+(c||'')}}function applyScale(){document.documentElement.style.setProperty('--ui-scale',(16*uiScale)+'px');let e=id('scalePct');if(e)e.textContent=Math.round(uiScale*100)+'%';localStorage.setItem('uiScale',uiScale.toFixed(2))}function scaleUi(d){uiScale=Math.max(0.7,Math.min(1.6,uiScale+d));applyScale()}function resetScale(){uiScale=1;applyScale()}function applyTheme(){document.body.classList.remove('themeLight','themeDark','themeNight');document.body.classList.add(nightMode?'themeNight':(baseTheme==='light'?'themeLight':'themeDark'));let cs=(!nightMode&&baseTheme==='light')?'light':'dark';document.documentElement.style.colorScheme=cs;document.querySelectorAll('select').forEach(e=>{e.style.colorScheme=cs});let nb=id('nightModeBtn');if(nb){nb.classList.toggle('active',nightMode);nb.textContent='Red'}let lb=id('themeLightBtn'),db=id('themeDarkBtn');if(lb)lb.classList.toggle('active',baseTheme==='light');if(db)db.classList.toggle('active',baseTheme==='dark')}function setBaseTheme(t){baseTheme=(t==='light')?'light':'dark';nightMode=false;localStorage.setItem('baseTheme',baseTheme);localStorage.setItem('nightMode','0');applyTheme()}function toggleNightMode(){nightMode=!nightMode;localStorage.setItem('nightMode',nightMode?'1':'0');applyTheme()}function applyStatusMode(){let a=id('statusAdvancedWrap'),b=id('statusBasicWrap'),btn=id('statusModeBtn');if(a)a.style.display=statusAdvanced?'grid':'none';if(b)b.style.display=statusAdvanced?'none':'grid';if(btn){btn.textContent=statusAdvanced?'Basic':'Advanced';btn.classList.toggle('active',statusAdvanced)}}function toggleStatusMode(){statusAdvanced=!statusAdvanced;localStorage.setItem('statusAdvanced',statusAdvanced?'1':'0');applyStatusMode()}function showTab(n){document.querySelectorAll('.tab').forEach(e=>e.classList.remove('active'));document.querySelectorAll('.tabs button').forEach(e=>e.classList.remove('active'));let t=id('tab_'+n);if(t)t.classList.add('active');let b=id('btn_'+n);if(b)b.classList.add('active');localStorage.setItem('activeTab',n)}function restoreTab(){showTab(localStorage.getItem('activeTab')||'control')}async function getText(u){let r=await fetch(cb(u),{cache:'no-store'});return await r.text()}async function getJson(u){let r=await fetch(cb(u),{cache:'no-store'});let t=await r.text();try{return JSON.parse(t)}catch(e){return {ok:r.ok,message:t||'OK'}}}async function jsonAction(url,msg,onOk,jsName){if(busy)return;busy=true;let el=id(msg);if(el){el.textContent='Working...';el.className='msg'}try{let full=url+(url.includes('?')?'&':'?')+'ajax=1';if(jsName)full+='&js='+enc(jsName);let j=await getJson(full);if(j.ok&&url.startsWith('/set_manual_site_time'))clearSiteDirty();if(j.ok&&url.startsWith('/setrates'))clearRateDirty();if(j.ok&&onOk)onOk();if(el){el.textContent=j.message||'OK';el.className='msg '+(j.ok?'ok':'bad')}if(j.ok&&j.redirectUrl){let d=Number(j.redirectDelayMs||1200);setTimeout(()=>{window.location.href=j.redirectUrl},d);busy=false;return}}catch(e){if(el){el.textContent='Request failed';el.className='msg bad'}}busy=false;setTimeout(updateNow,500)}"));
  server.sendContent(F("function setLog(l){setVal('logLevelSel',l);applyLogSettings()}function clearLogs(){let lb=id('logBox');if(lb)lb.textContent='';jsonAction('/clearlogs','logsMsg',function(){updateNow()},'clearLogs')}function clearLogAlert(){jsonAction('/clearlogalert','logsMsg',function(){updateNow()},'clearLogAlert')}function setRate(){jsonAction('/setwebrate?rate='+enc(id('rateSel').value),'mainMsg',null,'setRate')}function nudge(d){jsonAction('/webnudge?dir='+enc(d),'mainMsg',null,'nudge')}function readRaDec(){jsonAction('/getradecweb','gotoMsg',function(){setTimeout(updateNow,700);setTimeout(function(){updateNow();loadCurrentRaDecTarget()},1600)},'readRaDec')}function readAltAz(){jsonAction('/getaltazweb','altazMsg',function(){setTimeout(updateNow,700);setTimeout(function(){updateNow();loadCurrentAltAzTarget()},1600)},'readAltAz')}function startupReadAltAz(){fetch('/getaltazweb').then(()=>{setTimeout(updateNow,900);setTimeout(function(){if(!targetsInitialized&&lastStatus){setTargetRaDec(lastStatus.raHours,lastStatus.decDeg);setTargetAltAz(lastStatus.altDeg,lastStatus.azDeg);targetsInitialized=true}},1800)}).catch(()=>{})}"));
  server.sendContent(F("function julianFromStatus(){if(!lastStatus)return NaN;let ms=Date.UTC(lastStatus.localYear,lastStatus.localMonth-1,lastStatus.localDay,lastStatus.localHour,lastStatus.localMinute,lastStatus.localSecond)-Number(lastStatus.utcOffsetMinutes||0)*60000;return ms/86400000+2440587.5}function lstHours(){let jd=julianFromStatus();if(!isFinite(jd)||!lastStatus)return NaN;let T=(jd-2451545.0)/36525.0;let gmst=280.46061837+360.98564736629*(jd-2451545.0)+0.000387933*T*T-T*T*T/38710000.0;let lst=(gmst+Number(lastStatus.longitude))/15.0;lst=lst%24;if(lst<0)lst+=24;return lst}function radecToAltDeg(raHours,decDeg){if(!lastStatus||!lastStatus.siteValid||!lastStatus.timeValid)return NaN;let lat=Number(lastStatus.latitude)*Math.PI/180,dec=Number(decDeg)*Math.PI/180,ha=(lstHours()-Number(raHours))*15*Math.PI/180;let s=Math.sin(dec)*Math.sin(lat)+Math.cos(dec)*Math.cos(lat)*Math.cos(ha);return Math.asin(Math.max(-1,Math.min(1,s)))*180/Math.PI}function confirmAboveHorizonRaDec(ra,dec,msg){let alt=radecToAltDeg(ra,dec);if(!isFinite(alt)){setMsg(msg,'Cannot verify horizon: valid site/time required','bad');return false}if(alt<0){setMsg(msg,'Blocked by horizon safety: target Alt '+alt.toFixed(2)+' deg','bad');return false}let cb=id('alt_limit_enable');if(cb&&cb.checked){let mn=Number(id('alt_min').value),mx=Number(id('alt_max').value);if(isFinite(mn)&&isFinite(mx)&&mn<mx&&(alt<mn||alt>mx)){setMsg(msg,'Blocked by Alt limit: '+alt.toFixed(2)+' deg allowed '+mn.toFixed(2)+' to '+mx.toFixed(2),'bad');return false}}return true}function confirmAboveHorizonAltAz(alt,msg){let a=Number(alt);if(!isFinite(a)){setMsg(msg,'Invalid target altitude','bad');return false}if(a<0){setMsg(msg,'Blocked by horizon safety: target Alt '+a.toFixed(2)+' deg','bad');return false}let enabled=false,mn=0,mx=90;let cb=id('alt_limit_enable'),mi=id('alt_min'),ma=id('alt_max');if(cb){enabled=cb.checked;mn=Number(mi?mi.value:0);mx=Number(ma?ma.value:90)}else if(lastStatus){enabled=!!lastStatus.safeAltLimitEnabled;mn=Number(lastStatus.safeAltMinDeg);mx=Number(lastStatus.safeAltMaxDeg)}if(enabled){if(!isFinite(mn)||!isFinite(mx)||mn>=mx){setMsg(msg,'Invalid Alt safety limits','bad');return false}if(a<mn||a>mx){setMsg(msg,'Blocked by Alt limit: '+a.toFixed(2)+' deg allowed '+mn.toFixed(2)+' to '+mx.toFixed(2),'bad');return false}}return true}function confirmSafeDec(dec,msg){return true}function gotoRaDec(){let ra=Number(id('ra_hours').value),dec=Number(id('dec_deg').value);if(!isFinite(ra)||ra<0||ra>=24){setMsg('gotoMsg','RA must be from 0 up to, but not including, 24 hours','bad');return}if(!isFinite(dec)||dec<-90||dec>90){setMsg('gotoMsg','Declination must be from -90 to +90 degrees','bad');return}if(!confirmAboveHorizonRaDec(ra,dec,'gotoMsg'))return;jsonAction('/webgoto_radec?ra_hours='+enc(ra)+'&dec_deg='+enc(dec),'gotoMsg',function(){setTimeout(updateNow,1200)},'gotoRaDec')}function gotoAltAz(){let alt=Number(id('alt_deg').value),az=Number(id('az_deg').value);if(!isFinite(alt)||alt<-90||alt>90){setMsg('altazMsg','Altitude must be from -90 to +90 degrees','bad');return}if(!isFinite(az)||az<0||az>=360){setMsg('altazMsg','Azimuth must be from 0 up to, but not including, 360 degrees','bad');return}if(!confirmAboveHorizonAltAz(alt,'altazMsg'))return;jsonAction('/webgoto_altaz?alt_deg='+enc(alt)+'&az_deg='+enc(az),'altazMsg',function(){setTimeout(updateNow,1200)},'gotoAltAz')}"));
  server.sendContent(F("function saveAltLimits(){let en=id('alt_limit_enable').checked?1:0;jsonAction('/setaltlimits?enabled='+en+'&min='+enc(id('alt_min').value)+'&max='+enc(id('alt_max').value),'altLimitMsg',function(){clearFieldsDirty(['alt_limit_enable','alt_min','alt_max']);setTimeout(updateNow,300)},'saveAltLimits')}function saveDecLimits(){let en=id('dec_limit_enable').checked?1:0;jsonAction('/setdeclimits?enabled='+en+'&min='+enc(id('dec_min').value)+'&max='+enc(id('dec_max').value),'decLimitMsg',function(){clearFieldsDirty(['dec_limit_enable','dec_min','dec_max']);setTimeout(updateNow,300)},'saveDecLimits')}function saveRates(){jsonAction('/setrates?r1='+enc(id('r1').value)+'&r2='+enc(id('r2').value)+'&r3='+enc(id('r3').value)+'&r4='+enc(id('r4').value),'settingsMsg',null,'saveRates')}function resetRates(){jsonAction('/resetrates','settingsMsg',null,'resetRates')}"));
  server.sendContent(F("function saveManualSiteTime(){jsonAction('/set_manual_site_time?lat='+enc(id('lat').value)+'&lon='+enc(id('lon').value)+'&offset='+enc(id('offset').value)+'&year='+enc(id('year').value)+'&month='+enc(id('month').value)+'&day='+enc(id('day').value)+'&hour='+enc(id('hour').value)+'&minute='+enc(id('minute').value)+'&second='+enc(id('second').value)+'&poll='+enc(id('poll').value)+'&idlepoll='+enc(id('idlepoll').value)+'&throttle='+enc(id('throttle').value),'siteMsg',null,'saveManualSiteTime')}function startHttpsTimeLocation(){setMsg('siteMsg','Starting GPS Sync HTTPS server...','ok');let ret=location.href;fetch(cb('/start_https?json=1&return='+enc(ret)),{cache:'no-store'}).then(r=>r.text()).then(t=>{let j=null;try{j=JSON.parse(t)}catch(e){throw new Error('bad GPS Sync response: '+t.slice(0,80))}if(j.ok&&j.url){setMsg('siteMsg','Opening GPS Sync HTTPS page. Accept the certificate warning if shown.','ok');setTimeout(()=>{location.href=j.url},700)}else setMsg('siteMsg',j.error||'GPS Sync start failed','bad')}).catch(e=>setMsg('siteMsg','GPS Sync start failed: '+e,'bad'))}"));
