gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  server.sendContent(F("function clearSavedSite(){jsonAction('/clearsettings','siteMsg',function(){clearFieldsDirty(['lat','lon','offset','year','month','day','hour','minute','second','poll','idlepoll','throttle']);setTimeout(updateNow,500)},'clearSavedSite')}function saveWifi(){jsonAction('/setwifi?ssid='+enc(id('wifi_ssid').value)+'&pass='+enc(id('wifi_pass').value),'wifiMsg',function(){clearFieldsDirty(['wifi_ssid','wifi_pass']);setTimeout(updateNow,500)},'saveWifi')}function clearWifi(){jsonAction('/clearwifi','wifiMsg',function(){clearFieldsDirty(['wifi_ssid','wifi_pass']);setTimeout(updateNow,500)},'clearWifi')}function saveAp(){jsonAction('/setap?ap_ssid='+enc(id('ap_ssid').value)+'&ap_pass='+enc(id('ap_pass').value)+'&ap_ip='+enc(id('ap_ip').value)+'&lx200_port='+enc(id('lx200_port').value)+'&stellarium_port='+enc(id('stellarium_port').value),'apMsg',function(){clearFieldsDirty(['ap_ssid','ap_pass','ap_ip','lx200_port','stellarium_port']);setTimeout(updateNow,500)},'saveAp')}function saveConnCfg(){jsonAction('/setap?ap_ssid='+enc(id('ap_ssid').value)+'&ap_pass='+enc(id('ap_pass').value)+'&ap_ip='+enc(id('ap_ip').value)+'&lx200_port='+enc(id('lx200_port').value)+'&stellarium_port='+enc(id('stellarium_port').value)+'&telnet_port='+enc(id('telnet_port').value)+'&telnet_pass='+enc(id('telnet_pass').value)+'&return='+enc(location.href),'connCfgMsg',function(){clearFieldsDirty(['lx200_port','stellarium_port','telnet_port','telnet_pass']);setTimeout(updateNow,500)},'saveConnCfg')}function defaultConnCfg(){jsonAction('/setup_action?name=Connection%20Defaults','connCfgMsg',null,'defaultConnCfg');setVal('web_port',80);setVal('alpaca_port',11111);setVal('alpaca_discovery_port',32227);setVal('lx200_port',4030);setVal('stellarium_port',10001);setVal('telnet_port',23);setVal('telnet_pass','nexstar');setMsg('connCfgMsg','Default server port values loaded. Click Save Server Config to apply.','ok')}function saveNtp(){let en=id('ntp_enable').checked?1:0;jsonAction('/setntp?enabled='+en+'&server1='+enc(id('ntp1').value)+'&server2='+enc(id('ntp2').value)+'&tz='+enc(id('tzrule').value),'ntpMsg',function(){clearFieldsDirty(['ntp_enable','ntp1','ntp2','tzrule']);setTimeout(updateNow,300)},'saveNtp')}function syncNtp(){jsonAction('/syncntp','ntpMsg',null,'syncNtp')}function fetchIpLoc(){jsonAction('/fetch_ip_location','ipLocMsg',function(){setTimeout(updateNow,500)},'fetchIpLoc')}function useIpLoc(){jsonAction('/use_ip_location','ipLocMsg',function(){setTimeout(updateNow,500)},'useIpLoc')}"));
