gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  server.sendContent(F("const catDSO=[{id:'M1',n:'Crab Nebula',ra:5.57556,dec:22.0145},{id:'M2',n:'Globular Cluster Aquarius',ra:21.5575,dec:-0.8233},{id:'M3',n:'Globular Cluster Canes Venatici',ra:13.7032,dec:28.3773},{id:'M5',n:'Globular Cluster Serpens',ra:15.3092,dec:2.2810},{id:'M8',n:'Lagoon Nebula',ra:18.0602,dec:-24.3867},{id:'M11',n:'Wild Duck Cluster',ra:18.8512,dec:-6.2700},{id:'M13',n:'Hercules Globular Cluster',ra:16.6949,dec:36.4613},{id:'M15',n:'Pegasus Globular Cluster',ra:21.5006,dec:12.2870},{id:'M16',n:'Eagle Nebula',ra:18.3122,dec:-13.8067},{id:'M17',n:'Omega/Swan Nebula',ra:18.3464,dec:-16.1767},{id:'M20',n:'Trifid Nebula',ra:18.0383,dec:-23.0300},{id:'M22',n:'Sagittarius Cluster',ra:18.6067,dec:-23.9047},{id:'M27',n:'Dumbbell Nebula',ra:19.9934,dec:22.7210},{id:'M31',n:'Andromeda Galaxy',ra:0.7123,dec:41.2692},{id:'M32',n:'Andromeda Companion',ra:0.7116,dec:40.8653},{id:'M33',n:'Triangulum Galaxy',ra:1.5641,dec:30.6602},{id:'M35',n:'Gemini Open Cluster',ra:6.1514,dec:24.3333},{id:'M36',n:'Auriga Open Cluster',ra:5.6025,dec:34.1408},{id:'M37',n:'Auriga Open Cluster',ra:5.8717,dec:32.5533},{id:'M38',n:'Auriga Open Cluster',ra:5.4786,dec:35.8550},{id:'M41',n:'Canis Major Open Cluster',ra:6.7667,dec:-20.7567},{id:'M42',n:'Orion Nebula',ra:5.5881,dec:-5.3911},{id:'M43',n:'De Mairan Nebula',ra:5.5933,dec:-5.2778},{id:'M44',n:'Beehive Cluster',ra:8.6665,dec:19.6667},{id:'M45',n:'Pleiades',ra:3.7900,dec:24.1167},{id:'M46',n:'Puppis Open Cluster',ra:7.6962,dec:-14.8100},{id:'M47',n:'Puppis Open Cluster',ra:7.6097,dec:-14.5000},{id:'M51',n:'Whirlpool Galaxy',ra:13.4979,dec:47.1952},{id:'M53',n:'Coma Globular Cluster',ra:13.2154,dec:18.1682},{id:'M57',n:'Ring Nebula',ra:18.8931,dec:33.0292},{id:'M64',n:'Black Eye Galaxy',ra:12.9455,dec:21.6827},{id:'M65',n:'Leo Triplet Galaxy',ra:11.3155,dec:13.0922},{id:'M66',n:'Leo Triplet Galaxy',ra:11.3375,dec:12.9915},{id:'M67',n:'Cancer Open Cluster',ra:8.8500,dec:11.8167},{id:'M78',n:'Orion Reflection Nebula',ra:5.7794,dec:0.0792},{id:'M81',n:'Bode Galaxy',ra:9.9259,dec:69.0653},{id:'M82',n:'Cigar Galaxy',ra:9.9312,dec:69.6797},{id:'M92',n:'Hercules Globular Cluster',ra:17.2854,dec:43.1365},{id:'M97',n:'Owl Nebula',ra:11.2466,dec:55.0190},{id:'M101',n:'Pinwheel Galaxy',ra:14.0535,dec:54.3489},{id:'M104',n:'Sombrero Galaxy',ra:12.6665,dec:-11.6231},{id:'M106',n:'Canes Venatici Galaxy',ra:12.3160,dec:47.3037},{id:'M108',n:'Surfboard Galaxy',ra:11.1919,dec:55.6741},{id:'M109',n:'Barred Spiral Galaxy',ra:11.9598,dec:53.3745},{id:'NGC457',n:'Owl/ET Cluster',ra:1.3208,dec:58.2900},{id:'NGC869',n:'Double Cluster h Persei',ra:2.3167,dec:57.1333},{id:'NGC884',n:'Double Cluster chi Persei',ra:2.3667,dec:57.1500},{id:'NGC7000',n:'North America Nebula',ra:20.9800,dec:44.3333},{id:'NGC6960',n:'Veil Nebula West',ra:20.7600,dec:30.7200},{id:'NGC6992',n:'Veil Nebula East',ra:20.9400,dec:31.7200},{id:'M4',n:'Cat Eye Globular Cluster',ra:16.3931,dec:-26.5258},{id:'M6',n:'Butterfly Cluster',ra:17.6725,dec:-32.2533},{id:'M7',n:'Ptolemy Cluster',ra:17.8975,dec:-34.7928},{id:'M10',n:'Globular Cluster Ophiuchus',ra:16.9525,dec:-4.1003},{id:'M12',n:'Globular Cluster Ophiuchus',ra:16.7873,dec:-1.9485},{id:'M34',n:'Perseus Open Cluster',ra:2.7000,dec:42.7833},{id:'M50',n:'Heart-Shaped Cluster',ra:7.0533,dec:-8.3378},{id:'M52',n:'Cassiopeia Open Cluster',ra:23.4058,dec:61.5933},{id:'M63',n:'Sunflower Galaxy',ra:13.2637,dec:42.0294},{id:'M76',n:'Little Dumbbell Nebula',ra:1.7050,dec:51.5756},{id:'M94',n:'Croc Eye Galaxy',ra:12.8481,dec:41.1203},{id:'M110',n:'Andromeda Companion',ra:0.6728,dec:41.6853},{id:'NGC2237',n:'Rosette Nebula',ra:6.5333,dec:5.0500},{id:'NGC2264',n:'Christmas Tree Cluster/Cone Nebula',ra:6.6833,dec:9.8833},{id:'NGC2392',n:'Eskimo Nebula',ra:7.4852,dec:20.9118},{id:'NGC3242',n:'Ghost of Jupiter',ra:10.4127,dec:-18.6411},{id:'NGC4565',n:'Needle Galaxy',ra:12.6060,dec:25.9877},{id:'NGC4631',n:'Whale Galaxy',ra:12.7042,dec:32.5415},{id:'NGC5907',n:'Splinter Galaxy',ra:15.2745,dec:56.3289},{id:'NGC6826',n:'Blinking Planetary',ra:19.7485,dec:50.5259},{id:'NGC6888',n:'Crescent Nebula',ra:20.2010,dec:38.3550},{id:'IC434',n:'Horsehead Nebula',ra:5.6833,dec:-2.4667},{id:'IC1805',n:'Heart Nebula',ra:2.5500,dec:61.4500},{id:'IC1848',n:'Soul Nebula',ra:2.8500,dec:60.4333}];const catStars=[{id:'Polaris',n:'Polaris',ra:2.5303,dec:89.2641},{id:'Sirius',n:'Sirius',ra:6.7525,dec:-16.7161},{id:'Canopus',n:'Canopus',ra:6.3992,dec:-52.6957},{id:'Arcturus',n:'Arcturus',ra:14.2610,dec:19.1825},{id:'Vega',n:'Vega',ra:18.6156,dec:38.7837},{id:'Capella',n:'Capella',ra:5.2782,dec:45.9980},{id:'Rigel',n:'Rigel',ra:5.2423,dec:-8.2016},{id:'Procyon',n:'Procyon',ra:7.6550,dec:5.2250},{id:'Betelgeuse',n:'Betelgeuse',ra:5.9195,dec:7.4071},{id:'Altair',n:'Altair',ra:19.8464,dec:8.8683},{id:'Aldebaran',n:'Aldebaran',ra:4.5987,dec:16.5093},{id:'Spica',n:'Spica',ra:13.4199,dec:-11.1614},{id:'Antares',n:'Antares',ra:16.4901,dec:-26.4320},{id:'Pollux',n:'Pollux',ra:7.7553,dec:28.0262},{id:'Fomalhaut',n:'Fomalhaut',ra:22.9608,dec:-29.6222},{id:'Deneb',n:'Deneb',ra:20.6905,dec:45.2803},{id:'Regulus',n:'Regulus',ra:10.1395,dec:11.9672},{id:'Castor',n:'Castor',ra:7.5767,dec:31.8883},{id:'Bellatrix',n:'Bellatrix',ra:5.4189,dec:6.3497},{id:'Elnath',n:'Elnath',ra:5.4382,dec:28.6075},{id:'Alnitak',n:'Alnitak',ra:5.6793,dec:-1.9426},{id:'Alnilam',n:'Alnilam',ra:5.6036,dec:-1.2019},{id:'Mintaka',n:'Mintaka',ra:5.5334,dec:-0.2991},{id:'Dubhe',n:'Dubhe',ra:11.0621,dec:61.7510},{id:'Mizar',n:'Mizar',ra:13.3988,dec:54.9254},{id:'Achernar',n:'Achernar',ra:1.6286,dec:-57.2368},{id:'Hadar',n:'Beta Centauri',ra:14.0637,dec:-60.3730},{id:'Acrux',n:'Alpha Crucis',ra:12.4433,dec:-63.0991},{id:'Gacrux',n:'Gamma Crucis',ra:12.5194,dec:-57.1132},{id:'Menkent',n:'Theta Centauri',ra:14.1114,dec:-36.3700},{id:'Rasalhague',n:'Alpha Ophiuchi',ra:17.5822,dec:12.5600},{id:'Kochab',n:'Beta Ursae Minoris',ra:14.8451,dec:74.1555},{id:'Alkaid',n:'Eta Ursae Majoris',ra:13.7923,dec:49.3133},{id:'Alioth',n:'Epsilon Ursae Majoris',ra:12.9005,dec:55.9598},{id:'Alcor',n:'Alcor',ra:13.4204,dec:54.9879},{id:'Alphecca',n:'Alpha Coronae Borealis',ra:15.5781,dec:26.7147},{id:'Rasalgethi',n:'Alpha Herculis',ra:17.2441,dec:14.3903},{id:'Enif',n:'Epsilon Pegasi',ra:21.7364,dec:9.8750},{id:'Scheat',n:'Beta Pegasi',ra:23.0629,dec:28.0828},{id:'Markab',n:'Alpha Pegasi',ra:23.0793,dec:15.2053},{id:'Mirach',n:'Beta Andromedae',ra:1.1622,dec:35.6206},{id:'Almach',n:'Gamma Andromedae',ra:2.0649,dec:42.3297},{id:'Hamal',n:'Alpha Arietis',ra:2.1195,dec:23.4624},{id:'Mirfak',n:'Alpha Persei',ra:3.4054,dec:49.8612},{id:'Algol',n:'Beta Persei',ra:3.1361,dec:40.9556}];const catSolar=['Sun','Moon','Mercury','Venus','Mars','Jupiter','Saturn','Uranus','Neptune'];const catExtraCompact=`NGC869|Double Cluster h Persei|23300|571330|open^NGC884|Double Cluster chi Persei|23667|571500|open^NGC457|Owl Cluster|13167|582830|open^NGC663|Cassiopeia Open Cluster|17667|612170|open^NGC752|Andromeda Open Cluster|19583|377830|open^NGC7789|Caroline Rose Cluster|239583|567170|open^NGC7000|North America Nebula|209667|443330|nebula^IC5070|Pelican Nebula|208333|443670|nebula^NGC6960|Western Veil Nebula|207667|307000|nebula^NGC6992|Eastern Veil Nebula|209333|317170|nebula^NGC7635|Bubble Nebula|233333|612000|nebula^NGC281|Pacman Nebula|8833|566330|nebula^NGC1499|California Nebula|40000|366330|nebula^NGC2024|Flame Nebula|57000|-18500|nebula^NGC1977|Running Man Nebula|55917|-48500|nebula^NGC2174|Monkey Head Nebula|61500|206500|nebula^NGC2359|Thor's Helmet|73167|-132170|nebula^NGC3372|Carina Nebula|107500|-598670|nebula^NGC3603|Southern Nebula Cluster|112500|-612670|nebula^NGC6188|Fighting Dragons Nebula|166667|-487670|nebula^NGC6334|Cat's Paw Nebula|173333|-361170|nebula^NGC6357|Lobster Nebula|174000|-342000|nebula^M6|Butterfly Cluster|176683|-322170|open^M7|Ptolemy Cluster|178975|-348170|open^M10|Globular Cluster Ophiuchus|169517|-41000|globular^M12|Globular Cluster Ophiuchus|167875|-19500|globular^M14|Globular Cluster Ophiuchus|176267|-32450|globular^M19|Globular Cluster Ophiuchus|170438|-262670|globular^M21|Sagittarius Open Cluster|180700|-225000|open^M23|Sagittarius Open Cluster|179500|-190170|open^M24|Sagittarius Star Cloud|182667|-184830|open^M25|Sagittarius Open Cluster|185300|-191170|open^M26|Scutum Open Cluster|187517|-93830|open^M28|Globular Cluster Sagittarius|184100|-248670|globular^M29|Cygnus Open Cluster|203983|385330|open^M30|Globular Cluster Capricornus|216728|-231800|globular^M34|Perseus Open Cluster|27000|427830|open^M39|Cygnus Open Cluster|215333|484330|open^M40|Winnecke 4 Double Star|123700|580830|star^M48|Hydra Open Cluster|82283|-57500|open^M50|Monoceros Open Cluster|70500|-83330|open^M52|Cassiopeia Open Cluster|234000|616000|open^M54|Globular Cluster Sagittarius|189175|-304830|globular^M55|Globular Cluster Sagittarius|196667|-309670|globular^M56|Globular Cluster Lyra|192767|301830|globular^M69|Globular Cluster Sagittarius|185231|-323480|globular^M70|Globular Cluster Sagittarius|187202|-322930|globular^M71|Sagitta Globular Cluster|198960|187790|globular^M72|Globular Cluster Aquarius|208910|-125370|globular^M73|Aquarius Asterism|209833|-126330|open^M75|Globular Cluster Sagittarius|201013|-219220|globular^M79|Globular Cluster Lepus|54029|-245240|globular^M80|Globular Cluster Scorpius|162830|-229760|globular^M107|Globular Cluster Ophiuchus|165422|-130540|globular^M108|Surfboard Galaxy|111919|556740|galaxy^M109|Barred Spiral Galaxy|119599|533750|galaxy^NGC253|Sculptor Galaxy|7925|-252880|galaxy^NGC288|Sculptor Globular Cluster|8783|-265830|globular^NGC891|Edge-on Galaxy Andromeda|23758|423500|galaxy^NGC1023|Perseus Lenticular Galaxy|26767|390630|galaxy^NGC1232|Eridanus Spiral Galaxy|31620|-205790|galaxy^NGC1300|Barred Spiral Galaxy|33319|-194110|galaxy^NGC1316|Fornax A Galaxy|33783|-372080|galaxy^NGC1365|Great Barred Spiral Galaxy|35600|-361400|galaxy^NGC2403|Camelopardalis Galaxy|76150|656020|galaxy^NGC2683|UFO Galaxy|88775|334210|galaxy^NGC2903|Leo Galaxy|95333|215000|galaxy^NGC3115|Spindle Galaxy|100872|-77180|galaxy^NGC3521|Bubble Galaxy|110950|-350|galaxy^NGC3628|Hamburger Galaxy|113380|135890|galaxy^NGC4038|Antennae Galaxies|120314|-188670|galaxy^NGC4244|Silver Needle Galaxy|122939|378070|galaxy^NGC4449|Canes Venatici Galaxy|124698|440940|galaxy^NGC4725|One-armed Spiral Galaxy|128400|255010|galaxy^NGC5128|Centaurus A|134240|-430190|galaxy^NGC5139|Omega Centauri|134467|-474790|globular^NGC5195|M51 Companion|134990|472660|galaxy^NGC5236|Southern Pinwheel M83|136167|-298660|galaxy^NGC5986|Lupus Globular Cluster|157700|-377860|globular^NGC6144|Scorpius Globular Cluster|164500|-260230|globular^NGC6231|Northern Jewel Box|169000|-418000|open^NGC6543|Cat's Eye Nebula|179710|666330|planetary_nebula^NGC6572|Blue Racquetball Nebula|182010|68530|planetary_nebula^NGC6720|Ring Nebula M57|188931|330290|planetary_nebula^NGC6752|Pavo Globular Cluster|191767|-599840|globular^NGC7662|Blue Snowball Nebula|234310|425350|planetary_nebula^IC342|Hidden Galaxy|37800|680960|galaxy^IC1396|Elephant Trunk Nebula|216500|575000|nebula^IC5146|Cocoon Nebula|218917|472670|nebula^B33|Horsehead Dark Nebula|56833|-24670|nebula^Barnard33|Horsehead Nebula|56833|-24670|nebula^Caldwell14|Double Cluster|23500|571330|open^Caldwell20|North America Nebula|209667|443330|nebula^Caldwell33|Eastern Veil Nebula|209333|317170|nebula^Caldwell34|Western Veil Nebula|207667|307000|nebula^Caldwell49|Rosette Nebula|65333|50500|nebula^Caldwell63|Helix Nebula|224939|-208370|planetary_nebula^Caldwell76|Centaurus A|134240|-430190|galaxy^Caldwell80|Omega Centauri|134467|-474790|globular^Caldwell92|Carina Nebula|107500|-598670|nebula^Caldwell93|Jewel Box Cluster|128833|-603670|open`;function catDecodeExtra(s){return s.split('^').filter(Boolean).map(r=>{let p=r.split('|');return{id:p[0],n:p[1],ra:Number(p[2])/10000,dec:Number(p[3])/10000,k:p[4]||'other'}})}const catExtra=catDecodeExtra(catExtraCompact);/* BSC5_GENERATED_BEGIN */const catBSC=[];let catBSCLoaded=false,catBSCLoading=false;function catBscCount(){return catBSC.length}function catDecodeBscText(s){return s.split('^').filter(Boolean).map(r=>{let p=r.split('|');let hr=p[0],m=Number(p[4])/100;return{id:'HR'+hr,n:(p[1]||('HR'+hr))+' mag '+m.toFixed(2),ra:Number(p[2])/10000,dec:Number(p[3])/10000,mag:m,k:'star'}})}async function loadBSC5(){if(catBSCLoaded)return true;if(catBSCLoading)return false;catBSCLoading=true;setText('bscCount','loading...');try{let t=await getText('/bsc5_data');let a=catDecodeBscText(t);catBSC.splice(0,catBSC.length,...a);catBSCLoaded=true;setText('bscCount',String(catBSC.length));return true}catch(e){setText('bscCount','load failed');return false}finally{catBSCLoading=false}}/* BSC5_GENERATED_END */function catBscCount(){return typeof catBSC!=='undefined'?catBSC.length:0}function degNorm(x){x=x%360;if(x<0)x+=360;return x}function rad(d){return d*Math.PI/180}function deg(r){return r*180/Math.PI}function jdNow(){let d=new Date();return d.getTime()/86400000+2440587.5}function sunRaDec(){let jd=jdNow(),n=jd-2451545.0,L=degNorm(280.460+0.9856474*n),g=degNorm(357.528+0.9856003*n),lam=degNorm(L+1.915*Math.sin(rad(g))+0.020*Math.sin(rad(2*g))),eps=23.439-0.0000004*n;let ra=deg(Math.atan2(Math.cos(rad(eps))*Math.sin(rad(lam)),Math.cos(rad(lam))))/15;if(ra<0)ra+=24;let dec=deg(Math.asin(Math.sin(rad(eps))*Math.sin(rad(lam))));return{ra:ra,dec:dec,n:'Sun',id:'Sun',approx:true}}function moonRaDec(){let jd=jdNow(),d=jd-2451543.5,N=degNorm(125.1228-0.0529538083*d),i=5.1454,w=degNorm(318.0634+0.1643573223*d),a=60.2666,e=0.054900,M=degNorm(115.3654+13.0649929509*d);let E=rad(M)+e*Math.sin(rad(M))*(1+e*Math.cos(rad(M)));let xv=a*(Math.cos(E)-e),yv=a*(Math.sqrt(1-e*e)*Math.sin(E));let v=deg(Math.atan2(yv,xv)),r=Math.sqrt(xv*xv+yv*yv);let xh=r*(Math.cos(rad(N))*Math.cos(rad(v+w))-Math.sin(rad(N))*Math.sin(rad(v+w))*Math.cos(rad(i)));let yh=r*(Math.sin(rad(N))*Math.cos(rad(v+w))+Math.cos(rad(N))*Math.sin(rad(v+w))*Math.cos(rad(i)));let zh=r*(Math.sin(rad(v+w))*Math.sin(rad(i)));let lon=degNorm(deg(Math.atan2(yh,xh))),lat=deg(Math.atan2(zh,Math.sqrt(xh*xh+yh*yh)));let n=jd-2451545.0,eps=23.439-0.0000004*n;let xe=Math.cos(rad(lon))*Math.cos(rad(lat));let ye=Math.sin(rad(lon))*Math.cos(rad(lat))*Math.cos(rad(eps))-Math.sin(rad(lat))*Math.sin(rad(eps));let ze=Math.sin(rad(lon))*Math.cos(rad(lat))*Math.sin(rad(eps))+Math.sin(rad(lat))*Math.cos(rad(eps));let ra=deg(Math.atan2(ye,xe))/15;if(ra<0)ra+=24;let dec=deg(Math.atan2(ze,Math.sqrt(xe*xe+ye*ye)));return{ra:ra,dec:dec,n:'Moon',id:'Moon',approx:true}}function simpleSolar(name){if(name==='Sun')return sunRaDec();if(name==='Moon')return moonRaDec();let base={Mercury:[4.092,252.3,7],Venus:[1.602,181.9,3.4],Mars:[0.524,355.4,1.85],Jupiter:[0.0831,34.4,1.3],Saturn:[0.0335,50.1,2.5],Uranus:[0.0117,314.0,0.8],Neptune:[0.006,304.0,1.8]};let b=base[name];if(!b)return null;let jd=jdNow(),n=jd-2451545.0,lon=degNorm(b[1]+b[0]*n),eps=23.439-0.0000004*n;let ra=deg(Math.atan2(Math.cos(rad(eps))*Math.sin(rad(lon)),Math.cos(rad(lon))))/15;if(ra<0)ra+=24;let dec=deg(Math.asin(Math.sin(rad(eps))*Math.sin(rad(lon))));return{ra:ra,dec:dec,n:name,id:name,approx:true}}function catKind(o){if(o&&o.k)return o.k;let n=((o.n||'')+' '+(o.id||'')).toLowerCase();if(n.includes('globular'))return'globular';if(n.includes('open cluster')||n.includes('cluster'))return'open';if(n.includes('planetary')||n.includes('dumbbell')||n.includes('ring nebula')||n.includes('eskimo')||n.includes('ghost of jupiter')||n.includes('blinking'))return'planetary_nebula';if(n.includes('galaxy')||n.includes('andromeda')||n.includes('whirlpool')||n.includes('sombrero')||n.includes('pinwheel')||n.includes('needle')||n.includes('whale'))return'galaxy';if(n.includes('nebula')||n.includes('horsehead')||n.includes('rosette')||n.includes('heart')||n.includes('soul')||n.includes('veil'))return'nebula';return'other'}function catAllRows(){let a=[];catSolar.forEach(x=>a.push({id:x,n:x,src:'solar'}));catDSO.forEach(x=>a.push(Object.assign({src:'dso'},x)));catExtra.forEach(x=>a.push(Object.assign({src:'extra'},x)));catStars.forEach(x=>a.push(Object.assign({src:'star'},x)));catBSC.forEach(x=>a.push(Object.assign({src:'bsc'},x)));return a}function mountRaDecNow(){if(!lastStatus||!lastStatus.cacheValid)return null;let raH=Number(lastStatus.raHours),dec=Number(lastStatus.decDeg);if(!isFinite(raH)||!isFinite(dec))return null;return{raH:((raH%24)+24)%24,dec:dec}}function catAngularDistanceDeg(x){let m=mountRaDecNow();if(!m||!x||!isFinite(x.ra)||!isFinite(x.dec))return 9999;let ra1=m.raH*Math.PI/12,ra2=Number(x.ra)*Math.PI/12,d1=m.dec*Math.PI/180,d2=Number(x.dec)*Math.PI/180;let c=Math.sin(d1)*Math.sin(d2)+Math.cos(d1)*Math.cos(d2)*Math.cos(ra1-ra2);return Math.acos(Math.max(-1,Math.min(1,c)))*180/Math.PI}function catIdentifyPool(){let a=catSolar.map(x=>simpleSolar(x)).filter(x=>x&&isFinite(x.ra)&&isFinite(x.dec)).map(x=>Object.assign({src:'solar'},x)).concat(catDSO.map(x=>Object.assign({src:'dso'},x))).concat(catExtra.map(x=>Object.assign({src:'extra'},x))).concat(catStars.map(x=>Object.assign({src:'star'},x)));if(catBSCLoaded)a=a.concat(catBSC.map(x=>Object.assign({src:'bsc'},x)));return a}let lastPointingIdKey='';function autoUpdatePointingId(){if(!lastStatus||!lastStatus.cacheValid)return;let k=Number(lastStatus.raHours).toFixed(4)+','+Number(lastStatus.decDeg).toFixed(3);if(k===lastPointingIdKey)return;lastPointingIdKey=k;if(typeof identifyPointingNow==='function')identifyPointingNow()}function sameCatalogObject(a,b){if(!a||!b)return false;return (a.src||'dso')===(b.src||'dso')&&a.id===b.id}function catalogShortLabel(x){return x?x.id+(x.n&&x.n!==x.id?' - '+x.n:''):'?'}function identifyPointingNow(){let m=mountRaDecNow(),e=id('nearestInfo'),box=id('pointingIdBox'),s=id('nearestSelect');if(s)s.innerHTML='';let nc=id('nearCount');if(nc)nc.textContent='0';if(!m){if(box)box.value='waiting for valid mount RA/Dec cache';if(e)e.innerHTML='Pointing ID: waiting for valid mount RA/Dec cache';return}if(!catBSCLoaded&&!catBSCLoading){loadBSC5().then(()=>{lastPointingIdKey='';identifyPointingNow();catPopulate()})}let a=catIdentifyPool().map(x=>Object.assign({},x,{dist:catAngularDistanceDeg(x)})).filter(x=>isFinite(x.dist)&&x.dist<9999).sort((x,y)=>x.dist-y.dist);let best=a[0];if(!best){if(box)box.value='no catalog match yet';if(e)e.innerHTML='Pointing ID: no catalog match yet';return}if(box)box.value=catOptionText(best);let nr=id('nearRadius'),rad=nr?Number(nr.value):10;if(!isFinite(rad)||rad<=0)rad=10;let near=a.filter(x=>!sameCatalogObject(x,best)&&isFinite(x.dist)&&x.dist<=rad);if(s){let nc=id('nearCount');if(nc)nc.textContent=String(near.length);let ph=document.createElement('option');ph.value='';ph.textContent=near.length?'Select a nearby object':'No nearby objects inside radius';ph.selected=true;s.appendChild(ph);near.forEach((x,i)=>{let op=document.createElement('option');op.value=(x.src||'dso')+':'+x.id;op.textContent=(i===0?'BEST: ':'')+catNearestOptionText(x);s.appendChild(op)})}if(e)e.innerHTML='<b>Pointing ID:</b> '+catalogShortLabel(best)+'<br><b>Mount RA/Dec used:</b> '+m.raH.toFixed(6)+' h / '+m.dec.toFixed(6)+' deg<br><b>Distance:</b> '+best.dist.toFixed(2)+' deg'}function catSortAndLimit(a){let sm=id('cat_sort'),sort=sm?sm.value:'brightness';if(sort==='name')a.sort((x,y)=>(x.n||x.id||'').localeCompare(y.n||y.id||''));else if(sort==='visibility')a.sort((x,y)=>{let ax=catAltAzFromRaDec(x.ra,x.dec),ay=catAltAzFromRaDec(y.ra,y.dec);let va=((ax&&isFinite(ax.alt))?ax.alt:-999),vb=((ay&&isFinite(ay.alt))?ay.alt:-999);return vb-va});else a.sort((x,y)=>(isFinite(x.mag)?x.mag:99)-(isFinite(y.mag)?y.mag:99));window.catTotalBeforeLimit=a.length;return a}function catBaseArrayForGroup(v){let a=[];if(v==='solar')a=catSolar.map(x=>({id:x,n:x,src:'solar'}));else if(v==='stars')a=catStars.map(x=>Object.assign({src:'star'},x));else if(v==='bsc'){if(!catBSCLoaded&&!catBSCLoading)loadBSC5().then(()=>{identifyPointingNow();catPopulate()});a=catBSC.map(x=>Object.assign({src:'bsc'},x));}else{a=catDSO.map(x=>Object.assign({src:'dso'},x)).concat(catExtra.map(x=>Object.assign({src:'extra'},x)));if(v==='galaxy'||v==='nebula'||v==='planetary_nebula'||v==='globular'||v==='open')a=a.filter(x=>catKind(x)===v);}return a}function catArray(){let g=id('cat_group'),v=g?g.value:'messier',q=(id('cat_search')?id('cat_search').value:'').toLowerCase();let a=[];if(q){a=catAllRows().filter(x=>(x.id+' '+(x.n||'')).toLowerCase().includes(q));}else a=catBaseArrayForGroup(v);return catSortAndLimit(a)}window.catVisibleOnly=false;function catVisibleNow(c){let aa=catAltAzFromRaDec(c.ra,c.dec);if(!aa||aa.alt<0)return false;if(!lastStatus||!lastStatus.siteValid||!lastStatus.timeValid)return false;let lat=Number(lastStatus.latitude)*Math.PI/180,dec=Number(c.dec)*Math.PI/180,cLat=Math.cos(lat),cDec=Math.cos(dec);if(!isFinite(lat)||!isFinite(dec)||Math.abs(cLat)<1e-6||Math.abs(cDec)<1e-6)return false;let cosH=(0-Math.sin(lat)*Math.sin(dec))/(cLat*cDec);if(cosH<-1)return true;if(cosH>1)return false;let H=Math.acos(Math.max(-1,Math.min(1,cosH)))*12/Math.PI,lst=lstHours();if(!isFinite(lst))return false;let hoursUntilSet=(((Number(c.ra)+H-lst)%24)+24)%24/1.00273790935;return hoursUntilSet>0.02}function catToggleVisible(){}function localTzAbbr(){if(!lastStatus)return'';let off=Number(lastStatus.utcOffsetMinutes);if(!isFinite(off))return'';if(off===-420)return'MST';if(off===-360)return'MDT';let sg=off>=0?'+':'-',a=Math.abs(off),h=Math.floor(a/60),m=a%60;return'UTC'+sg+String(h).padStart(2,'0')+':'+String(m).padStart(2,'0')}function eventBaseMs(dayOff){if(!lastStatus)return NaN;let off=Number(lastStatus.utcOffsetMinutes)||0;return Date.UTC(Number(lastStatus.localYear),Number(lastStatus.localMonth)-1,Number(lastStatus.localDay)+dayOff)-off*60000}function eventFmt(ms,base){let off=Number(lastStatus.utcOffsetMinutes)||0,d=new Date(ms+off*60000),b=new Date(base+off*60000),h=d.getUTCHours(),m=d.getUTCMinutes(),ap=h>=12?'PM':'AM',hh=h%12;if(!hh)hh=12;let suf=d.getUTCDate()!==b.getUTCDate()?' +1':'';return hh+':'+String(m).padStart(2,'0')+' '+ap+suf}function sunMoonEvents(kind){if(!lastStatus||!lastStatus.siteValid||!lastStatus.timeValid)return null;let lat=Number(lastStatus.latitude),lon=Number(lastStatus.longitude);if(!isFinite(lat)||!isFinite(lon))return null;let r=Math.PI/180,dayMs=864e5,J1970=2440588,J2000=2451545,toJ=t=>t/dayMs-0.5+J1970,fromJ=j=>(j+0.5-J1970)*dayMs,toD=t=>toJ(t)-J2000,lw=-lon*r,phi=lat*r,ob=23.4397*r;function ra(l,b){return Math.atan2(Math.sin(l)*Math.cos(ob)-Math.tan(b)*Math.sin(ob),Math.cos(l))}function dec(l,b){return Math.asin(Math.sin(b)*Math.cos(ob)+Math.cos(b)*Math.sin(ob)*Math.sin(l))}function sid(d){return r*(280.16+360.9856235*d)-lw}function alt(H,d){return Math.asin(Math.sin(phi)*Math.sin(d)+Math.cos(phi)*Math.cos(d)*Math.cos(H))}function refr(h){if(h<0)h=0;return 0.0002967/Math.tan(h+0.00312536/(h+0.08901179))}function sunC(d){let M=r*(357.5291+0.98560028*d),C=r*(1.9148*Math.sin(M)+0.02*Math.sin(2*M)+0.0003*Math.sin(3*M)),P=r*102.9372,L=M+C+P+Math.PI;return{M:M,L:L,dec:dec(L,0),ra:ra(L,0)}}function moonC(d){let L=r*(218.316+13.176396*d),M=r*(134.963+13.064993*d),F=r*(93.272+13.22935*d),l=L+r*6.289*Math.sin(M),b=r*5.128*Math.sin(F);return{ra:ra(l,b),dec:dec(l,b)}}function moonAlt(t){let d=toD(t),c=moonC(d),h=alt(sid(d)-c.ra,c.dec);return h+refr(h)}function solar(base){let d=toD(base),n=Math.round(d-0.0009-lw/(2*Math.PI)),ds=0.0009+lw/(2*Math.PI)+n,c=sunC(ds),Jnoon=J2000+ds+0.0053*Math.sin(c.M)-0.0069*Math.sin(2*c.L),w=Math.acos((Math.sin(-0.833*r)-Math.sin(phi)*Math.sin(c.dec))/(Math.cos(phi)*Math.cos(c.dec))),a=w/(2*Math.PI),Jset=J2000+ds+a+0.0053*Math.sin(c.M)-0.0069*Math.sin(2*c.L),Jrise=Jnoon-(Jset-Jnoon);return{rise:fromJ(Jrise),set:fromJ(Jset)}}function moonDay(base){let hc=0.133*r,h0=moonAlt(base)-hc,rise=null,set=null;for(let i=1;i<=24;i+=2){let h1=moonAlt(base+i*3600e3)-hc,h2=moonAlt(base+(i+1)*3600e3)-hc,a=(h0+h2)/2-h1,b=(h2-h0)/2,xe=-b/(2*a),ye=(a*xe+b)*xe+h1,D=b*b-4*a*h1,n=0,x1=0,x2=0;if(D>=0){let dx=Math.sqrt(D)/(Math.abs(a)*2);x1=xe-dx;x