gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
2=xe+dx;if(Math.abs(x1)<=1)n++;if(Math.abs(x2)<=1)n++;if(x1<-1)x1=x2}if(n===1){if(h0<0)rise=base+(i+x1)*3600e3;else set=base+(i+x1)*3600e3}else if(n===2){rise=base+(i+(ye<0?x2:x1))*3600e3;set=base+(i+(ye<0?x1:x2))*3600e3}if(rise&&set)break;h0=h2}return{rise:rise,set:set}}let base=eventBaseMs(0);if(kind==='Sun'){let e=solar(base);return{short:'R '+eventFmt(e.rise,base)+' S '+eventFmt(e.set,base),detail:'Rise/Set: sunrise '+eventFmt(e.rise,base)+' / sunset '+eventFmt(e.set,base)}}if(kind==='Moon'){let e=moonDay(base);if(!e.rise)e.rise=moonDay(eventBaseMs(1)).rise;if(!e.set)e.set=moonDay(eventBaseMs(1)).set;return{short:'R '+(e.rise?eventFmt(e.rise,base):'none')+' S '+(e.set?eventFmt(e.set,base):'none'),detail:'Rise/Set: moonrise '+(e.rise?eventFmt(e.rise,base):'none')+' / moonset '+(e.set?eventFmt(e.set,base):'none')}}return null}function catRiseSet(c,decArg){if(!lastStatus||!lastStatus.siteValid||!lastStatus.timeValid)return null;if(c&&typeof c==='object'&&(c.id==='Sun'||c.id==='Moon'))return sunMoonEvents(c.id);let raHours=typeof c==='object'?c.ra:c,decDeg=typeof c==='object'?c.dec:decArg;let tz=localTzAbbr(),z=tz?' '+tz:'',lat=Number(lastStatus.latitude)*Math.PI/180,dec=Number(decDeg)*Math.PI/180,cLat=Math.cos(lat),cDec=Math.cos(dec);if(!isFinite(lat)||!isFinite(dec)||Math.abs(cLat)<1e-6||Math.abs(cDec)<1e-6)return null;let cosH=(0-Math.sin(lat)*Math.sin(dec))/(cLat*cDec);if(cosH>1)return{short:'never rises',detail:'Rise/Set: never rises at current site'};if(cosH<-1)return{short:'circumpolar',detail:'Rise/Set: circumpolar at current site'};let H=Math.acos(Math.max(-1,Math.min(1,cosH)))*12/Math.PI,lst=lstHours();if(!isFinite(lst))return null;function p(n){return String(n).padStart(2,'0')}function at(targetLst){let dh=(((targetLst-lst)%24)+24)%24/1.00273790935,now=Number(lastStatus.localHour)*3600+Number(lastStatus.localMinute)*60+Number(lastStatus.localSecond),sec=Math.round((now+dh*3600)%86400);if(sec<0)sec+=86400;return p(Math.floor(sec/3600))+':'+p(Math.floor((sec%3600)/60))}let rr=at(Number(raHours)-H),ss=at(Number(raHours)+H);return{short:'R '+rr+z+' S '+ss+z,detail:'Rise/Set: next rise '+rr+z+' / next set '+ss+z}}function catAltAzShort(c){let aa=c?catAltAzFromRaDec(c.ra,c.dec):null;if(aa&&isFinite(aa.alt)&&isFinite(aa.az))return'Alt '+Number(aa.alt).toFixed(1)+' Az '+Number(aa.az).toFixed(1);return'Alt ? Az ?'}function catOptionText(x){let c=x.src==='solar'?simpleSolar(x.id):x;let t=x.id+(x.n&&x.n!==x.id?' - '+x.n:'');if(c)t+=' | '+catAltAzShort(c);let rs=c?catRiseSet(c):null;if(rs)t+=' | '+rs.short;return t}function catNearestOptionText(x){let t=catOptionText(x);if(isFinite(x.dist)&&x.dist<9999)t+=' | '+x.dist.toFixed(2)+' deg away';return t}function catRefreshLabels(){let o=id('cat_obj');if(!o)return;let arr=catArray(),m={};arr.forEach(x=>{m[(x.src||'dso')+':'+x.id]=catOptionText(x)});for(let i=0;i<o.options.length;i++){let v=o.options[i].value;if(m[v])o.options[i].textContent=m[v]}}function catPopulate(){setText('bscCount',String(catBscCount()));let o=id('cat_obj');if(!o)return;let arr=catArray();let old=o.value;o.innerHTML='';arr.forEach(x=>{let op=document.createElement('option');let c=x.src==='solar'?simpleSolar(x.id):x,aa=c?catAltAzFromRaDec(c.ra,c.dec):null;op.value=(x.src||'dso')+':'+x.id;op.textContent=catOptionText(x);if(aa&&isFinite(aa.alt)&&aa.alt<0){op.style.color='#777';op.style.backgroundColor='#222'}o.appendChild(op)});setText('catShown',String(arr.length));setText('catTotal',String(window.catTotalBeforeLimit||arr.length));if(old){for(let i=0;i<o.options.length;i++){if(o.options[i].value===old){o.selectedIndex=i;break}}}if(o.selectedIndex<0&&o.options.length>0)o.selectedIndex=0;catUpdate()}function catSelected(){let o=id('cat_obj');if(!o||!o.value)return null;let p=o.value.split(':'),src=p[0],v=p.slice(1).join(':');if(src==='solar')return simpleSolar(v);if(src==='star')return catStars.find(x=>x.id===v);if(src==='bsc')return catBSC.find(x=>x.id===v);if(src==='extra')return catExtra.find(x=>x.id===v);return catDSO.find(x=>x.id===v)}function catSetInfo(s){let e=document.getElementById('cat_info');if(!e)return;e.innerHTML=s}function hms(ra){ra=((Number(ra)%24)+24)%24;let h=Math.floor(ra),m=Math.floor((ra-h)*60),s=(((ra-h)*60-m)*60);return String(h).padStart(2,'0')+':'+String(m).padStart(2,'0')+':'+s.toFixed(1).padStart(4,'0')}function dms(dec){let d0=Number(dec),sg=d0<0?'-':'+';d0=Math.abs(d0);let d=Math.floor(d0),m=Math.floor((d0-d)*60),s=(((d0-d)*60-m)*60);return sg+String(d).padStart(2,'0')+':'+String(m).padStart(2,'0')+':'+s.toFixed(0).padStart(2,'0')}function catAltAzFromRaDec(raHours,decDeg){if(!lastStatus)return null;let lat=Number(lastStatus.latitude),lon=Number(lastStatus.longitude),yr=Number(lastStatus.localYear),mo=Number(lastStatus.localMonth),dy=Number(lastStatus.localDay),hr=Number(lastStatus.localHour),mi=Number(lastStatus.localMinute),se=Number(lastStatus.localSecond);if(!isFinite(lat)||!isFinite(lon)||!isFinite(yr)||!isFinite(mo)||!isFinite(dy)||!isFinite(hr)||!isFinite(mi)||!isFinite(se))return null;function d2r(d){return d*Math.PI/180}function r2d(r){return r*180/Math.PI}let off=Number(lastStatus.utcOffsetMinutes||0),utcMs=Date.UTC(yr,mo-1,dy,hr,mi,se)-off*60000,jd=utcMs/86400000+2440587.5,T=(jd-2451545.0)/36525.0,gmst=280.46061837+360.98564736629*(jd-2451545.0)+0.000387933*T*T-(T*T*T)/38710000.0;gmst=((gmst%360)+360)%360;let lst=((gmst+lon)%360+360)%360,raDeg=((Number(raHours)*15)%360+360)%360,ha=((lst-raDeg)%360+360)%360;if(ha>180)ha-=360;let haR=d2r(ha),decR=d2r(Number(decDeg)),latR=d2r(lat),sinAlt=Math.sin(decR)*Math.sin(latR)+Math.cos(decR)*Math.cos(latR)*Math.cos(haR);sinAlt=Math.max(-1,Math.min(1,sinAlt));let alt=r2d(Math.asin(sinAlt)),cosAz=(Math.sin(decR)-Math.sin(d2r(alt))*Math.sin(latR))/(Math.cos(d2r(alt))*Math.cos(latR));cosAz=Math.max(-1,Math.min(1,cosAz));let az=r2d(Math.acos(cosAz));if(Math.sin(haR)>0)az=360-az;az=((az%360)+360)%360;return{alt:alt,az:az}}function catUpdate(){let c=catSelected();if(!c){catSetInfo('RA ? / Dec ?<br>Sky Alt ? / Az ?<br>Mount Alt ? / Az ?');return}let aa=catAltAzFromRaDec(c.ra,c.dec);let coord='RA '+hms(c.ra)+' h / Dec '+dms(c.dec)+' deg<br>Sky Alt '+(aa?Number(aa.alt).toFixed(2):'?')+' deg / Az '+(aa?Number(aa.az).toFixed(2):'?')+' deg';coord+='<br>Mount Alt '+(lastStatus&&lastStatus.altAzCacheValid?Number(lastStatus.altDeg).toFixed(2):'?')+' deg / Az '+(lastStatus&&lastStatus.altAzCacheValid?Number(lastStatus.azDeg).toFixed(2):'?')+' deg';if(c.approx)coord+=' APPROX ephemeris';catSetInfo(coord)}function groupForCatalogItem(c){let src=c?(c.src||'dso'):'dso';if(src==='bsc')return'bsc';if(src==='star')return'stars';if(src==='solar')return'solar';let k=catKind(c);if(k==='galaxy'||k==='nebula'||k==='planetary_nebula'||k==='globular'||k==='open')return k;return'messier'}function forceObjectPulldownTo(c){if(!c)return false;let o=id('cat_obj');if(!o)return false;let val=(c.src||'dso')+':'+c.id;for(let i=0;i<o.options.length;i++){if(o.options[i].value===val){o.selectedIndex=i;catUpdate();return true}}return false}function selectNearestCandidate(){let s=id('nearestSelect');if(!s||!s.value)return;let p=s.value.split(':'),src=p[0],objId=p.slice(1).join(':'),a=catIdentifyPool();let c=a.find(x=>(x.src||'dso')===src&&x.id===objId);if(!c)return;let g=id('cat_group');if(g){let gv=groupForCatalogItem(c);if(g.value!==gv)g.value=gv}let search=id('cat_search');if(search)search.value='';catPopulate();if(!forceObjectPulldownTo(c)){let search2=id('cat_search');if(search2)search2.value=c.id;catPopulate();forceObjectPulldownTo(c)}}function setRaDecRaw(ra,dec){let r=document.getElementById('ra_hours'),d=document.getElementById('dec_deg');gotoRaDecDirty=false;if(r){r.dataset.dirty='0';r.value=Number(ra).toFixed(6);r.dispatchEvent(new Event('input',{bubbles:true}))}if(d){d.dataset.dirty='0';d.value=Number(dec).toFixed(6);d.dispatchEvent(new Event('input',{bubbles:true}))}setTimeout(()=>{if(r){r.dataset.dirty='0';r.value=Number(ra).toFixed(6)}if(d){d.dataset.dirty='0';d.value=Number(dec).toFixed(6)}},50)}function catLoad(){setMsg('catMsg','Use Slew to Object','ok')}function catSlew(){let c=catSelected();if(!c){setMsg('catMsg','No catalog object selected','bad');return}if(!confirmAboveHorizonRaDec(c.ra,c.dec,'catMsg'))return;jsonAction('/webgoto_radec?ra_hours='+enc(Number(c.ra).toFixed(6))+'&dec_deg='+enc(Number(c.dec).toFixed(6)),'catMsg',function(){setTimeout(updateNow,1200)},'catalogSlew')}"));
  server.sendContent(F("let lastStatus=null,targetsInitialized=false;function targetFieldsLocked(){return false}function lockTargetFields(ms){}function setText(n,v){let e=id(n);if(e)e.textContent=v}function setVal(n,v,fix){let e=id(n);if(!e||v===undefined||v===null||Number.isNaN(v))return;if(e.dataset.dirty==='1'||document.activeElement===e)return;if(fix!==undefined&&typeof v==='number')e.value=v.toFixed(fix);else e.value=v}function setChecked(n,v){let e=id(n);if(!e)return;if(e.dataset.dirty==='1'||document.activeElement===e)return;e.checked=!!v}function markDirty(){this.dataset.dirty='1'}function markRaDecDirty(){gotoRaDecDirty=true;markDirty.call(this)}function markAltAzDirty(){gotoAltAzDirty=true;markDirty.call(this)}function clearFieldsDirty(list){list.forEach(n=>{let e=id(n);if(e)e.dataset.dirty='0'})}function clearSiteDirty(){clearFieldsDirty(['lat','lon','offset','year','month','day','hour','minute','second','poll','idlepoll','throttle'])}function clearRateDirty(){clearFieldsDirty(['r1','r2','r3','r4','rateSel'])}function attachDirty(){['lat','lon','offset','year','month','day','hour','minute','second','poll','idlepoll','throttle','r1','r2','r3','r4','rateSel','wifi_ssid','wifi_pass','ap_ssid','ap_pass','ap_ip','lx200_port','stellarium_port','ntp1','ntp2','tzrule','nearRadius','ntp_enable','dec_limit_enable','alt_limit_enable','dec_min','dec_max','alt_min','alt_max'].forEach(n=>{let e=id(n);if(e&&!e.dataset.bound){e.addEventListener('input',markDirty);e.addEventListener('change',markDirty);e.dataset.bound='1'}})}function setTargetRaDec(ra,dec){let r=id('ra_hours'),d=id('dec_deg');if(r)r.value=Number(ra).toFixed(6);if(d)d.value=Number(dec).toFixed(6)}function setTargetAltAz(alt,az){let a=id('alt_deg'),z=id('az_deg');if(a)a.value=Number(alt).toFixed(6);if(z)z.value=Number(az).toFixed(6)}function loadCurrentRaDecTarget(){if(!lastStatus)return;setTargetRaDec(lastStatus.raHours,lastStatus.decDeg);setMsg('gotoMsg','Loaded current RA/Dec into target fields','ok')}function loadCurrentAltAzTarget(){if(!lastStatus)return;setTargetAltAz(lastStatus.altDeg,lastStatus.azDeg);setMsg('altazMsg','Loaded current Alt/Az into target fields','ok')}function fillInputs(j){lastStatus=j;attachDirty();autoUpdatePointingId();setText('curRaHours',j.cacheValid?j.raHours.toFixed(6):'?');setText('curDecDeg',j.cacheValid?j.decDeg.toFixed(6):'?');setText('curAltDeg',j.altAzCacheValid?j.altDeg.toFixed(6):'?');setText('curAzDeg',j.altAzCacheValid?j.azDeg.toFixed(6):'?');let tzBanner=(typeof localTzAbbr==='function'&&j.timeValid)?localTzAbbr():'';setText('topDateTime',j.localYear+'-'+String(j.localMonth).padStart(2,'0')+'-'+String(j.localDay).padStart(2,'0')+' '+String(j.localHour).padStart(2,'0')+':'+String(j.localMinute).padStart(2,'0')+':'+String(j.localSecond).padStart(2,'0')+(tzBanner?' '+tzBanner:''));setText('topLat',Number(j.latitude).toFixed(6));setText('topLon',Number(j.longitude).toFixed(6));setText('topCpuLoad',j.cpuLoad||'CPU Load --%');if(!targetsInitialized){setTargetRaDec(j.raHours,j.decDeg);setTargetAltAz(j.altDeg,j.azDeg);targetsInitialized=true}setVal('lat',j.latitude,6);setVal('lon',j.longitude,6);setVal('offset',j.utcOffsetMinutes);setVal('poll',j.pollIntervalMs);setVal('throttle',j.clientThrottleMs);setVal('r1',j.nudgeRate1,3);setVal('r2',j.nudgeRate2,3);setVal('r3',j.nudgeRate3,3);setVal('r4',j.nudgeRate4,3);setVal('dec_min',j.safeDecMinDeg,2);setVal('dec_max',j.safeDecMaxDeg,2);setChecked('dec_limit_enable',j.safeDecLimitEnabled);setVal('alt_min',j.safeAltMinDeg,2);setVal('alt_max',j.safeAltMaxDeg,2);setChecked('alt_limit_enable',j.safeAltLimitEnabled);setVal('rateSel',j.webSelectedRate);setVal('year',j.localYear);setVal('month',j.localMonth);setVal('day',j.localDay);setVal('hour',j.localHour);setVal('minute',j.localMinute);setVal('second',j.localSecond);setVal('wifi_ssid',j.staSsid);setVal('ap_ssid',j.apSsid);setVal('ap_pass',j.apPass);setVal('ap_ip',j.apIpConfig);setVal('web_port',j.webPort);setVal('alpaca_port',j.alpacaPort);setVal('alpaca_discovery_port',j.alpacaDiscoveryPort);setVal('lx200_port',j.lx200Port);setVal('stellarium_port',j.stellariumPort);setVal('telnet_port',j.telnetPort);setVal('ntp1',j.ntpServer1);setVal('ntp2',j.ntpServer2);setVal('tzrule',j.tzRule);setVal('logLevelSel',j.logLevelName||'info');setChecked('ntp_enable',j.ntpEnabled);setText('ipLocStatus',j.approxIpLocationStatus);setText('ipLocLatLon',j.approxIpLocationValid?(Number(j.approxIpLat).toFixed(6)+', '+Number(j.approxIpLon).toFixed(6)):'none');setText('ipLocText',j.approxIpLocationText||'');if(typeof catRefreshLabels==='function')catRefreshLabels();if(typeof catUpdate==='function')catUpdate();if(typeof identifyPointingNow==='function'){}}"));
  server.sendContent(F("const _fillInputsBase=fillInputs;fillInputs=function(j){_fillInputsBase(j);setVal('idlepoll',j.idlePollIntervalMs);let e=id('idlepoll');if(e&&!e.dataset.bound){e.addEventListener('input',markDirty);e.addEventListener('change',markDirty);e.dataset.bound='1'}};"));
  server.sendContent(F("async function updateNow(){try{let j=await getJson('/status');let sc=id('statusCard');sc.classList.remove('alive','busy','idle','fault');if(j.mountFault){sc.classList.add('fault');setText('healthLine','MOUNT NOT RESPONDING');setText('healthLine2','MOUNT NOT RESPONDING')}else if(j.mountBusy){sc.classList.add('busy');setText('healthLine','MOUNT BUSY / SLEWING');setText('healthLine2','MOUNT BUSY / SLEWING')}else if(j.mountAlive){sc.classList.add('alive');setText('healthLine','MOUNT CONNECTED - '+j.lastResponseAgeMs+' ms');setText('healthLine2','MOUNT CONNECTED - '+j.lastResponseAgeMs+' ms')}else{sc.classList.add('idle');setText('healthLine','MOUNT UNKNOWN');setText('healthLine2','MOUNT UNKNOWN')}id('statusBox').textContent=j.statusText;id('sysBox').textContent=j.systemText;let bs=id('statusBasicBox'),bh=id('sysBasicBox');if(bs)bs.textContent=j.basicStatusText||'Status unavailable';if(bh)bh.textContent=j.basicSystemText||'System health unavailable';let la=id('logAlert');if(la){if(j.mountFault){la.classList.remove('off');la.textContent='MOUNT DISCONNECTED: '+(j.lastMountFault||'not responding')}else{la.classList.add('off');la.textContent=''}}fillInputs(j)}catch(e){}}let logsLive=true;function selectedLogCats(){let a=[];document.querySelectorAll('.logcat').forEach(c=>{if(c.checked)a.push(c.value)});return a.length?a.join(','):'none'}function applyLogSettings(){jsonAction('/setlog?level='+enc(id('logLevelSel').value)+'&cats='+enc(selectedLogCats()),'logsMsg',function(){refreshLogs()},'applyLogSettings')}function toggleLogsLive(){logsLive=!logsLive;let b=id('logsLiveBtn');if(b)b.textContent=logsLive?'Pause Logs':'Start Logs';if(logsLive)refreshLogs()}async function refreshLogs(){if(!logsLive)return;try{let b=id('logBox');b.textContent=await getText('/logs');b.scrollTop=0}catch(e){}}async function initialPageLoad(){applyScale();applyTheme();applyStatusMode();restoreTab();catPopulate();updateNow();refreshLogs();if(false){setTimeout(function(){startupReadAltAz()},900)}setTimeout(updateNow,2500);setTimeout(function(){updateNow();if(typeof catRefreshLabels==='function')catRefreshLabels();if(typeof catUpdate==='function')catUpdate()},4500)}setInterval(updateNow,8000);setInterval(refreshLogs,5000);window.addEventListener('load',initialPageLoad);"));
  server.sendContent(F("function badge(ok,warn){return ok?'ok':(warn?'bad':'warn')}function age(ms){return ms?Math.round(ms/1000)+'s ago':'never'}function dashSet(n,t,c){let e=id(n);if(e){e.textContent=t;e.className='badge '+(c||'warn')}}function updateProtocolDash(j){let btRx=j.lx200BtRxCommands||0,btTx=j.lx200BtTxReplies||0,eff=j.effectivePollIntervalMs||0,dem=j.positionDemandActive?'active':'idle';dashSet('bMount',j.mountFault?'FAULT':(j.mountBusy?'BUSY':(j.mountAlive?'OK':'?')),j.mountAlive&&!j.mountFault,j.mountFault);dashSet('bTime',j.timeValid?'TIME OK':'TIME ?',j.timeValid,!j.timeValid);dashSet('bLoc',j.siteValid?'LOC OK':'LOC ?',j.siteValid,!j.siteValid);dashSet('bAlpaca',j.alpacaConnected?'ALPACA OK':'ALPACA ?',j.alpacaConnected,false);dashSet('bSky',j.bluetoothConnected?'BT SKY ON':(btRx?'BT SKY RX':(j.lx200WifiConnected?'WIFI SKY ON':(j.lx200WifiRxCommands?'WIFI SKY RX':'SKY WAIT'))),j.bluetoothConnected||btRx||j.lx200WifiConnected||j.lx200WifiRxCommands,false);dashSet('bStel',j.stellariumConnected?'STEL ON':(j.stellariumRxPackets?'STEL RX':'STEL WAIT'),j.stellariumConnected||j.stellariumRxPackets,false);let dm=id('dashMount');if(dm)dm.style.whiteSpace='pre-line';setText('dashMount','current poll '+eff+' ms '+dem+'\\nmount uptime '+(j.mountUptime||'0:00')+' h:mm\\npoll age '+j.mountCurrentRaDecAgeMs+' ms');setText('dashTime','source '+j.timeSource+' / location '+j.locationSource);setText('dashPorts','web '+j.webPort+' / alpaca '+j.alpacaPort+' / SkySafari WiFi '+j.lx200Port+' / Stellarium '+j.stellariumPort+' / BT '+(j.bluetoothEnabled?'on':'off'));setText('dashProto','Alpaca req '+(j.alpacaHttpRequests||0)+' / Sky WiFi RX '+j.lx200WifiRxCommands+' TX '+j.lx200WifiTxReplies+' / Sky BT RX '+btRx+' TX '+btTx+' / Stell RX '+j.stellariumRxPackets+' TX '+j.stellariumTxPackets);setText('dashFault',j.logAlert?j.logAlertText:(j.lastMountFault||'none'));let tl=id('timeConfidence');if(tl){let cls=j.timeValid&&j.siteValid?'ok':'bad';tl.className='msg '+cls;tl.textContent=(j.timeValid&&j.siteValid?'Time/location valid: ':'Time/location warning: ')+'time='+j.timeSource+', location='+j.locationSource+', offset='+j.utcOffsetMinutes+' minutes'}}async function refreshProtocolDash(){try{updateProtocolDash(await getJson('/status'))}catch(e){}}setInterval(refreshProtocolDash,8000);"));
  server.sendContent(F("let csOpen=null;function csClose(){if(csOpen){csOpen.classList.remove('open');csOpen=null}}function csPosition(h){let b=h.querySelector('.csBtn'),m=h.querySelector('.csMenu'),r=b.getBoundingClientRect(),vh=window.innerHeight||document.documentElement.clientHeight,spaceBelow=vh-r.bottom,spaceAbove=r.top,w=Math.max(r.width,180),mh=Math.min(360,Math.max(130,(spaceBelow>=180?spaceBelow-8:spaceAbove-8)));m.style.width=w+'px';m.style.maxHeight=mh+'px';m.style.left=Math.max(4,Math.min(r.left,(window.innerWidth||document.documentElement.clientWidth)-w-4))+'px';if(spaceBelow>=180||spaceBelow>=spaceAbove)m.style.top=(r.bottom+2)+'px';else m.style.top=Math.max(4,r.top-mh-2)+'px'}function csSync(sel){let h=sel&&sel._csHost;if(!h)return;let b=h.querySelector('.csBtn'),m=h.querySelector('.csMenu'),opts=Array.from(sel.options);b.textContent=sel.selectedIndex>=0?opts[sel.selectedIndex].textContent:'Select';b.disabled=sel.disabled;m.innerHTML='';opts.forEach((o,i)=>{let x=document.createElement('button');x.type='button';x.className='csOpt'+(o.disabled?' disabled':'')+(o.classList.contains('belowHorizon')?' belowHorizon':'')+(i===sel.selectedIndex?' sel':'');x.textContent=o.textContent;x.disabled=o.disabled;x.dataset.index=i;x.onclick=function(ev){ev.preventDefault();ev.stopPropagation();if(o.disabled)return;sel.selectedIndex=i;sel.dispatchEvent(new Event('change',{bubbles:true}));csSync(sel);csClose()};m.appendChild(x)})}function csEnhance(sel){if(!sel||sel._csHost)return;let h=document.createElement('div');h.className='csHost';sel.parentNode.insertBefore(h,sel);h.appendChild(sel);let b=document.createElement('button');b.type='button';b.className='csBtn';b.setAttribute('aria-haspopup','listbox');let m=document.createElement('div');m.className='csMenu';m.setAttribute('role','listbox');h.appendChild(b);h.appendChild(m);sel._csHost=h;b.onclick=function(ev){ev.preventDefault();ev.stopPropagation();if(csOpen&&csOpen!==h)csClose();let opening=!h.classList.contains('open');h.classList.toggle('open',opening);csOpen=opening?h:null;if(opening){csSync(sel);csPosition(h)}};new MutationObserver(function(){csSync(sel)}).observe(sel,{childList:true,subtree:true,attributes:true,characterData:true});sel.addEventListener('change',function(){csSync(sel)});csSync(sel)}function csInit(root){(root||document).querySelectorAll('select').forEach(csEnhance)}document.addEventListener('click',csClose);window.addEventListener('resize',function(){if(csOpen)csPosition(csOpen)});window.addEventListener('scroll',function(){if(csOpen)csPosition(csOpen)},true);document.addEventListener('DOMContentLoaded',function(){csInit(document);setInterval(function(){document.querySelectorAll('select').forEach(function(s){if(!s._csHost)csEnhance(s);else csSync(s)})},1000)});"));
  server.sendContent(F("</script><style>.csHost{position:relative;display:inline-block;width:100%;max-width:100%;margin:0}.csHost>select{position:absolute!important;left:-10000px!important;width:1px!important;height:1px!important;opacity:0!important;pointer-events:none!important}.csBtn{width:100%;margin:0!important;text-align:left;display:flex;align-items:center;justify-content:space-between;gap:.6em;min-height:2.45em;background:#0a1122!important;color:#edf2ff!important;border:1px solid #2b3654!important;border-radius:8px!important;font-weight:400!important}.csBtn:after{content:'';display:inline-block;flex:0 0 auto;width:.52em;height:.52em;border-right:2px solid currentColor;border-bottom:2px solid currentColor;transform:rotate(45deg);margin:0 .2em .25em .5em;opacity:.85}.csHost.open .csBtn:after{transform:rotate(225deg);margin:.25em .2em 0 .5em}.csMenu{display:none;position:fixed;z-index:10000;max-height:min(55vh,360px);overflow:auto;background:#0a1122;color:#edf2ff;border:1px solid #2b3654;border-radius:9px;box-shadow:0 8px 26px #000b;padding:4px;box-sizing:border-box;-webkit-overflow-scrolling:touch}.csHost.open .csMenu{display:block}.csOpt{display:block;width:100%;text-align:left;margin:0!important;padding:.62em .7em;border:0!important;border-radius:6px!important;background:#0a1122!important;color:#edf2ff!important;font-weight:400!important}.csOpt:hover,.csOpt:focus,.csOpt.sel{background:#174b80!important;color:#fff!important}.csOpt:disabled,.csOpt.disabled{background:#101729!important;color:#7f899f!important;opacity:1}.csOpt.belowHorizon{color:#7f899f!important}.themeLight .csBtn,.themeLight .csMenu,.themeLight .csOpt{background:#f8fafc!important;color:#172033!important;border-color:#aab4c2!important}.themeLight .csOpt:hover,.themeLight .csOpt:focus,.themeLight .csOpt.sel{background:#1769aa!important;color:#fff!important}.themeLight .csOpt:disabled,.themeLight .csOpt.disabled,.themeLight .csOpt.belowHorizon{background:#eef1f5!important;color:#8993a3!important}.themeNight .csBtn,.themeNight .csMenu,.themeNight .csOpt{background:#050000!important;color:#ff3a3a!important;border-color:#650000!important}.themeNight .csOpt:hover,.themeNight .csOpt:focus,.themeNight .csOpt.sel{background:#5a0000!important;color:#ff7070!important}.themeNight .csOpt:disabled,.themeNight .csOpt.disabled,.themeNight .csOpt.belowHorizon{background:#100000!important;color:#7f2020!important}.row .csHost{width:auto;min-width:10em}@media(max-width:699px){.row .csHost{display:block;width:100%;margin:6px 0}.csMenu{max-height:60vh}}.dash{display:grid;grid-template-columns:repeat(auto-fit,minmax(190px,1fr));gap:8px;margin:8px 0}.dash .card{border-width:1px;padding:8px}.badge{display:inline-block;font-weight:bold;border-radius:7px;padding:3px 7px;margin:2px 4px 4px 0;background:#1b2742;border:1px solid #2b3654}.badge.ok{background:#123d2b;color:#8dffba}.badge.warn{background:#4b4210;color:#ffe58a}.badge.bad{background:#4b2630;color:#ff8d8d}.connBtns button{min-width:9.5em}.tight{min-height:0}</style></head><body><div class='topbar'><h2>"));
  server.sendContent(FW_NAME);
  server.sendContent(F(" "));
  server.sendContent(FW_VERSION);
