gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  server.sendContent(F("</h2><div class='scaleCtl'><button id='nightModeBtn' class='nightBtn' onclick='toggleNightMode()'>Red</button><button id='themeLightBtn' onclick=\"setBaseTheme('light')\">Light</button><button id='themeDarkBtn' onclick=\"setBaseTheme('dark')\">Dark</button><button onclick=\"location.href='/reboot?return='+encodeURIComponent(location.href)\">Reboot</button><button onclick=\"location.href='/setmode?mode=bt&return='+encodeURIComponent(location.href)\">BT</button><button onclick='scaleUi(-0.1)'>-</button><span id='scalePct'>100%</span><button onclick='scaleUi(0.1)'>+</button></div></div><div class='quick'><span id='healthLine'>Mount Unknown</span><br>Current RA <span id='curRaHours'>?</span> h / Dec <span id='curDecDeg'>?</span> deg<br>Current Alt <span id='curAltDeg'>?</span> deg / Az <span id='curAzDeg'>?</span> deg<br>Time <span id='topDateTime'>?</span><br>Lat <span id='topLat'>?</span> / Lon <span id='topLon'>?</span><br><span id='topCpuLoad'>CPU Load --%</span><br><span id='logAlert' class='logAlert off'></span></div><div id='timeConfidence' class='msg'>Checking time/location confidence...</div><div class='dash'><div class='card tight'><h3>Mount</h3><span id='bMount' class='badge warn'>?</span><div id='dashMount' class='small'>Loading...</div></div><div class='card tight'><h3>Time / Location</h3><span id='bTime' class='badge warn'>?</span><span id='bLoc' class='badge warn'>?</span><div id='dashTime' class='small'>Loading...</div></div><div class='card tight'><h3>Protocols</h3><span id='bAlpaca' class='badge warn'>?</span><span id='bSky' class='badge warn'>?</span><span id='bStel' class='badge warn'>?</span><div id='dashProto' class='small'>Loading...</div></div><div class='card tight'><h3>Ports / Fault</h3><div id='dashPorts' class='small'>Loading...</div><div id='dashFault' class='small'>none</div></div></div><div class='tabs'><button id='btn_control' onclick='showTab(&quot;control&quot;)'>Control</button><button id='btn_status' onclick='showTab(&quot;status&quot;)'>Status</button><button id='btn_setup' onclick='showTab(&quot;setup&quot;)'>Setup</button><button id='btn_logs' onclick='showTab(&quot;logs&quot;)'>Logs</button><button onclick='startHttpsTimeLocation()'>GPS Sync</button></div><div class='grid'>"));
  server.sendContent(F("<div id='tab_control' class='tab active'>"));
  server.sendContent(F("<script>setTimeout(refreshProtocolDash,700);</script>"));
  server.sendContent(F("<div class='card'><h3>Catalog Goto</h3><div id='catMsg' class='msg'></div><div class='formrow'><label>Search all objects</label><input id='cat_search' oninput='catPopulate()' placeholder='Moon, Jupiter, M31, Rosette, Vega'></div><div class='formrow'><label>Group</label><select id='cat_group'><option value='solar'>Planetary / Solar System</option><option value='messier'>Deep Sky / Messier+</option><option value='galaxy'>Galaxies</option><option value='nebula'>Nebulae</option><option value='planetary_nebula'>Planetary Nebulae</option><option value='globular'>Globular Clusters</option><option value='open'>Open Clusters</option><option value='stars'>Bright Stars</option><option value='bsc'>BSC5 Bright Stars</option></select></div><div class='formrow'><label>Sort</label><select id='cat_sort' onchange='catPopulate()'><option value='brightness' selected>Brightness</option><option value='visibility'>Visibility / altitude</option><option value='name'>Name</option></select></div><div class='formrow'><label>Selected</label><select id='cat_obj' onchange='catUpdate()'></select></div><div class='formrow'><label>Current</label><input id='pointingIdBox' readonly value='not checked yet' style='width:100%;max-width:100%;'></div><div class='formrow'><label>Nearby radius deg</label><input id='nearRadius' value='10' style='width:70px' oninput='lastPointingIdKey=&quot;&quot;;identifyPointingNow()' onchange='lastPointingIdKey=&quot;&quot;;identifyPointingNow()'></div><div class='formrow'><label>Nearby object</label><select id='nearestSelect' onchange='selectNearestCandidate()'><option value='' selected>Select a nearby object</option></select></div><div class='hint'>Nearby shown: <span id='nearCount'>0</span></div><div class='actions'><button onclick='catSlew()'>Slew to Object</button></div></div>"));
  server.sendContent(F("<script>function catGroupSelected(){let s=id('cat_search');if(s&&s.value)s.value='';let g=id('cat_group');if(g&&g.value==='bsc'&&!catBSCLoaded)loadBSC5().then(()=>catPopulate());catPopulate()}setTimeout(function(){let g=id('cat_group');if(g&&!g.dataset.bound){g.addEventListener('change',catGroupSelected);g.dataset.bound='1'}if(typeof catPopulate==='function')catPopulate();},250);</script>"));
  server.sendContent(F("<style>#cat_obj option.belowHorizon,#nearestSelect option.belowHorizon{color:#8a8a8a;background:#1a1a1a}.themeLight #cat_obj option.belowHorizon,.themeLight #nearestSelect option.belowHorizon{color:#777;background:#e7e9ee}.themeNight #cat_obj option.belowHorizon,.themeNight #nearestSelect option.belowHorizon{color:#8c3030;background:#120000}</style><script>function catIsBelowHorizon(c){let aa=c?catAltAzFromRaDec(c.ra,c.dec):null;return !!(aa&&isFinite(aa.alt)&&aa.alt<0)}function catDecoratedOptionText(x){return catOptionText(x)}function catPopulate(){setText('bscCount',String(catBscCount()));let o=id('cat_obj');if(!o)return;let arr=catArray(),old=o.value;o.innerHTML='';arr.forEach(x=>{let op=document.createElement('option'),c=x.src==='solar'?simpleSolar(x.id):x,below=catIsBelowHorizon(c);op.value=(x.src||'dso')+':'+x.id;op.textContent=catDecoratedOptionText(x);if(below){op.className='belowHorizon';op.dataset.below='1';op.style.color='#777';op.style.backgroundColor='#222'}o.appendChild(op)});setText('catShown',String(arr.length));setText('catTotal',String(window.catTotalBeforeLimit||arr.length));if(old){for(let i=0;i<o.options.length;i++){if(o.options[i].value===old){o.selectedIndex=i;break}}}if(o.selectedIndex<0&&o.options.length>0)o.selectedIndex=0;catUpdate()}function catRefreshLabels(){let o=id('cat_obj');if(!o)return;let arr=catArray(),m={};arr.forEach(x=>{m[(x.src||'dso')+':'+x.id]=catDecoratedOptionText(x)});for(let i=0;i<o.options.length;i++){let v=o.options[i].value;if(m[v])o.options[i].textContent=m[v]}}function catUpdate(){let c=catSelected();if(!c){catSetInfo('RA ? / Dec ?<br>Sky Alt ? / Az ?<br>Mount Alt ? / Az ?');return}let aa=catAltAzFromRaDec(c.ra,c.dec),below=catIsBelowHorizon(c);let coord=(below?'Below horizon<br>':'')+'RA '+hms(c.ra)+' h / Dec '+dms(c.dec)+' deg<br>Sky Alt '+(aa?Number(aa.alt).toFixed(2):'?')+' deg / Az '+(aa?Number(aa.az).toFixed(2):'?')+' deg';coord+='<br>Mount Alt '+(lastStatus&&lastStatus.altAzCacheValid?Number(lastStatus.altDeg).toFixed(2):'?')+' deg / Az '+(lastStatus&&lastStatus.altAzCacheValid?Number(lastStatus.azDeg).toFixed(2):'?')+' deg';if(c.approx)coord+=' APPROX ephemeris';catSetInfo(coord)}</script>"));
  server.sendContent(F("<div class='card'><h3>Manual Nudge</h3><div id='mainMsg' class='msg'></div><div class='formrow'><label>Rate</label><select id='rateSel' onchange='setRate()'><option value='1'>Rate 1</option><option value='2'>Rate 2</option><option value='3'>Rate 3</option><option value='4'>Rate 4</option></select></div><div class='pad'><div><button onclick=\"nudge('n')\">Up</button></div><div><button onclick=\"nudge('w')\">Left</button><button onclick=\"nudge('e')\">Right</button></div><div><button onclick=\"nudge('s')\">Down</button></div></div></div>"));

  server.sendContent(F("<div class='card'><h3>GOTO RA/Dec</h3><div id='gotoMsg' class='msg'></div><div class='formrow'><label>Target RA hours</label><input id='ra_hours'></div><div class='formrow'><label>Target Dec deg</label><input id='dec_deg'></div><div class='actions'><button onclick='gotoRaDec()'>GOTO RA/Dec</button><button onclick='readRaDec()'>Load Current RA/Dec</button></div></div>"));

