gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  server.sendContent(F("<div class='card'><h3>GOTO Alt/Az</h3><div id='altazMsg' class='msg'></div><div class='formrow'><label>Target Alt deg</label><input id='alt_deg'></div><div class='formrow'><label>Target Az deg</label><input id='az_deg'></div><div class='actions'><button onclick='gotoAltAz()'>GOTO Alt/Az</button><button onclick='readAltAz()'>Load Current Alt/Az</button></div></div>"));
  server.sendContent(F("</div>"));

  server.sendContent(F("<div id='tab_status' class='tab'>"));
  server.sendContent(F("<div class='actions statusToolbar' style='grid-column:1/-1;margin-top:0'><button id='statusModeBtn' class='statusModeBtn' onclick='toggleStatusMode()'>Advanced</button></div><div id='statusBasicWrap' class='statusPair'><div id='statusCard' class='card status idle'><h3>Observer Status</h3><pre id='statusBasicBox'>Loading...</pre></div><div class='card'><h3>System Health</h3><pre id='sysBasicBox'>Loading...</pre></div></div><div id='statusAdvancedWrap' class='statusPair' style='display:none'><div id='statusCardAdvanced' class='card'><h3>Observer Status - Advanced</h3><pre id='statusBox'>Loading...</pre></div><div class='card'><h3>System Health - Advanced</h3><pre id='sysBox'>Loading...</pre></div></div>"));
  server.sendContent(F("</div>"));

  server.sendContent(F("<div id='tab_setup' class='tab'>"));
  server.sendContent(F("<div class='card'><h3>Site / Time / Polling</h3><div id='siteMsg' class='msg'></div><div class='formrow'><label>Latitude</label><input id='lat'></div><div class='formrow'><label>Longitude east-positive</label><input id='lon'></div><div class='formrow'><label>UTC offset minutes</label><input id='offset'></div><div class='formrow'><label>Date</label><div><input id='year' style='width:78px'> - <input id='month' style='width:58px'> - <input id='day' style='width:58px'></div></div><div class='formrow'><label>Time</label><div><input id='hour' style='width:58px'> : <input id='minute' style='width:58px'> : <input id='second' style='width:58px'></div></div><div class='formrow'><label>Active poll interval ms</label><input id='poll'></div><div class='formrow'><label>Idle poll interval ms</label><input id='idlepoll'></div><div class='formrow'><label>Client throttle ms</label><input id='throttle'></div><div class='actions'><button onclick='saveManualSiteTime()'>Save Site / Time / Polling</button><button onclick='startHttpsTimeLocation()'>GPS Sync</button><button onclick='clearSavedSite()'>Clear Saved Last Location</button></div><div class='hint'>Active polling starts after SkySafari, Stellarium, Alpaca, or the status page requests position. Idle polling is used otherwise.</div></div>"));
  server.sendContent(F("<div class='card'><h3>Time / NTP</h3><div id='ntpMsg' class='msg'></div><div class='formrow'><label>Enable NTP</label><label style='font-weight:normal'><input type='checkbox' id='ntp_enable'></label></div><div class='formrow'><label>NTP server 1</label><input id='ntp1' value='pool.ntp.org'></div><div class='formrow'><label>NTP server 2</label><input id='ntp2' value='time.nist.gov'></div><div class='formrow'><label>TZ / DST rule</label><input id='tzrule' value='MST7MDT,M3.2.0/2,M11.1.0/2'></div><div class='actions'><button onclick='saveNtp()'>Save NTP Settings</button><button onclick='syncNtp()'>Sync NTP Now</button></div><div class='hint'>Uses STA WiFi or phone hotspot internet. Default TZ is US Mountain with DST.</div></div>"));
  server.sendContent(F("<div class='card'><h3>Approx Internet Location</h3><div id='ipLocMsg' class='msg'></div><p class='small'>Uses public IP geolocation. City-level only; verify before precision alignment.</p>Status: <span id='ipLocStatus'>Not fetched</span><br>Lat/Lon: <span id='ipLocLatLon'>none</span><br><span id='ipLocText' class='small'></span><br><button onclick='fetchIpLoc()'>Get Approx Location</button><button onclick='useIpLoc()'>Use This Location</button></div>"));
  server.sendContent(F("<div class='card'><h3>STA WiFi Setup</h3><div id='wifiMsg' class='msg'></div><div class='formrow'><label>STA SSID</label><input id='wifi_ssid'></div><div class='formrow'><label>STA Password</label><input id='wifi_pass' type='text' value='"));
  server.sendContent(htmlEscape(staPass));
  server.sendContent(F("'></div><div class='actions'><button onclick='saveWifi()'>Save / Connect STA</button><button onclick='clearWifi()'>Reset WiFi To AP Only</button></div><div class='hint'>When STA is configured, the unit runs STA-only. If STA fails, it falls back to AP-only.</div></div>"));
  server.sendContent(F("<div class='card'><h3>AP Setup</h3><div id='apMsg' class='msg'></div><div class='formrow'><label>AP SSID</label><input id='ap_ssid'></div><div class='formrow'><label>AP Password</label><input id='ap_pass' type='text'></div><div class='formrow'><label>AP IP</label><input id='ap_ip'></div><div class='actions'><button onclick='saveAp()'>Save AP / Server Config</button></div><div class='hint'>Password may be blank/open or at least 8 characters. The AP SSID box shows the full broadcast name.</div></div>"));
  server.sendContent(F("<div class='card'><h3>Nudge Rates</h3><div id='settingsMsg' class='msg'></div><div class='formrow'><label>Rate 1 deg</label><input id='r1'></div><div class='formrow'><label>Rate 2 deg</label><input id='r2'></div><div class='formrow'><label>Rate 3 deg</label><input id='r3'></div><div class='formrow'><label>Rate 4 deg</label><input id='r4'></div><div class='actions'><button onclick='saveRates()'>Save Rates</button><button onclick='resetRates()'>Reset Defaults</button></div></div>")); 
  server.sendContent(F("<div class='card'><h3>Altitude Safety Limits</h3><div id='altLimitMsg' class='msg'></div><div class='formrow'><label>Enable limit</label><label style='font-weight:normal'><input type='checkbox' id='alt_limit_enable'></label></div><div class='formrow'><label>Minimum Alt deg</label><input id='alt_min' value='0'></div><div class='formrow'><label>Maximum Alt deg</label><input id='alt_max' value='85'></div><div class='actions'><button onclick='saveAltLimits()'>Save Alt Limits</button></div><div class='hint'>Blocks targets too low or too high. Use this to prevent near-zenith tube/mount clearance problems, such as Alt 86 deg.</div></div>"));
  server.sendContent(F("<div class='card'><h3>Connection / Server Config</h3><div id='connCfgMsg' class='msg'></div><div class='hint'>These are saved configuration values. Port changes automatically restart the device.</div><div class='formrow'><label>Web UI HTTP port</label><input id='web_port' disabled></div><div class='formrow'><label>Alpaca HTTP port</label><input id='alpaca_port' disabled></div><div class='formrow'><label>Alpaca Discovery UDP port</label><input id='alpaca_discovery_port' disabled></div><div class='formrow'><label>SkySafari LX200 port</label><input id='lx200_port'></div><div class='formrow'><label>Stellarium port</label><input id='stellarium_port'></div><div class='formrow'><label>Telnet console port</label><input id='telnet_port'></div><div class='formrow'><label>Telnet password</label><input id='telnet_pass' type='text' placeholder='blank disables password'></div><div class='actions'><button onclick='saveConnCfg()'>Save Server Config</button><button onclick='defaultConnCfg()'>Defaults</button></div><div class='hint'>Web UI uses port 80. Alpaca uses its own HTTP listener on port 11111. Discovery uses the separate UDP port shown above. Telnet default is port 23; password changes require reconnect, port changes restart the device.</div></div>"));
  server.sendContent(F("</div>"));

  server.sendContent(F("<div id='tab_logs' class='tab' style='grid-template-columns:1fr'>"));
  server.sendContent(F("<div class='card logs'><h3>Logs</h3><p class='hint'>Log level: 0 none, 1 error, 2 warn, 3 info, 4 debug, 5 trace. Systems select which firmware areas are shown. The serial monitor mirrors the same timestamped, filtered log lines.</p><div id='logsMsg' class='msg'></div>Log Level<br><select id='logLevelSel' onchange='applyLogSettings()'><option value='error'>error</option><option value='warn' selected>warn</option><option value='info'>info</option><option value='debug'>debug</option><option value='trace'>trace</option><option value='none'>none</option></select><div class='loggrid'><label><input class='logcat' type='checkbox' value='mount' checked onchange='applyLogSettings()'><span>mount</span></label><label><input class='logcat' type='checkbox' value='skysafari' checked onchange='applyLogSettings()'><span>SkySafari</span></label><label><input class='logcat' type='checkbox' value='bluetooth' checked onchange='applyLogSettings()'><span>Bluetooth</span></label><label><input class='logcat' type='checkbox' value='alpaca' checked onchange='applyLogSettings()'><span>Alpaca</span></label><label><input class='logcat' type='checkbox' value='stellarium' checked onchange='applyLogSettings()'><span>Stellarium</span></label><label><input class='logcat' type='checkbox' value='web' checked onchange='applyLogSettings()'><span>web</span></label><label><input class='logcat' type='checkbox' value='wifi' checked onchange='applyLogSettings()'><span>WiFi</span></label><label><input class='logcat' type='checkbox' value='timeloc' checked onchange='applyLogSettings()'><span>time/location</span></label><label><input class='logcat' type='checkbox' value='settings' checked onchange='applyLogSettings()'><span>settings</span></label><label><input class='logcat' type='checkbox' value='system' checked onchange='applyLogSettings()'><span>system</span></label></div><div class='row'><button id='logsLiveBtn' onclick='toggleLogsLive()'>Pause Logs</button><button onclick='clearLogs();refreshLogs()'>Clear Logs</button></div><p class='small'>Newest entries appear at the top. Pause stops updating the window, not internal logging.</p><pre id='logBox'>Waiting for logs...</pre></div>"));
  server.sendContent(F("</div>"));

  server.sendContent(F("</div></body></html>"));
#if defined(ESP32)
  // ESP32 WebServer needs the final zero-length chunk when CONTENT_LENGTH_UNKNOWN is used.
  server.sendContent("");
#endif

  server.sendContent("");
}

void handleLogsPage() {
  logHttpRequest("LOGS");
  String logs = getLogText();
  if (logs.length() == 0) logs = "No logs yet, or current log level/subsystem settings are filtering them before storage.\n";
  sendPlain(logs);
}

void handleStatusTextPage() {
  logHttpRequest("STATUS_TEXT");
  sendPlain(currentStateText());
}

void handleSystemTextPage() {
  logHttpRequest("SYS_TEXT");
  sendPlain(systemHealthText());
}

void handleBtStatusPage() {
  logHttpRequest("BT_STATUS");
  bool btConnected = false;
#if HAS_CLASSIC_BT
  btConnected = bluetoothRuntimeEnabled && SerialBT.hasClient();
#endif
  int dispYear, dispMonth, dispDay, dispHour, dispMinute, dispSecond;
  currentLocalParts(dispYear, dispMonth, dispDay, dispHour, dispMinute, dispSecond);

  String json;
  json.reserve(1100);
  json += "{";
  json += "\"bridgeMode\":\"" + jsonEscape(String(bridgeModeName())) + "\",";
  json += "\"apIp\":\"" + WiFi.softAPIP().toString() + "\",";
  json += "\"staIp\":\"" + WiFi.localIP().toString() + "\",";
  json += "\"staConnected\":" + String((staConnected && WiFi.status() == WL_CONNECTED) ? "true" : "false") + ",";
  json += "\"bluetoothEnabled\":" + String(bluetoothRuntimeEnabled ? "true" : "false") + ",";
  json += "\"bluetoothConnected\":" + String(btConnected ? "true" : "false") + ",";
  json += "\"lx200BtRxCommands\":" + String(lx200BtRxCommands) + ",";
  json += "\"lx200BtTxReplies\":" + String(lx200BtTxReplies) + ",";
  json += "\"lx200BtLastCommand\":\"" + jsonEscape(lx200BtLastCommand) + "\",";
  json += "\"lx200BtLastReply\":\"" + jsonEscape(lx200BtLastReply) + "\",";
  json += "\"lx200BtLastUnhandled\":\"" + jsonEscape(lx200BtLastUnhandled) + "\",";
  json += "\"timeValid\":" + String(timeValid ? "true" : "false") + ",";
  json += "\"timeSource\":\"" + jsonEscape(String(timeSourceName(currentTimeSource))) + "\",";
  json += "\"localYear\":" + String(dispYear) + ",";
  json += "\"localMonth\":" + String(dispMonth) + ",";
  json += "\"localDay\":" + String(dispDay) + ",";
  json += "\"localHour\":" + String(dispHour) + ",";
  json += "\"localMinute\":" + String(dispMinute) + ",";
  json += "\"localSecond\":" + String(dispSecond) + ",";
  json += "\"siteValid\":" + String(siteValid ? "true" : "false") + ",";
  json += "\"locationSource\":\"" + jsonEscape(currentLocationSource) + "\",";
  json += "\"latitude\":" + String(siteLatitudeDeg, 6) + ",";
  json += "\"longitude\":" + String(siteLongitudeDeg, 6) + ",";
  json += "\"mountBusy\":" + String(mountBusy ? "true" : "false") + ",";
  json += "\"mountCommFault\":" + String(mountCommFault ? "true" : "false") + ",";
  json += "\"mountUptime\":\"" + jsonEscape(formatMountUptime()) + "\",";
  json += "\"pollIntervalMs\":" + String(pollIntervalMs) + ",";
  json += "\"idlePollIntervalMs\":" + String(idlePollIntervalMs) + ",";
  json += "\"freeHeap\":" + String(ESP.getFreeHeap());
  json += "}";
  sendNoCacheHeaders();
  server.sendHeader("Connection", "close");
  server.send(200, "application/json", json);
}

