gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
void handleStatusPage() {
  logHttpRequest("STATUS");
  if (bridgeMode == BRIDGE_MODE_BT_MIN_WEB) {
    handleBtStatusPage();
    return;
  }
  if (bridgeMode == BRIDGE_MODE_BT_MIN_WEB) {
    bool btConnected = false;
#if HAS_CLASSIC_BT
    btConnected = bluetoothRuntimeEnabled && SerialBT.hasClient();
#endif
    int dispYear, dispMonth, dispDay, dispHour, dispMinute, dispSecond;
    currentLocalParts(dispYear, dispMonth, dispDay, dispHour, dispMinute, dispSecond);

    String json;
    json.reserve(1200);
    json += "{";
    json += "\"board\":\"" + String(BOARD_NAME) + "\",";
    json += "\"bridgeMode\":\"" + jsonEscape(String(bridgeModeName())) + "\",";
    json += "\"apIp\":\"" + WiFi.softAPIP().toString() + "\",";
    json += "\"staIp\":\"" + WiFi.localIP().toString() + "\",";
    json += "\"lastStaIp\":\"" + jsonEscape(lastStaIp) + "\",";
    json += "\"staConnected\":" + String((staConnected && WiFi.status() == WL_CONNECTED) ? "true" : "false") + ",";
    json += "\"webPort\":" + String(HTTP_WEB_PORT) + ",";
    json += "\"alpacaPort\":0,";
    json += "\"alpacaDiscoveryPort\":0,";
    json += "\"lx200Port\":0,";
    json += "\"stellariumPort\":0,";
    json += "\"bluetoothEnabled\":" + String(bluetoothRuntimeEnabled ? "true" : "false") + ",";
    json += "\"bluetoothConnected\":" + String(btConnected ? "true" : "false") + ",";
    json += "\"coexPreference\":\"" + jsonEscape(coexPreferenceText) + "\",";
    json += "\"coexPreferenceResult\":" + String(coexPreferenceResult) + ",";
    json += "\"lx200BtRxCommands\":" + String(lx200BtRxCommands) + ",";
    json += "\"lx200BtTxReplies\":" + String(lx200BtTxReplies) + ",";
    json += "\"lx200BtUnhandled\":" + String(lx200BtUnhandledCommands) + ",";
  json += "\"lx200CommonRouterCommands\":" + String(lx200CommonRouterCommands) + ",";
    json += "\"lx200BtLastCommand\":\"" + jsonEscape(lx200BtLastCommand) + "\",";
    json += "\"lx200BtLastReply\":\"" + jsonEscape(lx200BtLastReply) + "\",";
    json += "\"lx200BtLastUnhandled\":\"" + jsonEscape(lx200BtLastUnhandled) + "\",";
    json += "\"timeValid\":" + String(timeValid ? "true" : "false") + ",";
    json += "\"timeSource\":\"" + jsonEscape(String(timeSourceName(currentTimeSource))) + "\",";
    json += "\"localYear\":" + String(dispYear) + ",";
    json += "\"localMonth\":" + String(dispMonth) + ",";
    json += "\"localDay\":" + String(dispDay) + ",";
    json += "\"localHour\":" + String(dispHour) + ",";
    json += "\"localMinute\":" + String(dispMinute) + ",";
    json += "\"localSecond\":" + String(dispSecond) + ",";
    json += "\"utcOffsetMinutes\":" + String(utcOffsetMinutes) + ",";
    json += "\"timeZoneLabel\":\"" + jsonEscape(currentTimezoneAbbrev()) + "\",";
    json += "\"siteValid\":" + String(siteValid ? "true" : "false") + ",";
    json += "\"locationSource\":\"" + jsonEscape(currentLocationSource) + "\",";
    json += "\"latitude\":" + String(siteLatitudeDeg, 6) + ",";
    json += "\"longitude\":" + String(siteLongitudeDeg, 6) + ",";
    json += "\"mountBusy\":" + String(mountBusy ? "true" : "false") + ",";
    json += "\"mountCommFault\":" + String(mountCommFault ? "true" : "false") + ",";
    json += "\"cacheValid\":" + String(mountCurrentRaDecValid ? "true" : "false") + ",";
    json += "\"raDeg\":" + String(mountCurrentRA_deg, 6) + ",";
    json += "\"decDeg\":" + String(mountCurrentDec_deg, 6) + ",";
    json += "\"raHours\":" + String(mountCurrentRA_deg / 15.0, 6) + ",";
    json += "\"altAzCacheValid\":" + String(mountCurrentAltAzValid ? "true" : "false") + ",";
    json += "\"altDeg\":" + String(mountCurrentAlt_deg, 6) + ",";
    json += "\"azDeg\":" + String(mountCurrentAz_deg, 6) + ",";
    json += "\"mountCurrentRaDecAgeMs\":" + String(mountCurrentRaDecValid ? millis() - mountCurrentRaDecMs : 0) + ",";
    json += "\"mountCurrentAltAzAgeMs\":" + String(mountCurrentAltAzValid ? millis() - mountCurrentAltAzMs : 0) + ",";
    json += "\"pollIntervalMs\":" + String(pollIntervalMs) + ",";
    json += "\"idlePollIntervalMs\":" + String(idlePollIntervalMs) + ",";
    json += "\"btPostGotoFastPoll\":" + String((lastGotoAcceptedMs && millis() - lastGotoAcceptedMs < BT_POST_GOTO_FAST_POLL_WINDOW_MS) ? "true" : "false") + ",";
    json += "\"freeHeap\":" + String(ESP.getFreeHeap());
    json += "}";
    sendNoCacheHeaders();
    server.sendHeader("Connection", "close");
    server.send(200, "application/json", json);
    return;
  }
  // Status pages do not directly poll the mount. Current-position fields are
  // supplied by the demand-based independent mount poller.

  bool btConnected = false;
#if HAS_CLASSIC_BT
  btConnected = bluetoothRuntimeEnabled && SerialBT.hasClient();
#endif
  bool fullProtocolMode = (bridgeMode == BRIDGE_MODE_WIFI_FULL);

  int dispYear, dispMonth, dispDay, dispHour, dispMinute, dispSecond;
  currentLocalParts(dispYear, dispMonth, dispDay, dispHour, dispMinute, dispSecond);

  String st = currentStateText();
  String sys = systemHealthText();

  String json;
  json.reserve(5000);
  json += "{";
  json += "\"board\":\"" + String(BOARD_NAME) + "\",";
  json += "\"ip\":\"" + WiFi.softAPIP().toString() + "\",";
  json += "\"apIp\":\"" + WiFi.softAPIP().toString() + "\",";
  json += "\"staIp\":\"" + WiFi.localIP().toString() + "\",";
  json += "\"lastStaIp\":\"" + jsonEscape(lastStaIp) + "\",";
  json += "\"staSsid\":\"" + jsonEscape(staSsid) + "\",";
  json += "\"staConfigured\":" + String(staConfigured ? "true" : "false") + ",";
  json += "\"staConnected\":" + String((staConnected && WiFi.status() == WL_CONNECTED) ? "true" : "false") + ",";
  json += "\"wifiMode\":\"" + jsonEscape(wifiModeText) + "\",";
  json += "\"wifiStatus\":\"" + jsonEscape(lastWifiStatus) + "\",";
  json += "\"alpacaConnected\":" + String((fullProtocolMode && alpacaConnected) ? "true" : "false") + ",";
  json += "\"alpacaHttpRequests\":" + String(fullProtocolMode ? alpacaHttpRequests : 0) + ",";
  json += "\"stellariumConnected\":" + String((fullProtocolMode && stellariumClientConnected) ? "true" : "false") + ",";
  json += "\"stellariumRxPackets\":" + String(fullProtocolMode ? stellariumRxPackets : 0) + ",";
  json += "\"stellariumTxPackets\":" + String(fullProtocolMode ? stellariumTxPackets : 0) + ",";
  json += "\"stellariumBadPackets\":" + String(fullProtocolMode ? stellariumBadPackets : 0) + ",";
  json += "\"stellariumLastRxAgeMs\":" + String((fullProtocolMode && stellariumLastRxMs) ? millis() - stellariumLastRxMs : 0) + ",";
  json += "\"stellariumLastTxAgeMs\":" + String((fullProtocolMode && stellariumLastTxMs) ? millis() - stellariumLastTxMs : 0) + ",";
  json += "\"lx200WifiConnected\":" + String((fullProtocolMode && lx200WifiClientConnected) ? "true" : "false") + ",";
  json += "\"lx200WifiRxCommands\":" + String(fullProtocolMode ? lx200WifiRxCommands : 0) + ",";
  json += "\"lx200WifiTxReplies\":" + String(fullProtocolMode ? lx200WifiTxReplies : 0) + ",";
  json += "\"lx200WifiUnhandled\":" + String(fullProtocolMode ? lx200WifiUnhandledCommands : 0) + ",";
  json += "\"lx200WifiLastRxAgeMs\":" + String((fullProtocolMode && lx200WifiLastRxMs) ? millis() - lx200WifiLastRxMs : 0) + ",";
  json += "\"lx200WifiLastTxAgeMs\":" + String((fullProtocolMode && lx200WifiLastTxMs) ? millis() - lx200WifiLastTxMs : 0) + ",";
  json += "\"lx200BtConnected\":" + String(lx200BtClientConnected ? "true" : "false") + ",";
  json += "\"lx200BtRxCommands\":" + String(lx200BtRxCommands) + ",";
  json += "\"lx200BtTxReplies\":" + String(lx200BtTxReplies) + ",";
  json += "\"lx200BtUnhandled\":" + String(lx200BtUnhandledCommands) + ",";
  json += "\"timeSource\":\"" + jsonEscape(String(timeSourceName(currentTimeSource))) + "\",";
  json += "\"locationSource\":\"" + jsonEscape(currentLocationSource) + "\",";
  json += "\"approxIpLocationValid\":" + String(approxIpLocationValid ? "true" : "false") + ",";
  json += "\"approxIpLat\":" + String(approxIpLatitudeDeg, 6) + ",";
  json += "\"approxIpLon\":" + String(approxIpLongitudeDeg, 6) + ",";
  json += "\"approxIpLocationStatus\":\"" + jsonEscape(approxIpLocationStatus) + "\",";
  json += "\"approxIpLocationText\":\"" + jsonEscape(approxIpLocationText) + "\",";
  json += "\"ntpEnabled\":" + String(ntpEnabled ? "true" : "false") + ",";
  json += "\"ntpServer1\":\"" + jsonEscape(String(ntpServer1)) + "\",";
  json += "\"ntpServer2\":\"" + jsonEscape(String(ntpServer2)) + "\",";
  json += "\"tzRule\":\"" + jsonEscape(String(tzRule)) + "\",";
  json += "\"apSsid\":\"" + jsonEscape(runtimeApSsid()) + "\",";
  json += "\"apPass\":\"" + jsonEscape(apPass) + "\",";
  json += "\"apIpConfig\":\"" + jsonEscape(apIp) + "\",";
  json += "\"webPort\":" + String(HTTP_WEB_PORT) + ",";
  json += "\"alpacaPort\":" + String(fullProtocolMode ? ALPACA_PORT : 0) + ",";
  json += "\"alpacaDiscoveryPort\":" + String(fullProtocolMode ? ALPACA_DISCOVERY_PORT : 0) + ",";
  json += "\"lx200Port\":" + String(fullProtocolMode ? LX200_PORT : 0) + ",";
  json += "\"stellariumPort\":" + String(fullProtocolMode ? STELLARIUM_PORT : 0) + ",";
  json += "\"telnetPort\":" + String(fullProtocolMode ? TELNET_PORT : 0) + ",";
  json += "\"telnetPasswordSet\":" + String(telnetPassword.length() ? "true" : "false") + ",";
  json += "\"telnetClientConnected\":" + String((telnetClient && telnetClient.connected()) ? "true" : "false") + ",";
  json += "\"telnetAuthenticated\":" + String(telnetAuthenticated ? "true" : "false") + ",";
  json += "\"telnetRxCommands\":" + String(telnetRxCommands) + ",";
  json += "\"telnetAuthFailures\":" + String(telnetAuthFailures) + ",";
  json += "\"bridgeMode\":\"" + jsonEscape(String(bridgeModeName())) + "\",";
  json += "\"bluetoothEnabled\":" + String(bluetoothRuntimeEnabled ? "true" : "false") + ",";
  json += "\"bluetoothConnected\":" + String(btConnected ? "true" : "false") + ",";
  json += "\"logLevel\":" + String(LOG_LEVEL) + ",";
  json += "\"logLevelName\":\"" + String(logLevelName(LOG_LEVEL)) + "\",";
  json += "\"logCategoryMask\":" + String(LOG_SUBSYSTEM_MASK) + ",";
  json += "\"cacheValid\":" + String(mountCurrentRaDecValid ? "true" : "false") + ",";
  json += "\"raDeg\":" + String(mountCurrentRA_deg, 6) + ",";
  json += "\"decDeg\":" + String(mountCurrentDec_deg, 6) + ",";
  json += "\"raHours\":" + String(mountCurrentRA_deg / 15.0, 6) + ",";
  json += "\"altAzCacheValid\":" + String(mountCurrentAltAzValid ? "true" : "false") + ",";
  json += "\"altAzComputed\":false,";
  json += "\"altDeg\":" + String(mountCurrentAlt_deg, 6) + ",";
  json += "\"azDeg\":" + String(mountCurrentAz_deg, 6) + ",";
  json += "\"mountCurrentRaDecAgeMs\":" + String(mountCurrentRaDecValid ? millis() - mountCurrentRaDecMs : 0) + ",";
  json += "\"mountCurrentAltAzAgeMs\":" + String(mountCurrentAltAzValid ? millis() - mountCurrentAltAzMs : 0) + ",";
  json += "\"siteValid\":" + String(siteValid ? "true" : "false") + ",";
  json += "\"timeValid\":" + String(timeValid ? "true" : "false") + ",";
  json += "\"latitude\":" + String(siteLatitudeDeg, 6) + ",";
  json += "\"longitude\":" + String(siteLongitudeDeg, 6) + ",";
  json += "\"utcOffsetMinutes\":" + String(utcOffsetMinutes) + ",";
  json += "\"localYear\":" + String(dispYear) + ",";
  json += "\"localMonth\":" + String(dispMonth) + ",";
  json += "\"localDay\":" + String(dispDay) + ",";
  json += "\"localHour\":" + String(dispHour) + ",";
  json += "\"localMinute\":" + String(dispMinute) + ",";
  json += "\"localSecond\":" + String(dispSecond) + ",";
  json += "\"pollIntervalMs\":" + String(pollIntervalMs) + ",";
  json += "\"idlePollIntervalMs\":" + String(idlePollIntervalMs) + ",";
  json += "\"effectivePollIntervalMs\":" + String(effectiveMountPollIntervalMs()) + ",";
  json += "\"positionDemandActive\":" + String(positionDemandActive() ? "true" : "false") + ",";
  json += "\"btPostGotoFastPoll\":" + String((bridgeMode == BRIDGE_MODE_BT_MIN_WEB && lastGotoAcceptedMs && millis() - lastGotoAcceptedMs < BT_POST_GOTO_FAST_POLL_WINDOW_MS) ? "true" : "false") + ",";
  json += "\"backgroundPollFailCount\":" + String(backgroundPollFailCount) + ",";
  json += "\"backgroundPollingAutoDisabled\":false,";
  json += "\"mountPollingPolicy\":\"independent_interval_only\",";
  json += "\"positionApiPolicy\":\"applications_read_cache_only\",";
  json += "\"positionApiCacheReplies\":" + String(positionApiCacheReplies) + ",";
  json += "\"positionApiCacheMisses\":" + String(positionApiCacheMisses) + ",";
  json += "\"gotoQueueActive\":" + String(hasQueuedGoto() ? "true" : "false") + ",";
  json += "\"gotoQueueType\":\"" + String(queuedGotoTypeName(queuedGotoType)) + "\",";
  json += "\"gotoQueueAgeMs\":" + String(queuedGotoAgeMs()) + ",";
  json += "\"gotoQueueTimeoutMs\":" + String(gotoQueueTimeoutMs) + ",";
  json += "\"gotoQueueEffectiveTimeoutMs\":" + String(effectiveGotoQueueTimeoutMs()) + ",";
  json += "\"gotoQueueAccepted\":" + String(gotoQueueAccepted) + ",";
  json += "\"gotoQueueStarted\":" + String(gotoQueueStarted) + ",";
  json += "\"gotoQueueTimedOut\":" + String(gotoQueueTimedOut) + ",";
  json += "\"gotoQueueReplaced\":" + String(gotoQueueReplaced) + ",";
  json += "\"nudgeGotoQueueRequests\":" + String(nudgeGotoQueueRequests) + ",";
  json += "\"gotoQueueImmediateAcks\":" + String(gotoQueueImmediateAcks) + ",";
  json += "\"queuedGotoPositionCacheReplies\":" + String(queuedGotoPositionCacheReplies) + ",";
  json += "\"clientThrottleMs\":" + String(minClientPollIntervalMs) + ",";
  json += "\"persistentSaveCount\":" + String(persistentSaveCount) + ",";
  json += "\"lastPersistentSaveAgeMs\":" + String(lastPersistentSaveMs == 0 ? 0 : millis() - lastPersistentSaveMs) + ",";
  json += "\"logAlert\":" + String(logAlertActive ? "true" : "false") + ",";
  json += "\"logAlertText\":\"" + jsonEscape(logAlertText) + "\",";
  json += "\"mountBusy\":" + String(slewControllerBusy() ? "true" : "false") + ",";
  json += "\"mountAlive\":" + String(mountAlive() ? "true" : "false") + ",";
  json += "\"mountFault\":" + String(mountCommFault ? "true" : "false") + ",";
  json += "\"lastMountFault\":\"" + jsonEscape(lastMountFault) + "\",";
  json += "\"lastResponseAgeMs\":" + String(mountLastResponseAge()) + ",";
  json += "\"mountUptime\":\"" + jsonEscape(formatMountUptime()) + "\",";
  json += "\"webSelectedRate\":" + String(webSelectedRateIndex + 1) + ",";
  json += "\"nudgeRate1\":" + String(nudgeRateDeg[0], 3) + ",";
  json += "\"nudgeRate2\":" + String(nudgeRateDeg[1], 3) + ",";
  json += "\"nudgeRate3\":" + String(nudgeRateDeg[2], 3) + ",";
  json += "\"nudgeRate4\":" + String(nudgeRateDeg[3], 3) + ",";
  json += "\"safeDecLimitEnabled\":false,";
  json += "\"safeDecMinDeg\":" + String(safeDecMinDeg, 3) + ",";
  json += "\"safeDecMaxDeg\":" + String(safeDecMaxDeg, 3) + ",";
  json += "\"safeAltLimitEnabled\":" + String(safeAltLimitEnabled ? "true" : "false") + ",";
  json += "\"safeAltMinDeg\":" + String(safeAltMinDeg, 3) + ",";
  json += "\"safeAltMaxDeg\":" + String(safeAltMaxDeg, 3) + ",";
  json += "\"basicStatusText\":\"" + jsonEscape(basicStatusText()) + "\",";
  json += "\"basicSystemText\":\"" + jsonEscape(basicSystemHealthText()) + "\",";
  json += "\"statusText\":\"" + jsonEscape(st) + "\",";
  json += "\"uptime\":\"" + jsonEscape(formatUptime()) + "\",";
  json += "\"cpuLoad\":\"" + jsonEscape(sampleWebCpuLoadText()) + "\",";
  json += "\"loopLatencyCurrentMs\":" + String(lastLoopLatencyMs) + ",";
  json += "\"loopLatencyMaxMs\":" + String(maxLoopLatencyMs) + ",";
  json += "\"pollSchedulerLatencyCurrentMs\":" + String(lastPollSchedulerLatencyMs) + ",";
  json += "\"pollSchedulerLatencyMaxMs\":" + String(maxPollSchedulerLatencyMs) + ",";
  json += "\"pollMissedDeadlineCount\":" + String(mountPollsMissedDeadline) + ",";
  json += "\"freeHeap\":" + String(ESP.getFreeHeap()) + ",";
  json += "\"systemText\":\"" + jsonEscape(sys) + "\"";
  json += "}";
  sendNoCacheHeaders();
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Connection", "close");
  server.send(200, "application/json", json);
}

void handleSetSiteTimePage() {
  if (server.hasArg("lat")) {
    siteLatitudeDeg = server.arg("lat").toFloat();
    siteValid = true;
  }

