gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  if (server.hasArg("lon")) {
    siteLongitudeDeg = server.arg("lon").toFloat();
    siteValid = true;
  }

  if (server.hasArg("elev")) {
    siteElevationMeters = server.arg("elev").toFloat();
  }

  if (server.hasArg("offset")) {
    utcOffsetMinutes = server.arg("offset").toInt();
    utcOffsetSource = "web/manual";
    timeValid = true;
    timeSetMillis = millis();
  }

  if (server.hasArg("poll")) {
    long p = server.arg("poll").toInt();
    if (p < 0) p = 0;
    if (p > 60000) p = 60000;
    pollIntervalMs = (unsigned long)p;
    resetMountPollScheduler();
    resetMountPollFailures();
  }
  if (server.hasArg("idlepoll")) {
    long p = server.arg("idlepoll").toInt();
    if (p < 0) p = 0;
    if (p > 60000) p = 60000;
    idlePollIntervalMs = (unsigned long)p;
    resetMountPollScheduler();
  }

  if (server.hasArg("throttle")) {
    long t = server.arg("throttle").toInt();
    if (t < 250) t = 250;
    if (t > 60000) t = 60000;
    minClientPollIntervalMs = (unsigned long)t;
  }

  computeAltAzFromRaDec();
  savePersistentSettings();
  LOG_TIME_I("Web site/poll update: lat=%.6f lon=%.6f offset=%d poll=%lu throttle=%lu",
       siteLatitudeDeg, siteLongitudeDeg, utcOffsetMinutes, pollIntervalMs, minClientPollIntervalMs);

  if (wantsAjax()) sendAjaxOK("Site/time/polling saved");
  else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}



void handleSetManualSiteTimePage() {
  logHttpRequest("SET_MANUAL_SITE_TIME");
  LOG_SET_I("Setup button pressed: Save Site / Time / Polling");
  if (server.hasArg("lat")) {
    siteLatitudeDeg = server.arg("lat").toFloat();
    siteValid = true;
  }
  if (server.hasArg("lon")) {
    siteLongitudeDeg = server.arg("lon").toFloat();
    siteValid = true;
  }
  if (server.hasArg("offset")) utcOffsetMinutes = server.arg("offset").toInt();
  if (server.hasArg("year")) localYear = server.arg("year").toInt();
  if (server.hasArg("month")) localMonth = server.arg("month").toInt();
  if (server.hasArg("day")) localDay = server.arg("day").toInt();
  if (server.hasArg("hour")) localHour = server.arg("hour").toInt();
  if (server.hasArg("minute")) localMinute = server.arg("minute").toInt();
  if (server.hasArg("second")) localSecond = server.arg("second").toInt();

  timeValid = true;
  markTimeSource(TIME_SRC_WEB);
  timeSetMillis = millis();

  if (server.hasArg("poll")) {
    long p = server.arg("poll").toInt();
    if (p < 0) p = 0;
    if (p > 60000) p = 60000;
    pollIntervalMs = (unsigned long)p;
    resetMountPollScheduler();
    resetMountPollFailures();
  }
  if (server.hasArg("idlepoll")) {
    long p = server.arg("idlepoll").toInt();
    if (p < 0) p = 0;
    if (p > 60000) p = 60000;
    idlePollIntervalMs = (unsigned long)p;
    resetMountPollScheduler();
  }
  if (server.hasArg("throttle")) {
    long t = server.arg("throttle").toInt();
    if (t < 250) t = 250;
    if (t > 60000) t = 60000;
    minClientPollIntervalMs = (unsigned long)t;
  }

  computeAltAzFromRaDec();
  bool savedOk = savePersistentSettings();
  LOGI("Manual site/time update: lat=%.6f lon=%.6f offset=%d date=%04d-%02d-%02d time=%02d:%02d:%02d poll=%lu throttle=%lu",
       siteLatitudeDeg, siteLongitudeDeg, utcOffsetMinutes,
       localYear, localMonth, localDay, localHour, localMinute, localSecond,
       pollIntervalMs, minClientPollIntervalMs);

  if (wantsAjax()) {
    if (savedOk) sendAjaxOK("Manual site/time saved");
    else sendAjaxFail("Manual site/time save failed");
  }
  else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}

void handleSetDeviceSiteTimePage() {
  bool gotLocation = false;

  if (server.hasArg("lat")) {
    siteLatitudeDeg = server.arg("lat").toFloat();
    gotLocation = true;
  }

  if (server.hasArg("lon")) {
    siteLongitudeDeg = server.arg("lon").toFloat();
    gotLocation = true;
  }

  if (gotLocation) {
    siteValid = true;
    markLocationSource("Browser HTTPS");
  }

  if (server.hasArg("elev")) siteElevationMeters = server.arg("elev").toFloat();

  if (server.hasArg("offset")) {
    utcOffsetMinutes = server.arg("offset").toInt();
    utcOffsetSource = "device/browser";
  }
  if (server.hasArg("year")) localYear = server.arg("year").toInt();
  if (server.hasArg("month")) localMonth = server.arg("month").toInt();
  if (server.hasArg("day")) localDay = server.arg("day").toInt();
  if (server.hasArg("hour")) localHour = server.arg("hour").toInt();
  if (server.hasArg("minute")) localMinute = server.arg("minute").toInt();
  if (server.hasArg("second")) localSecond = server.arg("second").toInt();

  timeValid = true;
  timeSetMillis = millis();

  if (server.hasArg("poll")) {
    long p = server.arg("poll").toInt();
    if (p < 0) p = 0;
    if (p > 60000) p = 60000;
    pollIntervalMs = (unsigned long)p;
    resetMountPollScheduler();
    resetMountPollFailures();
  }
  if (server.hasArg("idlepoll")) {
    long p = server.arg("idlepoll").toInt();
    if (p < 0) p = 0;
    if (p > 60000) p = 60000;
    idlePollIntervalMs = (unsigned long)p;
    resetMountPollScheduler();
  }

  if (server.hasArg("throttle")) {
    long t = server.arg("throttle").toInt();
    if (t < 250) t = 250;
    if (t > 60000) t = 60000;
    minClientPollIntervalMs = (unsigned long)t;
  }

  computeAltAzFromRaDec();
  savePersistentSettings();

  LOGI("Device site/time update: location=%s lat=%.6f lon=%.6f offset=%d date=%04d-%02d-%02d time=%02d:%02d:%02d poll=%lu throttle=%lu",
       gotLocation ? "yes" : "no",
       siteLatitudeDeg,
       siteLongitudeDeg,
       utcOffsetMinutes,
       localYear,
       localMonth,
       localDay,
       localHour,
       localMinute,
       localSecond,
       pollIntervalMs,
       minClientPollIntervalMs);

  if (gotLocation) sendAjaxOK("Device time and location saved");
  else sendAjaxOK("Device time saved; browser did not provide location");
}

uint16_t logCategoryBitFromName(const String &name) {
  if (name == "mount") return LOG_CAT_MOUNT;
  if (name == "skysafari" || name == "sky" || name == "safari" || name == "lx200") return LOG_CAT_SKYSAFARI;
  if (name == "bluetooth" || name == "bt") return LOG_CAT_BLUETOOTH;
  if (name == "alpaca") return LOG_CAT_ALPACA;
  if (name == "stellarium" || name == "stel") return LOG_CAT_STELLARIUM;
  if (name == "web" || name == "http") return LOG_CAT_WEB;
  if (name == "wifi" || name == "wi-fi" || name == "network") return LOG_CAT_WIFI;
  if (name == "timeloc" || name == "time_location" || name == "time" || name == "location" || name == "ntp") return LOG_CAT_TIMELOC;
  if (name == "settings" || name == "setting" || name == "config" || name == "setup" || name == "fs" || name == "littlefs") return LOG_CAT_SETTINGS;
  if (name == "system" || name == "sys" || name == "boot") return LOG_CAT_SYSTEM;
  return 0;
}


void handleSetupActionPage() {
  logHttpRequest("SETUP_ACTION");
  String name = server.hasArg("name") ? urlDecodeSimple(server.arg("name")) : "unknown";
  name.trim();
  LOG_SET_I("Setup button pressed: %s", name.c_str());

  if (wantsAjax()) sendAjaxOK("Setup action logged");
  else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}

void handleSetLogPage() {
  logHttpRequest("SET_LOG");
  if (server.hasArg("level")) {
    String lv = server.arg("level");
    lv.toLowerCase();
    int lvl = LOG_INFO;

    if (lv == "none" || lv == "0") lvl = LOG_NONE;
    else if (lv == "error" || lv == "err" || lv == "1") lvl = LOG_ERROR;
    else if (lv == "warn" || lv == "warning" || lv == "2") lvl = LOG_WARN;
    else if (lv == "info" || lv == "3") lvl = LOG_INFO;
    else if (lv == "debug" || lv == "4") lvl = LOG_DEBUG;
    else if (lv == "trace" || lv == "5") lvl = LOG_TRACE;
    else lvl = lv.toInt();

    if (lvl < 0) lvl = 0;
    if (lvl > 5) lvl = 5;
    LOG_LEVEL = lvl;
  }

