gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  // Optimistically update the displayed cache so the UI reflects the requested motion.
  if (altAzCacheValid) {
    cachedAlt_deg = clampAlt(cachedAlt_deg + altDelta);
    cachedAz_deg = normalizeAz(cachedAz_deg + azDelta);
    computeRaDecFromAltAz();
  }

  if (wantsAjax()) {
    sendAjaxOK("Nudge queued");
  } else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Nudge queued");
  }
}


void handleGetRaDecWebPage() {
  logHttpRequest("GET_RADEC_WEB");
  if (slewControllerPendingOrRunning()) {
    if (wantsAjax()) sendAjaxFail("Another mount command is already queued; RA/Dec read not queued");
    else {
      server.sendHeader("Location", "/");
      server.send(302, "text/plain", "Mount busy");
    }
    return;
  }

  queueAsyncRaDecRead();

  if (wantsAjax()) {
    sendAjaxOK("RA/Dec read queued");
  } else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "RA/Dec read queued");
  }
}

void handleGetAltAzWebPage() {
  logHttpRequest("GET_ALTAZ_WEB");
  if (slewControllerPendingOrRunning()) {
    if (wantsAjax()) sendAjaxFail("Another mount command is already queued; Alt/Az read not queued");
    else {
      server.sendHeader("Location", "/");
      server.send(302, "text/plain", "Mount busy");
    }
    return;
  }

  queueAsyncAltAzRead();

  if (wantsAjax()) {
    sendAjaxOK("Alt/Az read queued");
  } else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Alt/Az read queued");
  }
}

void handleWebGotoRaDecPage() {
  logHttpRequest("WEB_GOTO_RADEC");
  double raHours = server.hasArg("ra_hours") ? server.arg("ra_hours").toFloat() : 0.0;
  double decDeg = server.hasArg("dec_deg") ? server.arg("dec_deg").toFloat() : 0.0;
  double raDeg = normalizeRA(raHours * 15.0);
  LOG_MOUNT_D("Web RA/Dec GOTO request safety: dec=%.3f limitEnabled=%d min=%.3f max=%.3f", decDeg, safeDecLimitEnabled ? 1 : 0, safeDecMinDeg, safeDecMaxDeg);

  String safetyReason;
  if (!allowSlewRaDecBySafety(raDeg, decDeg, safetyReason)) {
    LOG_MOUNT_W("Web RA/Dec GOTO blocked: %s", safetyReason.c_str());
    if (wantsAjax()) sendAjaxFail(safetyReason);
    else server.send(400, "text/plain", safetyReason);
    return;
  }

  if (slewControllerPendingOrRunning()) {
    if (wantsAjax()) sendAjaxFail("Another mount command is already queued; GOTO not queued");
    else {
      server.sendHeader("Location", "/");
      server.send(302, "text/plain", "Mount busy");
    }
    return;
  }

  // Queue the RA/Dec GOTO and return immediately. Do NOT overwrite cached/current
  // position with the target here; the top banner must show actual/current
  // mount position, not the requested target.
  markPositionDemand("web RA/Dec GOTO");
  queueAsyncSlew(raDeg, decDeg);

  if (wantsAjax()) {
    sendAjaxOK("GOTO RA/Dec queued");
  } else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "GOTO RA/Dec queued");
  }
}

void handleWebGotoAltAzPage() {
  logHttpRequest("WEB_GOTO_ALTAZ");
  double altDeg = server.hasArg("alt_deg") ? server.arg("alt_deg").toFloat() : 0.0;
  double azDeg = server.hasArg("az_deg") ? server.arg("az_deg").toFloat() : 0.0;

  altDeg = clampAlt(altDeg);
  azDeg = normalizeAz(azDeg);

  String safetyReason;
  if (!allowSlewAltAzBySafety(altDeg, azDeg, safetyReason)) {
    LOG_MOUNT_W("Web Alt/Az GOTO blocked: %s", safetyReason.c_str());
    if (wantsAjax()) sendAjaxFail(safetyReason);
    else server.send(400, "text/plain", safetyReason);
    return;
  }

  if (slewControllerPendingOrRunning()) {
    if (wantsAjax()) sendAjaxFail("Another mount command is already queued; Alt/Az GOTO not queued");
    else {
      server.sendHeader("Location", "/");
      server.send(302, "text/plain", "Mount busy");
    }
    return;
  }

  // Queue the Alt/Az GOTO and return immediately. Do NOT overwrite cached/current
  // Alt/Az with the target here; the top banner must remain actual/current
  // position until the mount reports or the slew completes.
  markPositionDemand("web Alt/Az GOTO");
  queueAsyncAltAzSlew(altDeg, azDeg);

  if (wantsAjax()) {
    sendAjaxOK("GOTO Alt/Az queued");
  } else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "GOTO Alt/Az queued");
  }
}

void handleResetRatesPage() {
  logHttpRequest("RESET_RATES");
  LOG_SET_I("Setup button pressed: Reset Rate Defaults");
  nudgeRateDeg[0] = 0.10;
  nudgeRateDeg[1] = 0.25;
  nudgeRateDeg[2] = 0.50;
  nudgeRateDeg[3] = 1.00;
  lx200CurrentNudgeStepDeg = nudgeRateDeg[1];
  webSelectedRateIndex = 1;
  savePersistentSettings();

  if (wantsAjax()) sendAjaxOK("Rates reset");
  else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}










void handleClearSettingsPage() {
  logHttpRequest("CLEAR_SETTINGS");
  LOG_SET_I("Setup button pressed: Clear Saved Last Location");
  LOG_SET_D("Clearing saved last location/site/time settings");
  siteLatitudeDeg = 0.0;
  siteLongitudeDeg = 0.0;
  siteElevationMeters = 0.0;
  utcOffsetMinutes = 0;
  siteValid = false;
  timeValid = false;
  savePersistentSettings();

  if (wantsAjax()) sendAjaxOK("Saved last location cleared");
  else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}



void handleSetWiFiPage() {
  logHttpRequest("SET_WIFI");
  LOG_SET_I("Setup button pressed: Save / Connect STA WiFi");
  String ssid = server.hasArg("ssid") ? urlDecodeSimple(server.arg("ssid")) : "";
  String pass = server.hasArg("pass") ? urlDecodeSimple(server.arg("pass")) : "";

  ssid.trim();

  if (ssid.length() == 0) {
    if (wantsAjax()) sendAjaxFail("SSID is required");
    else server.send(400, "text/plain", "SSID is required");
    return;
  }

  LOG_WIFI_I("Web requested STA WiFi save/connect: ssid=%s", ssid.c_str());
  staRuntimeDisabled = false;
  if (!saveWiFiConfig(ssid, pass)) {
    if (wantsAjax()) sendAjaxFail("WiFi config save failed");
    else server.send(500, "text/plain", "WiFi config save failed");
    return;
  }

  if (bridgeMode == BRIDGE_MODE_BT_MIN_WEB) {
    staRuntimeDisabled = false;
    String apUrl = "http://" + apIp + "/";
    WiFi.mode(WIFI_STA);
    startFallbackAP();
    bool ok = connectConfiguredSTA();
    if (ok) {
      wifiModeText = "STA-only/AP-only + Bluetooth";
      saveLastStaIp(WiFi.localIP().toString());
    } else {
      wifiModeText = "AP only + Bluetooth";
    }
    String url = ok ? ("http://" + WiFi.localIP().toString() + "/") : apUrl;
    String msg = ok
      ? ("STA WiFi saved and connected at " + WiFi.localIP().toString() + ". Bluetooth remains enabled. Redirecting...")
      : ("STA WiFi saved, but connection failed: " + lastWifiStatus + ". Bluetooth remains enabled. AP fallback remains " + apUrl);

    if (wantsAjax()) {
      if (ok) sendAjaxRedirectOK(msg, url, 1500);
      else sendAjaxOK(msg);
    } else {
      String page;
      page.reserve(1900);
      page += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
      page += F("<title>NexStar WiFi Switch</title>");
      page += F("<style>body{font-family:Arial,sans-serif;background:#111;color:#eee;margin:20px}.box{border:1px solid #444;background:#1b1b1b;border-radius:8px;padding:14px;max-width:560px}a{color:#8cf}</style>");
      if (ok) {
        page += F("<script>setTimeout(function(){location.href='");
        page += url;
        page += F("'},1500);</script>");
      }
      page += F("</head><body><div class='box'><h2>Switching To STA WiFi</h2><p>");
      page += htmlEscape(msg);
      page += F("</p><p>STA target: <a href='");
      page += url;
      page += F("'>");
      page += url;
      page += F("</a></p><p>AP fallback: <a href='");
      page += apUrl;
      page += F("'>");
      page += apUrl;
      page += F("</a></p></div></body></html>");
      sendNoCacheHeaders();
      server.sendHeader("Connection", "close");
      server.send(200, "text/html", page);
    }
    return;
  }

  WiFi.mode(WIFI_STA);
  startFallbackAP();
  bool ok = connectConfiguredSTA();
  LOG_WIFI_I("STA WiFi connect after save result: %s ip=%s", ok ? "connected" : "failed", WiFi.localIP().toString().c_str());

  if (wantsAjax()) {
    if (ok) {
      String url = "http://" + WiFi.localIP().toString() + "/";
      sendAjaxRedirectOK("WiFi STA saved and connected: " + WiFi.localIP().toString() + ". Redirecting...", url, 1200);
    }
    else sendAjaxOK("WiFi STA saved, but connection failed: " + lastWifiStatus + ". AP fallback remains active.");
  } else {
    server.sendHeader("Location", ok ? ("http://" + WiFi.localIP().toString() + "/") : "/");
    server.send(302, "text/plain", "Redirecting");
  }
}


