gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
bool extractJsonNumber(const String &body, const String &key, double &out) {
  int k = body.indexOf("\"" + key + "\"");
  if (k < 0) return false;
  int colon = body.indexOf(':', k);
  if (colon < 0) return false;
  int start = colon + 1;
  while (start < (int)body.length() && (body[start] == ' ' || body[start] == '\t' || body[start] == '\r' || body[start] == '\n')) start++;
  int end = start;
  while (end < (int)body.length()) {
    char c = body[end];
    if (!((c >= '0' && c <= '9') || c == '-' || c == '+' || c == '.')) break;
    end++;
  }
  if (end <= start) return false;
  out = body.substring(start, end).toDouble();
  return true;
}

String extractJsonString(const String &body, const String &key) {
  int k = body.indexOf("\"" + key + "\"");
  if (k < 0) return "";
  int colon = body.indexOf(':', k);
  if (colon < 0) return "";
  int q1 = body.indexOf('"', colon + 1);
  if (q1 < 0) return "";
  int q2 = body.indexOf('"', q1 + 1);
  if (q2 < 0) return "";
  return body.substring(q1 + 1, q2);
}

bool fetchApproxLocationFromInternet() {
  approxIpLocationValid = false;

  if (!staConnected || WiFi.status() != WL_CONNECTED) {
    approxIpLocationStatus = "STA WiFi is not connected";
    LOG_TIME_W("IP geolocation failed: STA WiFi is not connected");
    return false;
  }

#if defined(ESP8266)
  WiFiClient client;
  HTTPClient http;
  bool beginOk = http.begin(client, "http://ip-api.com/json/?fields=status,message,lat,lon,city,regionName,country,query");
#else
  HTTPClient http;
  bool beginOk = http.begin("http://ip-api.com/json/?fields=status,message,lat,lon,city,regionName,country,query");
#endif

  if (!beginOk) {
    approxIpLocationStatus = "HTTP begin failed";
    LOG_TIME_W("IP geolocation failed: HTTP begin failed");
    return false;
  }

  http.setTimeout(7000);
  int code = http.GET();
  if (code != 200) {
    approxIpLocationStatus = "HTTP error " + String(code);
    LOG_TIME_W("IP geolocation failed: HTTP code %d", code);
    http.end();
    return false;
  }

  String body = http.getString();
  http.end();

  if (body.indexOf("\"status\":\"success\"") < 0) {
    String msg = extractJsonString(body, "message");
    approxIpLocationStatus = "Service failed" + (msg.length() ? ": " + msg : "");
    LOG_TIME_W("IP geolocation service failed: %s", approxIpLocationStatus.c_str());
    return false;
  }

  double lat = 0.0;
  double lon = 0.0;
  if (!extractJsonNumber(body, "lat", lat) || !extractJsonNumber(body, "lon", lon)) {
    approxIpLocationStatus = "No lat/lon in response";
    LOG_TIME_W("IP geolocation failed: no lat/lon in response");
    return false;
  }

  approxIpLatitudeDeg = lat;
  approxIpLongitudeDeg = lon;
  String city = extractJsonString(body, "city");
  String region = extractJsonString(body, "regionName");
  String country = extractJsonString(body, "country");
  String ip = extractJsonString(body, "query");

  approxIpLocationText = city;
  if (region.length()) approxIpLocationText += (approxIpLocationText.length() ? ", " : "") + region;
  if (country.length()) approxIpLocationText += (approxIpLocationText.length() ? ", " : "") + country;
  if (ip.length()) approxIpLocationText += " IP " + ip;

  approxIpLocationStatus = "Approx IP location fetched";
  approxIpLocationValid = true;

  LOG_TIME_I("IP geolocation approximate location: lat=%.6f lon=%.6f %s",
       approxIpLatitudeDeg, approxIpLongitudeDeg, approxIpLocationText.c_str());
  return true;
}


void handleFetchIpLocationPage() {
  logHttpRequest("FETCH_IP_LOCATION");
  LOG_SET_I("Setup button pressed: Get Approx Internet Location");
  LOG_TIME_I("Web requested approximate internet location fetch");
  bool ok = fetchApproxLocationFromInternet();

  String msg;
  if (ok) {
    msg = "Approx location fetched: " + String(approxIpLatitudeDeg, 6) + ", " + String(approxIpLongitudeDeg, 6);
    if (approxIpLocationText.length()) msg += " (" + approxIpLocationText + ")";
  } else {
    msg = approxIpLocationStatus;
  }

  if (wantsAjax()) {
    if (ok) sendAjaxOK(msg);
    else sendAjaxFail(msg);
  } else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}

void handleUseIpLocationPage() {
  logHttpRequest("USE_IP_LOCATION");
  LOG_SET_I("Setup button pressed: Use Approx Internet Location");
  LOG_TIME_I("Web requested use of approximate IP location");
  if (!approxIpLocationValid) {
    if (wantsAjax()) sendAjaxFail("No approximate IP location has been fetched yet");
    else server.send(400, "text/plain", "No approximate IP location has been fetched yet");
    return;
  }

  siteLatitudeDeg = approxIpLatitudeDeg;
  siteLongitudeDeg = approxIpLongitudeDeg;
  siteValid = true;
  markLocationSource("IP Approx");
  computeAltAzFromRaDec();
  bool savedOk = savePersistentSettings();
  LOG_TIME_I("Approx IP location applied from web: lat=%.6f lon=%.6f save=%s", siteLatitudeDeg, siteLongitudeDeg, savedOk ? "ok" : "failed");

  String msg = "Approx IP location applied: " + String(siteLatitudeDeg, 6) + ", " + String(siteLongitudeDeg, 6);
  if (wantsAjax()) {
    if (savedOk) sendAjaxOK(msg);
    else sendAjaxFail("Approx IP location applied but save failed");
  } else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}

void handleSetNtpPage() {
  logHttpRequest("SET_NTP");
  LOG_SET_I("Setup button pressed: Save NTP Settings");
  bool newEnabled = server.hasArg("enabled") && server.arg("enabled") == "1";
  String s1 = server.hasArg("server1") ? urlDecodeSimple(server.arg("server1")) : String(ntpServer1);
  String s2 = server.hasArg("server2") ? urlDecodeSimple(server.arg("server2")) : String(ntpServer2);
  String tz = server.hasArg("tz") ? urlDecodeSimple(server.arg("tz")) : String(tzRule);

  s1.trim(); s2.trim(); tz.trim();
  if (s1.length() == 0) s1 = "pool.ntp.org";
  if (s2.length() == 0) s2 = "time.nist.gov";
  if (tz.length() == 0) tz = "MST7MDT,M3.2.0/2,M11.1.0/2";

  ntpEnabled = newEnabled;
  strlcpy(ntpServer1, s1.c_str(), sizeof(ntpServer1));
  strlcpy(ntpServer2, s2.c_str(), sizeof(ntpServer2));
  strlcpy(tzRule, tz.c_str(), sizeof(tzRule));

  LOG_TIME_I("Web NTP settings save requested: enabled=%d server1=%s server2=%s tz=%s", ntpEnabled ? 1 : 0, ntpServer1, ntpServer2, tzRule);
  bool saveOk = savePersistentSettings();
  LOG_SET_I("NTP settings persistent save: %s", saveOk ? "ok" : "failed");
  LOG_TIME_D("NTP settings changed in RAM: enabled=%d server1=%s server2=%s tz=%s save=%s", ntpEnabled ? 1 : 0, ntpServer1, ntpServer2, tzRule, saveOk ? "ok" : "failed");
  bool syncOk = false;
  if (ntpEnabled && staConnected && WiFi.status() == WL_CONNECTED) syncOk = syncTimeFromNTP(true);

  String msg = "NTP settings saved";
  if (ntpEnabled) {
    msg += syncOk ? " and synced" : " (waiting for STA/internet sync)";
  } else {
    msg += " (disabled)";
  }

  if (wantsAjax()) {
    if (saveOk) sendAjaxOK(msg);
    else sendAjaxFail("NTP settings save failed");
  } else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}

void handleSyncNtpPage() {
  logHttpRequest("SYNC_NTP");
  LOG_SET_I("Setup button pressed: Sync NTP Now");
  LOG_TIME_I("Web NTP Sync Now button pressed");
  LOG_TIME_T("NTP button context: ntpEnabled=%d staConnected=%d wifiStatus=%d staIp=%s",
             ntpEnabled ? 1 : 0,
             (staConnected && WiFi.status() == WL_CONNECTED) ? 1 : 0,
             (int)WiFi.status(),
             WiFi.localIP().toString().c_str());

