gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  if (!ntpEnabled) {
    LOG_TIME_W("NTP Sync Now failed: NTP is disabled");
    if (wantsAjax()) sendAjaxFail("NTP is disabled");
    else server.send(400, "text/plain", "NTP is disabled");
    return;
  }

  if (!staConnected || WiFi.status() != WL_CONNECTED) {
    LOG_TIME_W("NTP Sync Now failed: STA WiFi is not connected");
    if (wantsAjax()) sendAjaxFail("STA WiFi is not connected");
    else server.send(400, "text/plain", "STA WiFi is not connected");
    return;
  }

  bool ok = syncTimeFromNTP(true);
  LOG_TIME_I("NTP Sync Now result: %s", ok ? "success" : "failed");

  if (wantsAjax()) {
    if (ok) sendAjaxOK("NTP sync successful");
    else sendAjaxFail("NTP sync failed");
  } else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}


void handleSetApPage() {
  logHttpRequest("SET_AP");
  LOG_SET_I("Setup button pressed: Save AP / Server Config");
  String ssid = server.hasArg("ap_ssid") ? urlDecodeSimple(server.arg("ap_ssid")) : apSsid;
  String pass = server.hasArg("ap_pass") ? urlDecodeSimple(server.arg("ap_pass")) : apPass;
  String newApIp = server.hasArg("ap_ip") ? urlDecodeSimple(server.arg("ap_ip")) : apIp;
  uint16_t newAlpacaPort = 11111;
  uint16_t newLx200Port = server.hasArg("lx200_port") ? server.arg("lx200_port").toInt() : LX200_PORT;
  uint16_t newStellariumPort = server.hasArg("stellarium_port") ? server.arg("stellarium_port").toInt() : STELLARIUM_PORT;
  uint16_t newTelnetPort = server.hasArg("telnet_port") ? server.arg("telnet_port").toInt() : TELNET_PORT;
  String newTelnetPass = server.hasArg("telnet_pass") ? urlDecodeSimple(server.arg("telnet_pass")) : telnetPassword;

  ssid.trim();
  pass.trim();
  newApIp.trim();
  newTelnetPass.trim();

  IPAddress testIp;
  if (ssid.length() < 1 || ssid.length() > 32) {
    if (wantsAjax()) sendAjaxFail("AP SSID must be 1..32 chars");
    else server.send(400, "text/plain", "AP SSID must be 1..32 chars");
    return;
  }
  if (pass.length() > 0 && pass.length() < 8) {
    if (wantsAjax()) sendAjaxFail("AP password must be blank/open or at least 8 chars");
    else server.send(400, "text/plain", "AP password must be blank/open or at least 8 chars");
    return;
  }
  if (!parseIpAddress(newApIp, testIp)) {
    if (wantsAjax()) sendAjaxFail("AP fallback IP is invalid");
    else server.send(400, "text/plain", "AP fallback IP is invalid");
    return;
  }
  if ((newAlpacaPort != 80 && newAlpacaPort < 1024) || newLx200Port < 1024 || newStellariumPort < 1024 || newTelnetPort < 1) {
    if (wantsAjax()) sendAjaxFail("HTTP port must be 80 or 1024..65535; LX200/Stellarium must be 1024..65535; Telnet must be 1..65535");
    else server.send(400, "text/plain", "HTTP port must be 80 or 1024..65535; LX200/Stellarium must be 1024..65535; Telnet must be 1..65535");
    return;
  }
  if (HTTP_WEB_PORT == newAlpacaPort || HTTP_WEB_PORT == newLx200Port || HTTP_WEB_PORT == newStellariumPort || HTTP_WEB_PORT == newTelnetPort ||
      newAlpacaPort == newLx200Port || newAlpacaPort == newStellariumPort || newAlpacaPort == newTelnetPort ||
      newLx200Port == newStellariumPort || newLx200Port == newTelnetPort || newStellariumPort == newTelnetPort) {
    if (wantsAjax()) sendAjaxFail("Web, Alpaca, LX200, Stellarium, and Telnet ports must be different");
    else server.send(400, "text/plain", "Web, Alpaca, LX200, Stellarium, and Telnet ports must be different");
    return;
  }

  bool portsChanged = (newAlpacaPort != ALPACA_PORT || newLx200Port != LX200_PORT || newStellariumPort != STELLARIUM_PORT || newTelnetPort != TELNET_PORT);

  apSsid = ssid;
  apPass = pass;
  apIp = newApIp;
  ALPACA_PORT = newAlpacaPort;
  LX200_PORT = newLx200Port;
  STELLARIUM_PORT = newStellariumPort;
  TELNET_PORT = newTelnetPort;
  telnetPassword = newTelnetPass;
  if (bridgeMode == BRIDGE_MODE_BT_MIN_WEB) staRuntimeDisabled = true;

  bool saveOk = savePersistentSettings();
  LOG_SET_I("AP/server settings changed: apSsid=%s apIp=%s lx200Port=%u stellariumPort=%u portsChanged=%d staPreserved=%d save=%s", apSsid.c_str(), apIp.c_str(), LX200_PORT, STELLARIUM_PORT, portsChanged ? 1 : 0, staConfigured ? 1 : 0, saveOk ? "ok" : "failed");

  // Do not touch the WiFi/BT radio from this request in Bluetooth mode. On this
  // ESP32, STA+AP -> AP-only transitions while Classic BT is active can hard
  // wedge the radio/serial stack, even when delayed until after the response.
  // Save the AP-only preference and let the next external reset/power cycle
  // apply it through the direct WIFI_AP boot path.
  if (saveOk) {
    if (bridgeMode == BRIDGE_MODE_BT_MIN_WEB) {
      staRuntimeDisabled = true;
      wifiModeText = "AP only + Bluetooth pending reset";
      lastWifiStatus = "AP-only mode saved; reset or power-cycle to apply safely";
    } else {
      scheduleRestart(portsChanged ? "server/AP config change" : "AP config change");
    }
  }

  String returnUrl = "http://" + apIp + "/";
  if (server.hasArg("return")) {
    returnUrl = cleanGpsReturnUrl(urlDecodeSimple(server.arg("return")));
  }

  if (wantsAjax()) {
    if (saveOk) {
      String url = returnUrl;
      String msg = (bridgeMode == BRIDGE_MODE_BT_MIN_WEB)
        ? "AP settings saved. STA WiFi settings preserved. Reset or power-cycle the ESP32 to enter AP-only Bluetooth mode safely."
        : "AP/server settings saved. STA WiFi settings preserved. Device will restart shortly. Redirecting...";
      if (bridgeMode == BRIDGE_MODE_BT_MIN_WEB) sendAjaxOK(msg);
      else sendAjaxRedirectOK(msg, url, 4500);
    } else {
      sendAjaxFail("AP/server settings save failed");
    }
  } else {
    server.sendHeader("Location", saveOk ? returnUrl : "/");
    server.send(302, "text/plain", "Redirecting");
  }
}

void handleClearWiFiPage() {
  logHttpRequest("CLEAR_WIFI");
  LOG_SET_I("Setup button pressed: Reset WiFi To AP Only");
  clearWiFiConfig();
  WiFi.disconnect(true);
  WiFi.mode(WIFI_STA);
  startFallbackAP();
  wifiModeText = "AP";
  lastWifiStatus = "WiFi config cleared; AP fallback active";

  if (wantsAjax()) sendAjaxOK("WiFi config cleared; AP fallback active");
  else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}

void handleClearLogsPage() {
  LOG_WEB_I("Web requested clear logs");
  for (int i = 0; i < LOG_BUFFER_LINES; i++) logBuffer[i] = "";
  logWriteIndex = 0;
  logWrapped = false;
  logAlertActive = false;
  logAlertText = "";
  logAlertMs = 0;

  if (wantsAjax()) sendAjaxOK("Logs cleared");
  else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}

void handleClearLogAlertPage() {
  logAlertActive = false;
  logAlertText = "";
  logAlertMs = 0;

