gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  if (wantsAjax()) sendAjaxOK("Log alert cleared");
  else {
    server.sendHeader("Location", "/");
    server.send(302, "text/plain", "Redirecting");
  }
}

bool isRoutinePollPath(const String &path) {
  return path == "/status" || path == "/logs" || path == "/status_text" || path == "/sys_text";
}

void logHttpRequest(const char* where) {
  String path = server.uri();
  currentWebRequestPath = path.c_str();

  bool alpacaPath = path.startsWith("/management") || path.startsWith("/api/");
  if (alpacaPath) alpacaHttpRequests++;
  uint16_t catMask = alpacaPath ? LOG_CAT_ALPACA : LOG_CAT_WEB;
  if (LOG_LEVEL < LOG_DEBUG) return;
  if ((LOG_SUBSYSTEM_MASK & catMask) == 0) return;

  const char* method =
    server.method() == HTTP_GET ? "GET" :
    server.method() == HTTP_PUT ? "PUT" :
    server.method() == HTTP_POST ? "POST" :
    server.method() == HTTP_OPTIONS ? "OPTIONS" : "OTHER";

  bool routine = isRoutinePollPath(path);

  if (!routine || LOG_LEVEL >= LOG_TRACE) {
    String js = server.hasArg("js") ? server.arg("js") : "";
    if (alpacaPath) {
      LOG_ALP_D("%s HTTP %s path=%s args=%d", where, method, path.c_str(), server.args());
    } else if (routine) {
      LOG_WEB_T("%s HTTP %s path=%s args=%d", where, method, path.c_str(), server.args());
    } else if (js.length()) {
      LOG_WEB_D("%s HTTP %s path=%s js=%s args=%d", where, method, path.c_str(), js.c_str(), server.args());
    } else {
      LOG_WEB_D("%s HTTP %s path=%s args=%d", where, method, path.c_str(), server.args());
    }
  }

  // Only trace query args for non-Alpaca web requests to avoid heap churn during Alpaca discovery/client probing.
  if (!alpacaPath && LOG_LEVEL >= LOG_TRACE) {
    for (uint8_t i = 0; i < server.args(); i++) {
      String n = server.argName(i);
      String v = server.arg(i);
      if (n.indexOf("pass") >= 0 || n.indexOf("password") >= 0) v = "<hidden>";
      LOG_WEB_T("  arg[%u] %s=%s", i, n.c_str(), v.c_str());
    }
  }
}

void handleMountTestPage() {
  String s;
  s.reserve(1200);
  s += "Mount serial test " + String(FW_VERSION) + "\n";
  s += "Board: " + String(BOARD_NAME) + "\n";
  s += "ESP32 mount RX GPIO: " + String(MOUNT_RX_PIN) + "\n";
  s += "ESP32 mount TX GPIO: " + String(MOUNT_TX_PIN) + "\n";
  s += "Baud: " + String(MOUNT_BAUD) + "\n";
  s += "Test: send '?' and wait for '#'\n\n";

  int drained = 0;
  while (mountRawAvailable()) {
    int d = mountReadRawByte();
    drained++;
    s += "Drained before test: 0x" + String(d, HEX);
    if (d >= 32 && d <= 126) {
      s += " '";
      s += (char)d;
      s += "'";
    }
    s += "\n";
  }
  if (drained == 0) s += "No pre-existing serial bytes to drain.\n";

  Serial.println("[MOUNT_TEST] sending '?' handshake on UART2");
  mountWriteRawByte((uint8_t)'?');
  mountFlush();

  unsigned long start = millis();
  int got = -1;
  while (millis() - start < 1500) {
    if (mountRawAvailable()) {
      got = mountReadRawByte();
      break;
    }
    delay(1);
    yield();
  }

  if (got < 0) {
    s += "\nResult: NO RESPONSE within 1500 ms\n";
    Serial.println("[MOUNT_TEST] no response");
  } else {
    char c = (got >= 32 && got <= 126) ? (char)got : '.';
    s += "\nResult byte: 0x" + String(got, HEX) + " '";
    s += c;
    s += "'\n";
    s += (got == '#') ? "Handshake: OK\n" : "Handshake: FAILED, expected '#'\n";
    Serial.printf("[MOUNT_TEST] got 0x%02X '%c'\n", got, c);
  }

  s += "\nWiring check:\n";
  s += "ESP32 GPIO17 TX -> level converter TTL RX\n";
  s += "ESP32 GPIO16 RX <- level converter TTL TX\n";
  s += "Converter RS232 side -> NexStar hand controller serial port\n";
  s += "Common ground required on TTL side.\n";
  s += "\nIf result is 0x3F '?', ESP32 is likely reading back its own transmitted byte or TX/RX/level path is wrong.\n";

  sendNoCacheHeaders();
  server.sendHeader("Connection", "close");
  server.send(200, "text/plain", s);
}

void handleHttpsSetupRedirectPage() {
  String target = String("https://") + WiFi.softAPIP().toString() + "/";
  if (WiFi.status() == WL_CONNECTED && !requestCameFromApSubnet()) {
    target = String("https://") + WiFi.localIP().toString() + "/";
  }
  target += "?return=" + urlEncodeSimple(cleanGpsReturnUrl(gpsSyncReturnUrl));
  sendNoCacheHeaders();
  server.sendHeader("Connection", "close");
  server.sendHeader("Location", target);
  server.send(302, "text/plain", "Redirecting to HTTPS GPS Sync");
}


String urlEncodeSimple(const String &s) {
  String out;
  out.reserve(s.length() * 3);
  const char *hex = "0123456789ABCDEF";
  for (size_t i = 0; i < s.length(); i++) {
    uint8_t c = (uint8_t)s[i];
    if ((c >= 'A' && c <= 'Z') ||
        (c >= 'a' && c <= 'z') ||
        (c >= '0' && c <= '9') ||
        c == '-' || c == '_' || c == '.' || c == '~') {
      out += (char)c;
    } else {
      out += '%';
      out += hex[(c >> 4) & 0x0F];
      out += hex[c & 0x0F];
    }
  }
  return out;
}

String cleanGpsReturnUrl(const String &raw) {
  String r = raw;
  r.trim();
  if (!r.startsWith("http://")) return String("http://") + WiFi.softAPIP().toString() + "/";
  int scheme = r.indexOf("://");
  int start = (scheme >= 0) ? scheme + 3 : 0;
  int slash = r.indexOf('/', start);
  if (slash < 0) return r + "/";
  String base = r.substring(0, slash + 1);
  return base;
}

String gpsReturnUrlWithCacheBuster() {
  String r = cleanGpsReturnUrl(gpsSyncReturnUrl);
  r += "?gpssync_done=";
  r += String(millis());
  return r;
}

void scheduleHttpsSetupStop(unsigned long delayMs) {
  if (httpsSetupServerHandle) {
    httpsSetupStopAtMillis = millis() + delayMs;
  }
}

void serviceHttpsSetupStop() {
  if (httpsSetupServerHandle && httpsSetupStopAtMillis != 0 && (long)(millis() - httpsSetupStopAtMillis) >= 0) {
    httpd_handle_t h = httpsSetupServerHandle;
    httpsSetupServerHandle = NULL;
    httpsSetupStopAtMillis = 0;
    Serial.println("[HTTPS] stopping GPS Sync HTTPS server after completed sync");
    httpd_ssl_stop(h);
  }
}


void handleStartHttpsPage() {
#if defined(ESP32)
  if (server.hasArg("return")) {
    String r = urlDecodeSimple(server.arg("return"));
    if (r.startsWith("http://")) gpsSyncReturnUrl = cleanGpsReturnUrl(r);
  }

  startHttpsSetupServer();

  String target = String("https://") + WiFi.softAPIP().toString() + "/";
  if (WiFi.status() == WL_CONNECTED && !requestCameFromApSubnet()) {
    target = String("https://") + WiFi.localIP().toString() + "/";
  }
  target += "?return=" + urlEncodeSimple(cleanGpsReturnUrl(gpsSyncReturnUrl));

