gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  sendNoCacheHeaders();
  server.sendHeader("Connection", "close");

  if (server.hasArg("json")) {
    if (httpsSetupServerHandle) {
      String json = "{\"ok\":true,\"url\":\"" + target + "\"}";
      server.send(200, "application/json", json);
    } else {
      server.send(500, "application/json", "{\"ok\":false,\"error\":\"HTTPS GPS Sync server failed to start\"}");
    }
  } else {
    if (httpsSetupServerHandle) server.send(200, "text/plain", target);
    else server.send(500, "text/plain", "HTTPS GPS Sync server failed to start");
  }
#else
  sendNoCacheHeaders();
  server.sendHeader("Connection", "close");
  if (server.hasArg("json")) server.send(501, "application/json", "{\"ok\":false,\"error\":\"HTTPS only available on ESP32\"}");
  else server.send(501, "text/plain", "HTTPS only available on ESP32");
#endif
}

void handleHttpHealthPage() {
  String s;
  s.reserve(500);
  s += String(FW_NAME) + " " + String(FW_VERSION) + " HTTP health OK\n";
  s += "Bridge mode: " + String(bridgeModeName()) + "\n";
  s += "Web UI HTTP port: " + String(HTTP_WEB_PORT) + "\n";
  s += "Alpaca HTTP port: " + String(bridgeMode == BRIDGE_MODE_WIFI_FULL ? ALPACA_PORT : 0) + "\n";
  s += "AP IP: " + WiFi.softAPIP().toString() + "\n";
  s += "STA IP: " + WiFi.localIP().toString() + "\n";
  s += "Bluetooth SkySafari: " + String(bluetoothRuntimeEnabled ? "enabled" : "disabled") + "\n";
  s += "Coex preference: " + coexPreferenceText + " result=" + String(coexPreferenceResult) + "\n";
  s += "HTTPS port: " + String(HTTPS_SETUP_PORT) + "\n";
  sendNoCacheHeaders();
  server.sendHeader("Connection", "close");
  server.send(200, "text/plain", s);
}

void handleTimeLocationStatusPage() {
  String s;
  s.reserve(1200);
  s += "Time / Location status " + String(FW_VERSION) + "\n";
  s += "Time valid: " + String(timeValid ? "true" : "false") + "\n";
  s += "Time source: " + String(timeSourceName(currentTimeSource)) + "\n";
  s += "UTC offset minutes: " + String(utcOffsetMinutes) + "\n";
  s += "UTC offset source: " + utcOffsetSource + "\n";
  s += "Local date: " + String(localYear) + "-";
  if (localMonth < 10) s += "0";
  s += String(localMonth) + "-";
  if (localDay < 10) s += "0";
  s += String(localDay) + "\n";
  s += "Local time: ";
  if (localHour < 10) s += "0";
  s += String(localHour) + ":";
  if (localMinute < 10) s += "0";
  s += String(localMinute) + ":";
  if (localSecond < 10) s += "0";
  s += String(localSecond) + "\n";
  s += "Site valid: " + String(siteValid ? "true" : "false") + "\n";
  s += "Location source: " + currentLocationSource + "\n";
  s += "Latitude: " + String(siteLatitudeDeg, 6) + "\n";
  s += "Longitude: " + String(siteLongitudeDeg, 6) + "\n";
  sendNoCacheHeaders();
  server.sendHeader("Connection", "close");
  server.send(200, "text/plain", s);
}

bool browserTimeLocationEstablished() {
  return timeValid && siteValid;
}

bool requestCameFromApSubnet() {
#if defined(ESP32)
  if (!apRunning) return false;
  IPAddress rip = server.client().remoteIP();
  IPAddress ap = WiFi.softAPIP();
  return rip[0] == ap[0] && rip[1] == ap[1] && rip[2] == ap[2];
#else
  return false;
#endif
}

String currentTimezoneAbbrev() {
  if (utcOffsetMinutes == -420) return "MST";
  if (utcOffsetMinutes == -360) return "MDT";
  int off = utcOffsetMinutes;
  char sign = '+';
  if (off < 0) {
    sign = '-';
    off = -off;
  }
  char buf[12];
  snprintf(buf, sizeof(buf), "UTC%c%02d:%02d", sign, off / 60, off % 60);
  return String(buf);
}

void redirectToHttpsSetup443() {
#if defined(ESP32)
  String target = String("https://") + WiFi.softAPIP().toString() + "/";
  server.sendHeader("Location", target);
  server.send(302, "text/plain", "Redirecting to secure browser time/location setup");
#else
  sendWebPage();
#endif
}

void sendMinimalWebPage() {
  bool btConn = false;
#if HAS_CLASSIC_BT
  btConn = bluetoothRuntimeEnabled && SerialBT.hasClient();
#endif
  String page;
  page.reserve(4200);
  page += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
  page += F("<meta http-equiv='Cache-Control' content='no-store'><title>NexStar Minimal</title>");
  page += F("<style>body{font-family:Arial,sans-serif;background:#111;color:#eee;margin:14px}button,input,.btn{font-size:1em;margin:4px;padding:8px}input{width:190px;max-width:95%}.btn,button{display:inline-block;border:1px solid #666;background:#333;color:#eee;border-radius:4px;text-decoration:none}.box{border:1px solid #444;background:#1b1b1b;border-radius:8px;padding:10px;margin:10px 0}.ok{color:#8cff8c}.warn{color:#ffd36b}.bad{color:#ff8888}pre{white-space:pre-wrap;background:#000;color:#0f0;padding:8px;border-radius:6px}</style>");
  page += F("<script>async function upd(){try{let r=await fetch('/btstatus?t='+Date.now(),{cache:'no-store'}),j=await r.json();");
  page += F("let bt=j.bluetoothConnected?'connected':(j.bluetoothEnabled?'waiting':'disabled'),bc=j.bluetoothConnected?'ok':(j.bluetoothEnabled?'warn':'bad');");
  page += F("function t(id,v){let e=document.getElementById(id);if(e)e.textContent=v}function c(id,v){let e=document.getElementById(id);if(e)e.className=v}");
  page += F("t('m',j.bridgeMode||'?');t('bt',bt);c('bt',bc);t('ap',j.apIp||'?');t('sta',j.staConnected?(j.staIp||'?'):'not connected');");
  page += F("t('mnt',j.mountCommFault?'fault':(j.mountBusy?'busy':'ready'));t('mountUptime',(j.mountUptime||'0:00')+' h:mm');t('cnt',(j.lx200BtRxCommands||0)+' / '+(j.lx200BtTxReplies||0));");
  page += F("t('time',j.timeValid?('set '+(j.timeSource||'')):('not set'));t('loc',(j.siteValid?((j.locationSource||'set')+' '+Number(j.latitude).toFixed(6)+', '+Number(j.longitude).toFixed(6)):'not set'));t('lastcmd',j.lx200BtLastCommand||'none');t('lastrsp',j.lx200BtLastReply||'none');t('lastbad',j.lx200BtLastUnhandled||'none');");
  page += F("t('pollms',j.pollIntervalMs===0?'off':((j.pollIntervalMs||0)+' ms'));let p=document.getElementById('poll');if(p&&document.activeElement!==p)p.value=j.pollIntervalMs||0;");
  page += F("t('live','live '+new Date().toLocaleTimeString());}catch(e){t('live','status update failed')}}setInterval(upd,8000);window.addEventListener('load',upd);</script>");
  page += F("</head><body><h2>");
  page += FW_NAME;
  page += F(" ");
  page += FW_VERSION;
  page += F("</h2><div class='box'><b>Mode:</b> <span id='m'>");
  page += bridgeModeName();
  page += F("</span><br><b>Bluetooth SkySafari:</b> <span id='bt' class='");
  page += btConn ? F("ok'>connected") : (bluetoothRuntimeEnabled ? F("warn'>waiting") : F("bad'>disabled"));
  page += F("</span><br><b>BT name:</b> ");
  page += runtimeBtName();
  page += F("<br><b>AP:</b> <span id='ap'>");
  page += WiFi.softAPIP().toString();
  page += F("</span><br><b>STA:</b> <span id='sta'>");
  page += (staConnected ? WiFi.localIP().toString() : String("not connected"));
  page += F("</span><br><b>Mount:</b> <span id='mnt'>");
  page += mountCommFault ? F("fault") : (mountBusy ? F("busy") : F("ready"));
  page += F("</span><br><b>Mount uptime:</b> <span id='mountUptime'>");
  page += htmlEscape(formatMountUptime());
  page += F(" h:mm");
  page += F("</span><br><b>SkySafari BT RX/TX:</b> <span id='cnt'>");
  page += String(lx200BtRxCommands);
  page += F(" / ");
  page += String(lx200BtTxReplies);
  page += F("</span><br><b>Time:</b> <span id='time'>");
  page += timeValid ? String("set ") + timeSourceName(currentTimeSource) : String("not set");
  page += F("</span><br><b>Location:</b> <span id='loc'>");
  if (siteValid) {
    page += htmlEscape(currentLocationSource);
    page += F(" ");
    page += String(siteLatitudeDeg, 6);
    page += F(", ");
    page += String(siteLongitudeDeg, 6);
  } else {
    page += F("not set");
  }
  page += F("</span><br><b>Last BT RX:</b> <span id='lastcmd'>");
  page += htmlEscape(lx200BtLastCommand.length() ? lx200BtLastCommand : String("none"));
  page += F("</span><br><b>Last BT TX:</b> <span id='lastrsp'>");
  page += htmlEscape(lx200BtLastReply.length() ? lx200BtLastReply : String("none"));
  page += F("</span><br><b>Last unsupported:</b> <span id='lastbad'>");
  page += htmlEscape(lx200BtLastUnhandled.length() ? lx200BtLastUnhandled : String("none"));
  page += F("</span><br><b>Mount poll:</b> <span id='pollms'>");
  page += pollIntervalMs == 0 ? String("off") : String(pollIntervalMs) + " ms";
  page += F("</span><br><span id='live' class='small'>loading live status...</span></div><div class='box'><a class='btn' href='/mode?radio=wifi'>WiFi</a>");
  page += F("<button onclick=\"location.reload()\">Refresh</button></div>");
  page += F("<div class='box'><h3>Status</h3>");
  page += F("Time: ");
  if (timeValid) {
    int yy, mo, dd, hh, mi, ss;
    currentLocalParts(yy, mo, dd, hh, mi, ss);
    page += String(yy) + "-";
    if (mo < 10) page += "0";
    page += String(mo) + "-";
    if (dd < 10) page += "0";
    page += String(dd) + " ";
    if (hh < 10) page += "0";
    page += String(hh) + ":";
    if (mi < 10) page += "0";
    page += String(mi);
    page += " ";
    page += currentTimezoneAbbrev();
    page += " from ";
    page += timeSourceName(currentTimeSource);
  } else {
    page += F("not set");
  }
  page += F("<br>Location: ");
  if (siteValid) {
    page += String(siteLatitudeDeg, 5);
    page += F(", ");
    page += String(siteLongitudeDeg, 5);
    page += F(" from ");
    page += htmlEscape(currentLocationSource);
  } else {
    page += F("not set");
  }
  page += F("<br>Mount serial: ");
  page += mountCommFault ? F("fault") : F("ok");
  page += F("</div></body></html>");
  sendNoCacheHeaders();
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", "");
  const size_t chunkSize = 512;
  for (size_t i = 0; i < page.length(); i += chunkSize) {
    server.sendContent(page.substring(i, i + chunkSize));
    delay(1);
    yield();
  }
  server.sendContent("");
}

void handleRoot() {
  logHttpRequest("ROOT");
  // v3.30 recovery: port 80 must always answer with the normal UI.
  // HTTPS experiments stay separate and must not break HTTP reachability.
  if (bridgeMode == BRIDGE_MODE_BT_MIN_WEB) sendMinimalWebPage();
  else sendWebPage();
}

void handleManagementApiVersions() {
  logHttpRequest("MGMT apiversions");
  sendJson("{\"Value\":[1]}");
}

void handleManagementDescription() {
  logHttpRequest("MGMT description");
  sendJson("{\"ServerName\":\"Portable NexStar Bridge\",\"Manufacturer\":\"Local\",\"ManufacturerVersion\":\"1.07-utc-offset-fix\",\"Location\":\"Local network\"}");
}

