gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
void handleConfiguredDevices() {
  logHttpRequest("MGMT configureddevices");
  sendJson("{\"Value\":[{\"DeviceName\":\"Original NexStar 8\",\"DeviceType\":\"Telescope\",\"DeviceNumber\":0,\"UniqueID\":\"portable-nexstar-0\"}]}");
}

void handleOptions() {
  logHttpRequest("OPTIONS");
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET,PUT,POST,OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
  server.send(204);
}

void handleTelescopeGet(const String &action) {
  LOG_ALP_I("Alpaca GET action=%s", action.c_str());

  if (action == "rightascension" || action == "declination" ||
      action == "altitude" || action == "azimuth") {
    markPositionDemand("Alpaca position GET");
  }

  serviceMountPolling();

  if (action == "name") sendAlpacaValue("\"Original NexStar 8\"");
  else if (action == "description") sendAlpacaValue("\"Portable ESP8266/ESP32/ESP32-S2 bridge for original NexStar serial protocol\"");
  else if (action == "driverinfo") sendAlpacaValue("\"Alpaca plus LX200 WiFi/Bluetooth SkySafari bridge with cached polling\"");
  else if (action == "driverversion") sendAlpacaValue("\"1.07-utc-offset-fix\"");
  else if (action == "interfaceversion") sendAlpacaValue("3");
  else if (action == "connected") sendAlpacaValue(alpacaConnected ? "true" : "false");
  else if (action == "supportedactions") sendAlpacaValue("[]");

  else if (action == "rightascension") sendAlpacaValue(String(cachedRA_deg / 15.0, 8));
  else if (action == "declination") sendAlpacaValue(String(cachedDec_deg, 8));

  else if (action == "altitude") {
    double alt, az;
    getAltAz(alt, az, false);
    sendAlpacaValue(String(cachedAlt_deg, 8));
  }

  else if (action == "azimuth") {
    double alt, az;
    getAltAz(alt, az, false);
    sendAlpacaValue(String(cachedAz_deg, 8));
  }

  else if (action == "targetrightascension") sendAlpacaValue(String(targetRA_deg / 15.0, 8));
  else if (action == "targetdeclination") sendAlpacaValue(String(targetDec_deg, 8));
  else if (action == "destinationrightascension") sendAlpacaValue(String(targetRA_deg / 15.0, 8));
  else if (action == "destinationdeclination") sendAlpacaValue(String(targetDec_deg, 8));
  else if (action == "slewing") sendAlpacaValue(slewControllerBusy() ? "true" : "false");

  else if (action == "tracking") sendAlpacaValue("true");
  else if (action == "canslew") sendAlpacaValue("true");
  else if (action == "canslewasync") sendAlpacaValue("true");
  else if (action == "canslewaltaz") sendAlpacaValue("true");
  else if (action == "canslewaltazasync") sendAlpacaValue("false");
  else if (action == "cansync") sendAlpacaValue("false");
  else if (action == "cansyncaltaz") sendAlpacaValue("false");
  else if (action == "canpark") sendAlpacaValue("false");
  else if (action == "canunpark") sendAlpacaValue("false");
  else if (action == "canfindhome") sendAlpacaValue("false");
  else if (action == "canmoveaxis") sendAlpacaValue("true");
  else if (action == "canpulseguide") sendAlpacaValue("false");
  else if (action == "cansettracking") sendAlpacaValue("false");
  else if (action == "cansetrightascensionrate") sendAlpacaValue("false");
  else if (action == "cansetdeclinationrate") sendAlpacaValue("false");
  else if (action == "alignmentmode") sendAlpacaValue("0");
  else if (action == "equatorialsystem") sendAlpacaValue("1");
  else if (action == "athome") sendAlpacaValue("false");
  else if (action == "atpark") sendAlpacaValue("false");
  else if (action == "pierside") sendAlpacaValue("0");
  else if (action == "siteelevation") sendAlpacaValue(String(siteElevationMeters, 2));
  else if (action == "sitelatitude") sendAlpacaValue(String(siteLatitudeDeg, 8));
  else if (action == "sitelongitude") sendAlpacaValue(String(siteLongitudeDeg, 8));
  else if (action == "declinationrate") sendAlpacaValue("0");
  else if (action == "rightascensionrate") sendAlpacaValue("0");
  else if (action == "doesrefraction") sendAlpacaValue("false");
  else if (action == "siderealtime") sendAlpacaValue(String(normalizeRA(gmstDegrees() + siteLongitudeDeg) / 15.0, 8));
  else if (action == "utcdate") sendAlpacaValue("\"" + currentUtcIsoString() + "\"");
  else if (action == "trackingrates") sendAlpacaValue("[]");
  else if (action == "axisrates") sendAlpacaValue("[{\"Minimum\":-4.0,\"Maximum\":4.0}]");
  else sendAlpacaError(1024, "GET action not implemented: " + action);
}

bool parseAlpacaUtcDate(const String &raw) {
  if (raw.length() < 19) return false;

  int y = raw.substring(0, 4).toInt();
  int mo = raw.substring(5, 7).toInt();
  int d = raw.substring(8, 10).toInt();
  int h = raw.substring(11, 13).toInt();
  int mi = raw.substring(14, 16).toInt();
  int se = raw.substring(17, 19).toInt();

  if (y < 2000 || mo < 1 || mo > 12 || d < 1 || d > 31 || h < 0 || h > 23 || mi < 0 || mi > 59 || se < 0 || se > 60) return false;

  pendingLocalYear = y;
  pendingLocalMonth = mo;
  pendingLocalDay = d;
  pendingLocalHour = h;
  pendingLocalMinute = mi;
  pendingLocalSecond = se;
  pendingUtcDateSet = true;
  pendingSiteTimeUpdate = true;
  return true;
}

void applyPendingSiteTimeUpdate() {
  if (!pendingSiteTimeUpdate) return;

  if (pendingSiteLatitudeSet) {
    siteLatitudeDeg = pendingSiteLatitudeDeg;
    siteValid = true;
  }
  if (pendingSiteLongitudeSet) {
    siteLongitudeDeg = pendingSiteLongitudeDeg;
    siteValid = true;
  }
  if (pendingSiteElevationSet) {
    siteElevationMeters = pendingSiteElevationMeters;
  }
  if (pendingUtcDateSet) {
    int offsetToUse = utcOffsetMinutes;

    // Alpaca UTCDate is UTC and does not include the local UTC offset.
    // If we have site longitude and no better offset has been supplied, estimate
    // the standard time-zone offset from longitude so the status page is useful.
    if (offsetToUse == 0 && (pendingSiteLongitudeSet || siteValid)) {
      double lonForOffset = pendingSiteLongitudeSet ? pendingSiteLongitudeDeg : siteLongitudeDeg;
      offsetToUse = estimateUtcOffsetMinutesFromLongitude(lonForOffset);
      utcOffsetSource = "Alpaca UTCDate + longitude estimate";
    } else if (utcOffsetSource == "unset") {
      utcOffsetSource = "Alpaca UTCDate as UTC";
    }

    utcOffsetMinutes = offsetToUse;
    setLocalFromUtcWithOffset(
      pendingLocalYear, pendingLocalMonth, pendingLocalDay,
      pendingLocalHour, pendingLocalMinute, pendingLocalSecond,
      utcOffsetMinutes
    );
    timeSetMillis = millis();
    timeValid = true;
  }

  pendingSiteLatitudeSet = false;
  pendingSiteLongitudeSet = false;
  pendingSiteElevationSet = false;
  pendingUtcDateSet = false;
  pendingSiteTimeUpdate = false;

  invalidateComputedAltAz();
  if (cacheValid && siteValid && timeValid) computeAltAzFromRaDec();

  savePersistentSettings();
  LOGI("Applied pending Alpaca site/time: siteValid=%d timeValid=%d lat=%.6f lon=%.6f elev=%.2f",
       siteValid, timeValid, siteLatitudeDeg, siteLongitudeDeg, siteElevationMeters);
}

void handleTelescopePut(const String &action) {
  LOGI("Alpaca PUT action=%s args=%d", action.c_str(), server.args());
  if (action == "sitelatitude" || action == "sitelongitude" || action == "siteelevation" || action == "utcdate") {
    for (uint8_t i = 0; i < server.args(); i++) {
      LOGI("  Alpaca arg[%u] %s=%s", i, server.argName(i).c_str(), server.arg(i).c_str());
    }
  }

  const uint32_t minAlpacaPutHeap =
#if defined(ESP8266)
    4500;
#else
    20000;
#endif
  if (ESP.getFreeHeap() < minAlpacaPutHeap) {
    LOGW("Low memory before Alpaca PUT: freeHeap=%u min=%u", ESP.getFreeHeap(), minAlpacaPutHeap);
    sendAlpacaError(1035, "Low memory; request deferred");
    return;
  }

  if (action == "connected") {
    String v = alpacaPutValue("Connected");
    alpacaConnected = !(v == "false" || v == "False" || v == "0");
    sendAlpacaOK();
    return;
  }

  if (action == "sitelatitude" || action == "latitude") {
    String v = alpacaPutValue("SiteLatitude");
    if (v.length() == 0) v = alpacaPutValue("Latitude");
    double parsed = 0.0;
    if (!safeFloatValue(v, parsed) || parsed < -90.0 || parsed > 90.0) {
      sendAlpacaError(1025, "Invalid SiteLatitude value");
      return;
    }
    pendingSiteLatitudeDeg = parsed;
    pendingSiteLatitudeSet = true;
    pendingSiteTimeUpdate = true;
    LOGI("Alpaca RECEIVED SiteLatitude %.6f", parsed);
    sendAlpacaOK();
    return;
  }

  if (action == "sitelongitude" || action == "longitude") {
    String v = alpacaPutValue("SiteLongitude");
    if (v.length() == 0) v = alpacaPutValue("Longitude");
    double parsed = 0.0;
    if (!safeFloatValue(v, parsed) || parsed < -180.0 || parsed > 180.0) {
      sendAlpacaError(1025, "Invalid SiteLongitude value");
      return;
    }
    pendingSiteLongitudeDeg = parsed;
    pendingSiteLongitudeSet = true;
    pendingSiteTimeUpdate = true;
    LOGI("Alpaca RECEIVED SiteLongitude %.6f east-positive", parsed);
    sendAlpacaOK();
    return;
  }

  if (action == "siteelevation" || action == "elevation") {
    String v = alpacaPutValue("SiteElevation");
    if (v.length() == 0) v = alpacaPutValue("Elevation");
    double parsed = 0.0;
    if (!safeFloatValue(v, parsed) || parsed < -500.0 || parsed > 10000.0) {
      sendAlpacaError(1025, "Invalid SiteElevation value");
      return;
    }
    pendingSiteElevationMeters = parsed;
    pendingSiteElevationSet = true;
    pendingSiteTimeUpdate = true;
    LOGI("Alpaca RECEIVED SiteElevation %.2f m", parsed);
    sendAlpacaOK();
    return;
  }

  if (action == "utcdate") {
    String v = alpacaPutValue("UTCDate");
    if (v.length() == 0 || v.length() > 32) {
      sendAlpacaError(1025, "Invalid UTCDate value");
      return;
    }
    if (!parseAlpacaUtcDate(v)) {
      sendAlpacaError(1025, "Invalid UTCDate format");
      return;
    }
    LOGI("Alpaca RECEIVED UTCDate %s", v.c_str());
    sendAlpacaOK();
    return;
  }

  if (action == "targetrightascension") {
    targetRA_deg = normalizeRA(alpacaPutValue("TargetRightAscension").toFloat() * 15.0);
    sendAlpacaOK();
    return;
  }

  if (action == "targetdeclination") {
    targetDec_deg = alpacaPutValue("TargetDeclination").toFloat();
    sendAlpacaOK();
    return;
  }

  if (action == "slewtocoordinates" || action == "slewtocoordinatesasync") {
    double raDeg = alpacaPutValue("RightAscension").toFloat() * 15.0;
    double decDeg = alpacaPutValue("Declination").toFloat();
    if (mountCommandPathBusy()) {
      enqueueGotoRaDec(raDeg, decDeg, LX_SRC_WIFI, "Alpaca SlewToCoordinates while mount busy");
    } else {
      queueAsyncSlew(raDeg, decDeg);
    }
    markGotoQueueImmediateAck("Alpaca", "SlewToCoordinates accepted");
    sendAlpacaOK();
    return;
  }

  if (action == "slewtotarget" || action == "slewtotargetasync") {
    if (mountCommandPathBusy()) {
      enqueueGotoRaDec(targetRA_deg, targetDec_deg, LX_SRC_WIFI, "Alpaca SlewToTarget while mount busy");
    } else {
      queueAsyncSlew(targetRA_deg, targetDec_deg);
    }
    markGotoQueueImmediateAck("Alpaca", "SlewToTarget accepted");
    sendAlpacaOK();
    return;
  }

  if (action == "slewtoaltaz" || action == "slewtoaltazasync") {
    double altDeg = alpacaPutValue("Altitude").toFloat();
    double azDeg = alpacaPutValue("Azimuth").toFloat();
    if (mountCommandPathBusy()) {
      enqueueGotoAltAz(altDeg, azDeg, LX_SRC_WIFI, "Alpaca SlewToAltAz while mount busy");
    } else {
      queueAsyncAltAzSlew(altDeg, azDeg);
    }
    markGotoQueueImmediateAck("Alpaca", "SlewToAltAz accepted");
    sendAlpacaOK();
    return;
  }

  if (action == "moveaxis") {
    bool ok = nudgeAxis(alpacaPutValue("Axis").toInt(), alpacaPutValue("Rate").toFloat());
    if (ok) sendAlpacaOK();
    else sendAlpacaError(1035, "MoveAxis nudge failed");
    return;
  }

  if (action == "abortslew") {
    sendAlpacaError(1024, "AbortSlew is not supported by this original NexStar protocol");
    return;
  }

  sendAlpacaError(1024, "PUT action not implemented: " + action);
}

void handleWebNotFound() {
  logHttpRequest("WEB_NOT_FOUND");
  server.send(404, "text/plain", "Not found on Web UI port. Alpaca API is on port " + String(ALPACA_PORT));
}

