gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
void handleNotFound() {
  logHttpRequest("REQ");

  String path = server.uri();

  if (server.method() == HTTP_OPTIONS) {
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.sendHeader("Access-Control-Allow-Methods", "GET,PUT,POST,OPTIONS");
    server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
    server.send(204);
    return;
  }

  if (path == "/management/apiversions") {
    handleManagementApiVersions();
    return;
  }

  if (path == "/management/v1/description") {
    handleManagementDescription();
    return;
  }

  if (path == "/management/v1/configureddevices") {
    handleConfiguredDevices();
    return;
  }

  String prefix0 = "/api/v1/telescope/0/";
  String prefixMinus1 = "/api/v1/telescope/-1/";
  String action = "";

  if (path.startsWith(prefix0)) action = path.substring(prefix0.length());
  else if (path.startsWith(prefixMinus1)) action = path.substring(prefixMinus1.length());

  if (action.length() > 0) {
    action.toLowerCase();
    if (server.method() == HTTP_GET) handleTelescopeGet(action);
    else if (server.method() == HTTP_PUT || server.method() == HTTP_POST) handleTelescopePut(action);
    else sendAlpacaError(1024, "Unsupported HTTP method");
    return;
  }

  server.send(404, "application/json", "{\"Error\":\"Not found\"}");
}

void handleAlpacaDiscovery() {
  int packetSize = discoveryUdp.parsePacket();
  if (!packetSize) return;

  char packet[96];
  int len = discoveryUdp.read(packet, sizeof(packet) - 1);
  if (len < 0) len = 0;
  packet[len] = 0;

  IPAddress remoteIp = discoveryUdp.remoteIP();
  uint16_t remotePort = discoveryUdp.remotePort();

  String response = "{\"AlpacaPort\":";
  response += String(ALPACA_PORT);
  response += "}";

  discoveryUdp.beginPacket(remoteIp, remotePort);
  discoveryUdp.write((const uint8_t*)response.c_str(), response.length());
  discoveryUdp.endPacket();

  LOGI("Alpaca discovery response sent to %s:%u", remoteIp.toString().c_str(), remotePort);
}



String consoleLogMaskNames(uint16_t mask) {
  if (mask == 0) return "none";
  if ((mask & LOG_CAT_ALL) == LOG_CAT_ALL) return "all";

  String s = "";
  if (mask & LOG_CAT_MOUNT)      s += "mount,";
  if (mask & LOG_CAT_SKYSAFARI)  s += "skysafari,";
  if (mask & LOG_CAT_BLUETOOTH)  s += "bluetooth,";
  if (mask & LOG_CAT_ALPACA)     s += "alpaca,";
  if (mask & LOG_CAT_STELLARIUM) s += "stellarium,";
  if (mask & LOG_CAT_WEB)        s += "web,";
  if (mask & LOG_CAT_WIFI)       s += "wifi,";
  if (mask & LOG_CAT_TIMELOC)    s += "time_location,";
  if (mask & LOG_CAT_SETTINGS)   s += "settings,";
  if (mask & LOG_CAT_SYSTEM)     s += "system,";
  if (s.endsWith(",")) s.remove(s.length() - 1);
  return s.length() ? s : "none";
}

void printConsoleLogStatus() {
  Serial.println("Log status:");
  Serial.printf("  level: %d (%s)\n", LOG_LEVEL, logLevelName(LOG_LEVEL));
  Serial.printf("  system mask: 0x%04X\n", LOG_SUBSYSTEM_MASK);
  Serial.print("  systems: ");
  Serial.println(consoleLogMaskNames(LOG_SUBSYSTEM_MASK));
}


uint16_t consoleLogMaskFromList(String cats) {
  cats.trim();
  cats.toLowerCase();
  cats.replace(",", " ");
  cats.replace(";", " ");
  cats.replace("|", " ");
  cats.replace("+", " ");

  if (cats == "all") return LOG_CAT_ALL;
  if (cats == "none" || cats == "off" || cats.length() == 0) return 0;

  uint16_t mask = 0;
  int start = 0;
  while (start < (int)cats.length()) {
    while (start < (int)cats.length() && cats.charAt(start) == ' ') start++;
    if (start >= (int)cats.length()) break;

    int sp = cats.indexOf(' ', start);
    String part = sp >= 0 ? cats.substring(start, sp) : cats.substring(start);
    part.trim();

    if (part == "bt") part = "bluetooth";
    else if (part == "sky") part = "skysafari";
    else if (part == "safari") part = "skysafari";
    else if (part == "time") part = "time_location";
    else if (part == "timeloc") part = "time_location";
    else if (part == "location") part = "time_location";
    else if (part == "config") part = "settings";
    else if (part == "setup") part = "settings";
    else if (part == "wifi") part = "wifi";
    else if (part == "wi-fi") part = "wifi";

    uint16_t bit = logCategoryBitFromName(part);
    if (bit == 0 && part.length() > 0) {
      Serial.print("[console] unknown log system ignored: ");
      Serial.println(part);
    }
    mask |= bit;

    if (sp < 0) break;
    start = sp + 1;
  }
  return mask;
}

void printHelpLog() {
  Serial.println();
  Serial.println("=== Logging Commands ===");
  Serial.println("  log");
  Serial.println("      Show the current log level, subsystem mask, and enabled subsystems.");
  Serial.println("  log <0..5>");
  Serial.println("      Set log level:");
  Serial.println("        0 none   Disable stored/streamed firmware log output.");
  Serial.println("        1 error  Only failures that usually need action.");
  Serial.println("        2 warn   Errors plus abnormal/retry/fallback conditions.");
  Serial.println("        3 info   Normal high-level events: clients, saves, connect/disconnect.");
  Serial.println("        4 debug  Detailed decisions and state changes for troubleshooting.");
  Serial.println("        5 trace  Very chatty low-level flow; use briefly, can flood logs.");
  Serial.println("  log <0..5> [systems]");
  Serial.println("      Set log level and one or more subsystems separated by spaces or commas.");
  Serial.println("      Systems: all, none, mount, skysafari, bluetooth, wifi, web, alpaca,");
  Serial.println("               stellarium, time_location, settings, system");
  Serial.println("      Aliases: bt=bluetooth, sky/lx200=skysafari, time/location/ntp=time_location,");
  Serial.println("               config/setup/littlefs=settings, sys=system");
  Serial.println("      Examples: log 3 system   |   log 4 mount bluetooth   |   log 5 mount,skysafari");
  Serial.println("      SkySafari position-poll traffic is intentionally suppressed to prevent log flooding.");
}

void printHelpMode() {
  Serial.println();
  Serial.println("=== Mode and Runtime Commands ===");
  Serial.println("  modebt | modebt_web");
  Serial.println("      Save BT mode with the small BT web interface enabled, then reboot.");
  Serial.println("  modebt_telnet | modebt_noweb | modebt_telnetonly");
  Serial.println("      Save BT Telnet-only mode with the small web interface disabled, then reboot.");
  Serial.println("  modewifi");
  Serial.println("      Save Full WiFi mode, then reboot.");
  Serial.println("  web | web status | webserver | webserver status");
  Serial.println("      Show the BT web-server runtime state.");
  Serial.println("  web on | web off | web toggle");
  Serial.println("      Change the BT web-server runtime state. This is not saved across reboot.");
  Serial.println("  wifi | wifi status");
  Serial.println("      Show WiFi runtime, AP/STA connection, and IP information.");
  Serial.println("  wifi on | wifi off | wifi toggle");
  Serial.println("      Change WiFi runtime state. In BT mode, Bluetooth remains active when WiFi is off.");
  Serial.println("  reboot | restart");
  Serial.println("      Restart the controller immediately.");
}

void printHelpWifi() {
  Serial.println();
  Serial.println("=== WiFi Configuration Commands ===");
  Serial.println("  setsta <ssid> <password>");
  Serial.println("      Save STA credentials and immediately attempt a connection.");
  Serial.println("      SSIDs and passwords containing spaces are not supported by this console command.");
  Serial.println("  apdefault");
  Serial.println("      Restore AP SSID, password, and IP defaults, then restart the AP.");
  Serial.println("  wifi | wifi status");
  Serial.println("      Show current WiFi and IP status.");
  Serial.println("  wifi on | wifi off | wifi toggle");
  Serial.println("      Enable, disable, or toggle WiFi at runtime.");
  Serial.println("      Use the Full WiFi Setup page for complete STA and AP configuration.");
}

void printHelpMount() {
  Serial.println();
  Serial.println("=== Mount and Polling Commands ===");
  Serial.println("  testinit");
  Serial.println("      Test the NexStar '?' handshake and safe E-command payload read.");
  Serial.println("  get");
  Serial.println("      Query and print current RA/Dec.");
  Serial.println("  getaltaz");
  Serial.println("      Query and print current Alt/Az.");
  Serial.println("  pos | current_state | currentstate | state");
  Serial.println("      Print cached telescope coordinates and current bridge state.");
  Serial.println("  rates");
  Serial.println("      Show all four nudge rates, mount poll interval, and client-poll throttle.");
  Serial.println("  mountpoll | mountpoll <ms>");
  Serial.println("      Get or set the active mount poll interval. 0 turns it off.");
  Serial.println("  nudge az+ | nudge az- | nudge alt+ | nudge alt-");
  Serial.println("      Perform one relative Alt/Az nudge using nudge-rate slot 2.");
  Serial.println("  drain");
  Serial.println("      Drain and print pending bytes from the mount serial input.");
}

