gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
void printHelpStatus() {
  Serial.println();
  Serial.println("=== Status and Diagnostics Commands ===");
  Serial.println("  status");
  Serial.println("      Show firmware, mode, network, clients, GOTO queue, heap, loop latency,");
  Serial.println("      poll scheduler timing, and mount communication status.");
  Serial.println("  current_state | currentstate | state | pos");
  Serial.println("      Show current cached telescope coordinates and operational state.");
  Serial.println("  system_health | systemhealth | health");
  Serial.println("      Show system-health counters, loop and poll latency, memory, uptime, and errors.");
  Serial.println("  tasks");
  Serial.println("      Show FreeRTOS runtime task stats if enabled in the build.");
  Serial.println("  gpio_startup | gpiostartup | startup_pins");
  Serial.println("      Show startup mode-pin readings and the selected boot-mode source.");
  Serial.println("  telnet | telnet status");
  Serial.println("      Show Telnet port, connection, authentication, and command counters.");
}

void printHelpTopic(const String &topicRaw) {
  String topic = topicRaw;
  topic.trim();
  topic.toLowerCase();

  if (topic == "mount" || topic == "scope" || topic == "nexstar") {
    printHelpMount();
  } else if (topic == "mode" || topic == "boot" || topic == "runtime" || topic == "radio") {
    printHelpMode();
  } else if (topic == "wifi" || topic == "network") {
    printHelpWifi();
  } else if (topic == "log" || topic == "logging" || topic == "logs") {
    printHelpLog();
  } else if (topic == "web" || topic == "webserver") {
    Serial.println();
    Serial.println("=== Web Server Command ===");
    Serial.println("  web | web status | webserver | webserver status");
    Serial.println("      Show the BT web-server runtime state.");
    Serial.println("  web on | web off | web toggle");
    Serial.println("      Enable, disable, or toggle the BT web server for this boot only.");
  } else if (topic == "reboot" || topic == "restart") {
    Serial.println();
    Serial.println("=== Reboot Command ===");
    Serial.println("  reboot | restart");
    Serial.println("      Restart the controller immediately.");
  } else if (topic == "testinit") {
    Serial.println();
    Serial.println("=== testinit ===");
    Serial.println("  testinit");
    Serial.println("      Test the NexStar '?' handshake and safe E-command payload read.");
  } else if (topic == "get") {
    Serial.println();
    Serial.println("=== get ===");
    Serial.println("  get");
    Serial.println("      Query the mount and print current RA/Dec.");
  } else if (topic == "getaltaz") {
    Serial.println();
    Serial.println("=== getaltaz ===");
    Serial.println("  getaltaz");
    Serial.println("      Query the mount and print current Alt/Az.");
  } else if (topic == "rates" || topic == "poll" || topic == "mountpoll") {
    Serial.println();
    Serial.println("=== Mount Poll / Rates ===");
    Serial.println("  rates");
    Serial.println("      Show all four nudge rates, mount poll interval, and client-poll throttle.");
    Serial.println("  mountpoll | mountpoll <ms>");
    Serial.println("      Get or set the active mount poll interval. 0 turns it off.");
  } else if (topic == "nudge") {
    Serial.println();
    Serial.println("=== nudge ===");
    Serial.println("  nudge az+ | nudge az- | nudge alt+ | nudge alt-");
    Serial.println("      Perform one relative Alt/Az nudge using nudge-rate slot 2.");
  } else if (topic == "drain") {
    Serial.println();
    Serial.println("=== drain ===");
    Serial.println("  drain");
    Serial.println("      Drain and print pending bytes from the mount serial input.");
  } else if (topic == "pos" || topic == "state" || topic == "current_state" || topic == "currentstate") {
    Serial.println();
    Serial.println("=== Current State Command ===");
    Serial.println("  current_state | currentstate | state | pos");
    Serial.println("      Show cached telescope coordinates and current bridge state.");
  } else if (topic == "health" || topic == "system_health" || topic == "systemhealth") {
    Serial.println();
    Serial.println("=== System Health Command ===");
    Serial.println("  system_health | systemhealth | health");
    Serial.println("      Show counters, loop and poll latency, memory, uptime, and errors.");
  } else if (topic == "tasks") {
    Serial.println();
    Serial.println("=== tasks ===");
    Serial.println("  tasks");
    Serial.println("      Show FreeRTOS cumulative per-task runtime stats if enabled in this build.");
    Serial.println("      Serial is one-shot. Telnet can refresh in place: tasks [seconds|millisecondsms].");
    Serial.println("      Fields: Task=name, Abs Time=cumulative CPU ticks, % Time=CPU share since boot.");
    Serial.println("      Telnet CPU Load is interval load from IDLE0/IDLE1 deltas; first sample shows --%.");
    Serial.println("      Common tasks:");
    Serial.println("        IDLE0/IDLE1 idle tasks for core 0/1; high values mean spare CPU.");
    Serial.println("        tiT TCP/IP stack; Tmr Svc FreeRTOS software timers.");
    Serial.println("        ipc0/ipc1 inter-core calls; esp_timer high-resolution timer callbacks.");
    Serial.println("        wifi WiFi driver; sys_evt ESP system events; arduino_events Arduino events.");
  } else if (topic == "gpio" || topic == "gpio_startup" || topic == "gpiostartup" || topic == "startup_pins") {
    Serial.println();
    Serial.println("=== Startup GPIO Command ===");
    Serial.println("  gpio_startup | gpiostartup | startup_pins");
    Serial.println("      Show startup mode-pin readings and selected boot-mode source.");
  } else if (topic == "telnet") {
    Serial.println();
    Serial.println("=== Telnet Status Command ===");
    Serial.println("  telnet | telnet status");
    Serial.println("      Show Telnet port, connection, authentication, and command counters.");
  } else if (topic == "telnetlog") {
    Serial.println();
    Serial.println("=== telnetlog ===");
    Serial.println("  telnetlog");
    Serial.println("      Show whether log lines are streamed to the Telnet terminal.");
    Serial.println("  telnetlog 0");
    Serial.println("      Turn off log streaming to the Telnet terminal.");
    Serial.println("  telnetlog 1");
    Serial.println("      Turn on log streaming to the Telnet terminal.");
  } else if (topic == "idlepoll") {
    Serial.println();
    Serial.println("=== idlepoll ===");
    Serial.println("  idlepoll | poll idle");
    Serial.println("      Show idle poll interval and effective poll interval.");
    Serial.println("  idlepoll <ms> | poll idle <ms>");
    Serial.println("      Set and save idle poll interval from 0 through 60000 ms.");
  } else if (topic == "setsta" || topic == "sta") {
    Serial.println();
    Serial.println("=== setsta ===");
    Serial.println("  setsta <ssid> <password>");
    Serial.println("      Save STA credentials and immediately attempt a connection.");
    Serial.println("      Spaces in SSID or password are not supported by this command.");
  } else if (topic == "apdefault" || topic == "ap") {
    Serial.println();
    Serial.println("=== apdefault ===");
    Serial.println("  apdefault");
    Serial.println("      Restore AP SSID, password, and IP defaults, then restart the AP.");
  } else {
    Serial.print("Unknown help topic: ");
    Serial.println(topicRaw);
    Serial.println("Grouped topics: mount, mode, wifi");
    Serial.println("Specific topics: log, web, reboot, testinit, get, getaltaz, rates, mountpoll, nudge,");
    Serial.println("                 idlepoll, drain, pos, health, tasks, gpio, telnet,");
    Serial.println("                 telnetlog, setsta, apdefault");
  }
}

void printHelp() {
  Serial.println();
  Serial.printf("%s %s commands\n", FW_NAME, FW_VERSION);
  Serial.println("Help:");
  Serial.println("  help | ? | help mount | help mode | help wifi | help <command>");
  Serial.println("Status:");
  Serial.println("  status");
  Serial.println("  current_state | currentstate | state | pos");
  Serial.println("  system_health | systemhealth | health");
  Serial.println("  tasks");
  Serial.println("  gpio_startup | gpiostartup | startup_pins");
  Serial.println("  telnet | telnet status");
  Serial.println("  telnetlog");
  Serial.println("Mount:");
  Serial.println("  testinit | get | getaltaz | rates | drain");
  Serial.println("  mountpoll | mountpoll <ms>");
  Serial.println("  idlepoll | idlepoll <ms> | poll idle <ms>");
  Serial.println("  nudge az+ | nudge az- | nudge alt+ | nudge alt-");
  Serial.println("Mode:");
  Serial.println("  modebt | modebt_web");
  Serial.println("  modebt_telnet | modebt_noweb | modebt_telnetonly");
  Serial.println("  modewifi");
  Serial.println("  web [status|on|off|toggle]");
  Serial.println("  webserver [status|on|off|toggle]");
  Serial.println("  wifi [status|on|off|toggle]");
  Serial.println("  reboot | restart");
  Serial.println("Config:");
  Serial.println("  setsta <ssid> <password>");
  Serial.println("  apdefault");
  Serial.println("  telnetlog 0 | telnetlog 1");
  Serial.println("  log | log <0..5> [systems]");
}


void printConsoleStatus() {
  Serial.println();
  Serial.printf("Firmware: %s %s\n", FW_NAME, FW_VERSION);
  Serial.printf("Bridge mode: %s\n", bridgeModeName());
  Serial.printf("Startup mode source: %s\n", startupModeSource.c_str());
  Serial.printf("Startup mode pin used: %d\n", startupModePinUsed);
  Serial.printf("WiFi mode: %s\n", wifiModeText.c_str());
  Serial.printf("WiFi radio active: %d\n", bridgeMode == BRIDGE_MODE_WIFI_FULL ? 1 : 0);
  Serial.printf("WiFi status: %s\n", lastWifiStatus.c_str());
  Serial.printf("AP SSID: %s\n", apSsid.c_str());
  Serial.printf("AP IP: %s\n", WiFi.softAPIP().toString().c_str());
  Serial.printf("STA configured: %d\n", staConfigured ? 1 : 0);
  Serial.printf("STA SSID: %s\n", staSsid.c_str());
  Serial.printf("STA connected: %d\n", (staConnected && WiFi.status() == WL_CONNECTED) ? 1 : 0);
  Serial.printf("STA IP: %s\n", WiFi.localIP().toString().c_str());
  Serial.printf("Last STA IP: %s\n", lastStaIp.c_str());
  Serial.printf("BT tiny web boot option: %s\n", btLiteBootWebEnabled ? "enabled" : "disabled / Telnet-only");
  Serial.printf("BT tiny web server runtime: %s\n", tinyWebServerRuntimeEnabled ? "enabled" : "disabled");
  Serial.printf("Active poll interval: %lu ms\n", pollIntervalMs);
  Serial.printf("Idle poll interval: %lu ms\n", idlePollIntervalMs);
  Serial.printf("Effective poll interval: %lu ms (%s)\n",
                effectiveMountPollIntervalMs(),
                positionDemandActive() ? "active demand" : "idle");
  Serial.printf("WiFi runtime: %s\n", wifiRuntimeEnabled ? "enabled" : "disabled");
  Serial.printf("Telnet console: port=%u password=%s client=%s auth=%s commands=%lu authFailures=%lu\n",
                TELNET_PORT,
                telnetMaskedPassword().c_str(),
                (telnetClient && telnetClient.connected()) ? "connected" : "not connected",
                telnetAuthenticated ? "yes" : "no",
                (unsigned long)telnetRxCommands,
                (unsigned long)telnetAuthFailures);
  Serial.printf("Telnet live logs: %s lines=%lu\n", telnetLiveLogEnabled ? "enabled" : "disabled", (unsigned long)telnetLiveLogLines);
  Serial.printf("GOTO queue: active=%s type=%s timeout=%lu ms effective=%lu ms accepted=%lu started=%lu timedOut=%lu replaced=%lu immediateAcks=%lu cachedPositionReplies=%lu\n",
                hasQueuedGoto() ? "yes" : "no",
                queuedGotoTypeName(queuedGotoType),
                gotoQueueTimeoutMs,
                effectiveGotoQueueTimeoutMs(),
                (unsigned long)gotoQueueAccepted,
                (unsigned long)gotoQueueStarted,
                (unsigned long)gotoQueueTimedOut,
                (unsigned long)gotoQueueReplaced,
                (unsigned long)gotoQueueImmediateAcks,
                (unsigned long)queuedGotoPositionCacheReplies);
  Serial.printf("LX200 UI GOTO: active=%s source=%s started=%lu completed=%lu stopRequests=%lu age=%lu ms\n",
                lx200GotoUiActive ? "yes" : "no",
                lx200SourceName(lx200GotoUiSource),
                (unsigned long)lx200GotoUiStartedCount,
                (unsigned long)lx200GotoUiCompletedCount,
                (unsigned long)lx200GotoUiStopRequests,
                lx200GotoUiActive ? (unsigned long)(millis() - lx200GotoUiStartedMs) : 0UL);
  Serial.printf("Mount poll active=%lu ms idle=%lu ms effective=%lu ms demand=%s lastPollAge=%lu ms schedulerLatency=%lu/%lu ms started=%lu deferredBusy=%lu missedDeadline=%lu\n",
                pollIntervalMs,
                idlePollIntervalMs,
                effectiveMountPollIntervalMs(),
                positionDemandActive() ? "active" : "idle",
                lastMountPollMs == 0 ? 0UL : (unsigned long)(millis() - lastMountPollMs),
                lastPollSchedulerLatencyMs,
                maxPollSchedulerLatencyMs,
                mountPollsStarted,
                mountPollsDeferredBusy,
                mountPollsMissedDeadline);
  Serial.printf("Loop latency current/max=%lu/%lu ms\n", lastLoopLatencyMs, maxLoopLatencyMs);
  Serial.printf("Free heap: %u bytes\n", ESP.getFreeHeap());
#if defined(ESP32)
  Serial.printf("Min free heap: %u bytes\n", ESP.getMinFreeHeap());
#endif
#if HAS_CLASSIC_BT
  Serial.printf("Bluetooth enabled: %d\n", bluetoothRuntimeEnabled ? 1 : 0);
  Serial.printf("Bluetooth client: %d\n", SerialBT.hasClient() ? 1 : 0);
#else
  Serial.println("Bluetooth enabled: 0");
#endif
  Serial.printf("Mount fault: %d busy: %d\n", mountCommFault ? 1 : 0, mountBusy ? 1 : 0);
  Serial.println();
}


