gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
class TelnetCRLFPrint : public Print {
public:
  explicit TelnetCRLFPrint(Print &wrapped) : out(wrapped), lastWasCR(false) {}

  size_t write(uint8_t b) override {
    size_t n = 0;
    if (b == '\n' && !lastWasCR) {
      n += out.write('\r');
    }
    n += out.write(b);
    lastWasCR = (b == '\r');
    if (b != '\r' && b != '\n') lastWasCR = false;
    return n;
  }

  size_t write(const uint8_t *buffer, size_t size) override {
    size_t n = 0;
    for (size_t i = 0; i < size; i++) n += write(buffer[i]);
    return n;
  }

private:
  Print &out;
  bool lastWasCR;
};

String telnetMaskedPassword() {
  if (telnetPassword.length() == 0) return String("(disabled)");
  return String("(set, ") + String(telnetPassword.length()) + " chars)";
}

void telnetPrintHelp(Print &out) {
  out.println();
  out.printf("%s %s commands\n", FW_NAME, FW_VERSION);
  out.println("Help:");
  out.println("  help | ? | help mount | help mode | help wifi | help <command>");
  out.println("Status:");
  out.println("  status");
  out.println("  current_state | currentstate | state | pos");
  out.println("  system_health | systemhealth | health");
  out.println("  tasks [seconds|millisecondsms]");
  out.println("  gpio_startup | gpiostartup | startup_pins");
  out.println("  telnet | telnet status");
  out.println("  telnetlog");
  out.println("  monitor [seconds|millisecondsms]");
  out.println("Mount:");
  out.println("  testinit | get | getaltaz | rates | drain");
  out.println("  mountpoll | mountpoll <ms>");
  out.println("  idlepoll | idlepoll <ms> | poll idle <ms>");
  out.println("  nudge az+ | nudge az- | nudge alt+ | nudge alt-");
  out.println("Mode:");
  out.println("  modebt | modebt_web");
  out.println("  modebt_telnet | modebt_noweb | modebt_telnetonly");
  out.println("  modewifi");
  out.println("  web [status|on|off|toggle]");
  out.println("  webserver [status|on|off|toggle]");
  out.println("  wifi [status|on|off|toggle]");
  out.println("  reboot | restart | exit | quit");
  out.println("Config:");
  out.println("  apdefault");
  out.println("  setsta <ssid> <password>");
  out.println("  telnetlog 0 | telnetlog 1");
  out.println("  log | log 0..5 [systems]");
}

void telnetPrintStatus(Print &out) {
  out.println();
  out.println("=== Status ===");
  out.printf("Firmware: %s %s\n", FW_NAME, FW_VERSION);
  out.printf("Bridge mode: %s\n", bridgeModeName());
  out.printf("Startup mode source: %s\n", startupModeSource.c_str());
  out.printf("Startup mode pin used: %d\n", startupModePinUsed);
  out.printf("WiFi mode: %s\n", wifiModeText.c_str());
  out.printf("WiFi status: %s\n", lastWifiStatus.c_str());
  out.printf("AP SSID: %s\n", runtimeApSsid().c_str());
  out.printf("AP IP: %s\n", WiFi.softAPIP().toString().c_str());
  out.printf("STA SSID: %s\n", staSsid.c_str());
  out.printf("STA IP: %s\n", WiFi.localIP().toString().c_str());
  out.printf("Telnet port: %u\n", TELNET_PORT);
  out.printf("Telnet password: %s\n", telnetMaskedPassword().c_str());
  out.printf("Telnet authenticated: %s\n", telnetAuthenticated ? "yes" : "no");
  out.printf("Telnet live logs: %s lines=%lu\n", telnetLiveLogEnabled ? "enabled" : "disabled", (unsigned long)telnetLiveLogLines);
  out.printf("GOTO queue: active=%s type=%s timeout=%lu ms effective=%lu ms accepted=%lu started=%lu timedOut=%lu replaced=%lu immediateAcks=%lu cachedPositionReplies=%lu\n",
             hasQueuedGoto() ? "yes" : "no",
             queuedGotoTypeName(queuedGotoType),
             gotoQueueTimeoutMs,
             effectiveGotoQueueTimeoutMs(),
             (unsigned long)gotoQueueAccepted,
             (unsigned long)gotoQueueStarted,
             (unsigned long)gotoQueueTimedOut,
             (unsigned long)gotoQueueReplaced,
             (unsigned long)gotoQueueImmediateAcks,
             (unsigned long)queuedGotoPositionCacheReplies);
  out.printf("Mount poll active=%lu ms idle=%lu ms effective=%lu ms demand=%s lastPollAge=%lu ms schedulerLatency=%lu/%lu ms started=%lu deferredBusy=%lu missedDeadline=%lu\n",
             pollIntervalMs,
             idlePollIntervalMs,
             effectiveMountPollIntervalMs(),
             positionDemandActive() ? "active" : "idle",
             lastMountPollMs == 0 ? 0UL : (unsigned long)(millis() - lastMountPollMs),
             lastPollSchedulerLatencyMs,
             maxPollSchedulerLatencyMs,
             mountPollsStarted,
             mountPollsDeferredBusy,
             mountPollsMissedDeadline);
  out.printf("Loop latency current/max=%lu/%lu ms\n", lastLoopLatencyMs, maxLoopLatencyMs);
  out.printf("BT tiny web boot option: %s\n", btLiteBootWebEnabled ? "enabled" : "disabled / Telnet-only");
  out.printf("BT tiny web server runtime: %s\n", tinyWebServerRuntimeEnabled ? "enabled" : "disabled");
  out.printf("WiFi runtime: %s\n", wifiRuntimeEnabled ? "enabled" : "disabled");
  out.printf("Free heap: %u bytes\n", ESP.getFreeHeap());
#if defined(ESP32)
  out.printf("Min free heap: %u bytes\n", ESP.getMinFreeHeap());
#endif
#if HAS_CLASSIC_BT
  out.printf("Bluetooth runtime: %s\n", bluetoothRuntimeEnabled ? "enabled" : "disabled");
  out.printf("Bluetooth client: %s\n", (bluetoothRuntimeEnabled && SerialBT.hasClient()) ? "connected" : "not connected");
#endif
  out.printf("Mount alive: %s\n", mountAlive() ? "yes" : "unknown/no recent response");
  out.printf("Mount fault: %s\n", mountCommFault ? "yes" : "no");
  if (lastMountFault.length()) out.printf("Last mount fault: %s\n", lastMountFault.c_str());
  out.println("=== End Status ===");
}

void printTaskStatsHeader(Print &out) {
  out.printf("%-16s%-14s%s\n", "Task", "Abs Time", "% Time");
}

bool parseTaskStatsLine(const char *line, char *taskName, size_t taskNameSize, unsigned long &absTime, char *percentTime, size_t percentSize) {
  if (!line || !*line || taskNameSize == 0 || percentSize == 0) return false;
  taskName[0] = '\0';
  percentTime[0] = '\0';
  absTime = 0;

  const char *nameStart = line;
  while (*nameStart == ' ' || *nameStart == '\t') nameStart++;
  const char *tab = strchr(nameStart, '\t');
  if (tab) {
    const char *nameEnd = tab;
    while (nameEnd > nameStart && (*(nameEnd - 1) == ' ' || *(nameEnd - 1) == '\t')) nameEnd--;
    size_t nameLen = (size_t)(nameEnd - nameStart);
    if (nameLen >= taskNameSize) nameLen = taskNameSize - 1;
    memcpy(taskName, nameStart, nameLen);
    taskName[nameLen] = '\0';

    const char *p = tab + 1;
    while (*p == ' ' || *p == '\t') p++;
    char *endPtr = nullptr;
    absTime = strtoul(p, &endPtr, 10);
    if (endPtr == p) return false;
    p = endPtr;
    while (*p == ' ' || *p == '\t') p++;
    size_t pctLen = 0;
    while (p[pctLen] && p[pctLen] != ' ' && p[pctLen] != '\t' && p[pctLen] != '\r' && p[pctLen] != '\n') pctLen++;
    if (pctLen >= percentSize) pctLen = percentSize - 1;
    memcpy(percentTime, p, pctLen);
    percentTime[pctLen] = '\0';
    return taskName[0] && percentTime[0];
  }

