gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  return sscanf(line, " %23s %lu %15s", taskName, &absTime, percentTime) == 3;
}

bool taskStatsIncludeInBasic(const char *taskName) {
  return strcmp(taskName, "loopTask") == 0 ||
         strcmp(taskName, "IDLE0") == 0 ||
         strcmp(taskName, "IDLE1") == 0;
}

void appendTaskStatsRow(String &s, const char *taskName, unsigned long absTime, const char *percentTime) {
  char row[72];
  snprintf(row, sizeof(row), "%-16s%-14lu%s\n", taskName, absTime, percentTime);
  s += row;
}

String taskStatsSectionText(bool basicMode) {
  String s;
  s += basicMode ? "TASKS\n" : "=== TASKS ===\n";
  s += "Task            Abs Time      % Time\n";
#if defined(ESP32) && defined(configGENERATE_RUN_TIME_STATS) && (configGENERATE_RUN_TIME_STATS == 1) && defined(configUSE_STATS_FORMATTING_FUNCTIONS) && (configUSE_STATS_FORMATTING_FUNCTIONS == 1)
  static char taskStats[2048];
  memset(taskStats, 0, sizeof(taskStats));
  vTaskGetRunTimeStats(taskStats);

  bool printedAny = false;
  char *line = taskStats;
  while (line && *line) {
    char *next = line;
    while (*next && *next != '\n' && *next != '\r') next++;
    char saved = *next;
    *next = '\0';

    char taskName[24] = "";
    char percentTime[16] = "";
    unsigned long absTime = 0;
    if (parseTaskStatsLine(line, taskName, sizeof(taskName), absTime, percentTime, sizeof(percentTime)) &&
        (!basicMode || taskStatsIncludeInBasic(taskName))) {
      appendTaskStatsRow(s, taskName, absTime, percentTime);
      printedAny = true;
    }

    if (!saved) break;
    line = next + 1;
    while (*line == '\n' || *line == '\r') line++;
  }
  if (!printedAny) s += basicMode ? "loopTask/IDLE0/IDLE1 unavailable\n" : "No task rows available\n";
#else
  s += "FreeRTOS runtime stats are not enabled in this build.\n";
#endif
  return s;
}

void printTaskStatsLine(Print &out, const char *line) {
  char taskName[24] = "";
  unsigned long absTime = 0;
  char percentTime[16] = "";
  if (parseTaskStatsLine(line, taskName, sizeof(taskName), absTime, percentTime, sizeof(percentTime))) {
    out.printf("%-16s%-14lu%s\n", taskName, absTime, percentTime);
  } else if (line && *line) {
    out.println(line);
  }
}

void updateTelnetTasksCpuLoad(char *taskStats) {
  unsigned long idle0 = 0;
  unsigned long idle1 = 0;
  unsigned long total = 0;
  bool foundIdle0 = false;
  bool foundIdle1 = false;
  const char *p = taskStats;
  while (p && *p) {
    char line[128] = "";
    size_t len = 0;
    while (p[len] && p[len] != '\n' && p[len] != '\r' && len < sizeof(line) - 1) len++;
    memcpy(line, p, len);
    line[len] = '\0';

    char taskName[24] = "";
    char percentTime[16] = "";
    unsigned long absTime = 0;
    if (parseTaskStatsLine(line, taskName, sizeof(taskName), absTime, percentTime, sizeof(percentTime))) {
      total += absTime;
      if (strcmp(taskName, "IDLE0") == 0) {
        idle0 = absTime;
        foundIdle0 = true;
      } else if (strcmp(taskName, "IDLE1") == 0) {
        idle1 = absTime;
        foundIdle1 = true;
      }
    }

    p += len;
    while (*p == '\n' || *p == '\r') p++;
  }

  if (foundIdle0 && foundIdle1 && telnetTasksLastLoadMs > 0 &&
      idle0 >= telnetTasksLastIdle0 && idle1 >= telnetTasksLastIdle1 && total > telnetTasksLastRuntimeTotal) {
    unsigned long idleDelta = (idle0 - telnetTasksLastIdle0) + (idle1 - telnetTasksLastIdle1);
    unsigned long totalDelta = total - telnetTasksLastRuntimeTotal;
    int loadPct = 100 - (int)((idleDelta * 100UL) / totalDelta);
    if (loadPct < 0) loadPct = 0;
    if (loadPct > 100) loadPct = 100;
    telnetTasksCpuLoadPct = loadPct;
  } else {
    telnetTasksCpuLoadPct = -1;
  }

  if (foundIdle0 && foundIdle1) {
    telnetTasksLastIdle0 = idle0;
    telnetTasksLastIdle1 = idle1;
    telnetTasksLastRuntimeTotal = total;
    telnetTasksLastLoadMs = millis();
  }
}

String sampleWebCpuLoadText() {
#if defined(ESP32) && defined(configGENERATE_RUN_TIME_STATS) && (configGENERATE_RUN_TIME_STATS == 1) && defined(configUSE_STATS_FORMATTING_FUNCTIONS) && (configUSE_STATS_FORMATTING_FUNCTIONS == 1)
  static char taskStats[2048];
  memset(taskStats, 0, sizeof(taskStats));
  vTaskGetRunTimeStats(taskStats);

  unsigned long idle0 = 0;
  unsigned long idle1 = 0;
  unsigned long total = 0;
  bool foundIdle0 = false;
  bool foundIdle1 = false;
  char *line = taskStats;
  while (line && *line) {
    char *next = line;
    while (*next && *next != '\n' && *next != '\r') next++;
    char saved = *next;
    *next = '\0';

    char taskName[24] = "";
    char percentTime[16] = "";
    unsigned long absTime = 0;
    if (parseTaskStatsLine(line, taskName, sizeof(taskName), absTime, percentTime, sizeof(percentTime))) {
      total += absTime;
      if (strcmp(taskName, "IDLE0") == 0) {
        idle0 = absTime;
        foundIdle0 = true;
      } else if (strcmp(taskName, "IDLE1") == 0) {
        idle1 = absTime;
        foundIdle1 = true;
      }
    }

    if (!saved) break;
    line = next + 1;
    while (*line == '\n' || *line == '\r') line++;
  }

  if (foundIdle0 && foundIdle1 && webCpuLastRuntimeTotal > 0 &&
      idle0 >= webCpuLastIdle0 && idle1 >= webCpuLastIdle1 && total > webCpuLastRuntimeTotal) {
    unsigned long idleDelta = (idle0 - webCpuLastIdle0) + (idle1 - webCpuLastIdle1);
    unsigned long totalDelta = total - webCpuLastRuntimeTotal;
    int loadPct = 100 - (int)((idleDelta * 100UL) / totalDelta);
    if (loadPct < 0) loadPct = 0;
    if (loadPct > 100) loadPct = 100;
    webCpuLoadPct = loadPct;
  } else {
    webCpuLoadPct = -1;
  }

  if (foundIdle0 && foundIdle1) {
    webCpuLastIdle0 = idle0;
    webCpuLastIdle1 = idle1;
    webCpuLastRuntimeTotal = total;
  }
#endif
  if (webCpuLoadPct < 0) return "CPU Load --%";
  return String("CPU Load ") + String(webCpuLoadPct) + "%";
}

String taskCpuLoadText() {
  if (telnetTasksCpuLoadPct < 0) return "CPU Load --%";
  return String("CPU Load ") + String(telnetTasksCpuLoadPct) + "%";
}

String taskRefreshText();

void printTasksBanner(Print &out) {
  String left = String(FW_VERSION) + " Tasks  Up " + formatUptime() + "  Refresh " + taskRefreshText();
  out.println(left);
}

void printFormattedTaskRuntimeStats(Print &out, char *taskStats) {
  printTaskStatsHeader(out);
  char *line = taskStats;
  while (line && *line) {
    char *next = line;
    while (*next && *next != '\n' && *next != '\r') next++;
    char saved = *next;
    *next = '\0';
    printTaskStatsLine(out, line);
    if (!saved) break;
    line = next + 1;
    while (*line == '\n' || *line == '\r') line++;
  }
}

void printTaskRuntimeStats(Print &out) {
#if defined(ESP32) && defined(configGENERATE_RUN_TIME_STATS) && (configGENERATE_RUN_TIME_STATS == 1) && defined(configUSE_STATS_FORMATTING_FUNCTIONS) && (configUSE_STATS_FORMATTING_FUNCTIONS == 1)
  static char taskStats[2048];
  memset(taskStats, 0, sizeof(taskStats));
  vTaskGetRunTimeStats(taskStats);
  out.println("=== FreeRTOS Runtime Stats ===");
  out.println("Task runtime percentages are cumulative since boot.");
  printFormattedTaskRuntimeStats(out, taskStats);
  out.println("=== End Runtime Stats ===");
#else
  out.println("FreeRTOS runtime stats are not enabled in this build.");
  out.println("Required: configGENERATE_RUN_TIME_STATS=1 and configUSE_STATS_FORMATTING_FUNCTIONS=1.");
  out.println("Command is compiled as a safe no-op unless those options are available.");
#endif
}

String taskRefreshText() {
  if (telnetTasksRefreshMs % 1000UL == 0) return String(telnetTasksRefreshMs / 1000UL) + "s";
  return String(telnetTasksRefreshMs) + "ms";
}

bool consoleConfirmYes(const String &cmd) {
  return cmd == "y" || cmd == "yes";
}

bool consoleConfirmNo(const String &cmd) {
  return cmd == "n" || cmd == "no";
}

bool commandRequiresDisconnectConfirm(const String &cmd, bool telnetSession, String &description) {
  if (cmd == "reboot" || cmd == "restart") {
    description = "This command will reboot the controller.";
    return true;
  }
  if (cmd == "wifi off") {
    description = "This command will turn WiFi off and may disconnect clients.";
    return true;
  }
  if (cmd == "wifi toggle" && wifiRuntimeEnabled) {
    description = "This command will turn WiFi off and may disconnect clients.";
    return true;
  }
  if (cmd == "modebt" || cmd == "modebt_web" ||
      cmd == "modebt_telnet" || cmd == "modebt_noweb" || cmd == "modebt_telnetonly" ||
      cmd == "modewifi") {
    description = "This command will save boot mode and reboot the controller.";
    return true;
  }
  if (cmd == "apdefault") {
    description = "This command will restart the AP/radio path and may disconnect clients.";
    return true;
  }
  if (cmd.startsWith("setsta ")) {
    description = "This command will change STA WiFi and may disconnect clients.";
    return true;
  }
  if (telnetSession && (cmd == "exit" || cmd == "quit")) {
    description = "This command will close the Telnet session.";
    return true;
  }
  return false;
}

void printCommandConfirmPrompt(Print &out, const String &line, const String &description) {
  out.println(description);
  out.print("Run '");
  out.print(line);
  out.println("'? y/n");
}

void printMountPollValue(Print &out) {
  out.printf("mountpoll=%lu ms%s\n", pollIntervalMs, pollIntervalMs == 0 ? " (off)" : "");
}

bool setMountPollValue(long valueMs) {
  if (valueMs < 0) valueMs = 0;
  if (valueMs > 60000) valueMs = 60000;
  pollIntervalMs = (unsigned long)valueMs;
  resetMountPollScheduler();
  return savePersistentSettings();
}

