gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
String formatAgeSeconds(unsigned long timestampMs) {
  if (timestampMs == 0) return "never";
  unsigned long s = (millis() - timestampMs) / 1000UL;
  if (s < 60UL) return String(s) + "s";
  unsigned long m = s / 60UL;
  s %= 60UL;
  if (m < 60UL) return String(m) + "m" + twoDigits(s) + "s";
  unsigned long h = m / 60UL;
  m %= 60UL;
  return String(h) + "h" + twoDigits(m) + "m";
}

String monitorRefreshText() {
  if (telnetMonitorRefreshMs % 1000UL == 0) return String(telnetMonitorRefreshMs / 1000UL) + "s";
  return String(telnetMonitorRefreshMs) + "ms";
}

unsigned long parseMonitorRefreshMs(const String &cmd) {
  if (cmd == "monitor") return 2000UL;
  if (!cmd.startsWith("monitor ")) return 2000UL;
  String arg = cmd.substring(8);
  arg.trim();
  arg.toLowerCase();
  if (arg.length() == 0) return 2000UL;

  bool milliseconds = arg.endsWith("ms");
  if (milliseconds) arg.remove(arg.length() - 2);
  else if (arg.endsWith("s")) arg.remove(arg.length() - 1);
  arg.trim();

  unsigned long value = (unsigned long)arg.toInt();
  if (value == 0) return 2000UL;
  unsigned long ms = milliseconds ? value : value * 1000UL;
  if (ms < 500UL) ms = 500UL;
  if (ms > 60000UL) ms = 60000UL;
  return ms;
}

unsigned long parseIntervalArgumentMs(const String &cmd, const String &commandName, unsigned long defaultMs) {
  if (cmd == commandName) return defaultMs;
  String prefix = commandName;
  prefix += " ";
  if (!cmd.startsWith(prefix)) return defaultMs;
  String arg = cmd.substring(prefix.length());
  arg.trim();
  arg.toLowerCase();
  if (arg.length() == 0) return defaultMs;

  bool milliseconds = arg.endsWith("ms");
  if (milliseconds) arg.remove(arg.length() - 2);
  else if (arg.endsWith("s")) arg.remove(arg.length() - 1);
  arg.trim();

  unsigned long value = (unsigned long)arg.toInt();
  if (value == 0) return defaultMs;
  unsigned long ms = milliseconds ? value : value * 1000UL;
  if (ms < 1000UL) ms = 1000UL;
  if (ms > 60000UL) ms = 60000UL;
  return ms;
}

void telnetDrawMonitor(Print &out) {
  bool btConnected = false;
#if HAS_CLASSIC_BT
  btConnected = bluetoothRuntimeEnabled && SerialBT.hasClient();
#endif
  bool skyWifiConnected = lx200Client && lx200Client.connected();
  bool stelConnected = stellariumClient && stellariumClient.connected();
  const char* mountStateShort = mountCommFault ? "Fault" : ((mountBusy || asyncSlewRunning || asyncSlewPending) ? "Busy" : (lastMountResponseMs > 0 ? "Connected" : "Unknown"));

  out.print("\x1B[H");
  out.printf("%-20s %-10s %-8s %-12s %-8s %-8s\n",
             FW_NAME,
             FW_VERSION,
             "Uptime",
             formatUptime().c_str(),
             "Refresh",
             monitorRefreshText().c_str());
  out.println("q / Enter / Ctrl-C exits");
  out.println("----------------------------------------------------------------------------");
  out.printf("%-12s %-12s %-12s %-12s %-12s %-12s\n", "MOUNT", "FAULT", "MOUNT UP", "LAST POLL", "TX", "RX");
  out.printf("%-12s %-12s %-12s %-12s %-12lu %-12lu\n",
             mountStateShort,
             mountCommFault ? "yes" : "no",
             formatMountUptime().c_str(),
             lastSuccessfulMountPollMs == 0 ? "none" : (twoDigits(lastSuccessfulMountPollHour) + ":" + twoDigits(lastSuccessfulMountPollMinute) + ":" + twoDigits(lastSuccessfulMountPollSecond)).c_str(),
             mountPollsStarted,
             mountPollsSucceeded);
  out.println();
  out.printf("%-12s %-12s %-12s %-12s %-12s\n", "ALT", "AZ", "MOUNTPOLL", "IDLEPOLL", "CURRENT POLL");
  out.printf("%-12.6f %-12.6f %-12s %-12s %-12s\n",
             mountCurrentAlt_deg,
             mountCurrentAz_deg,
             (String(pollIntervalMs) + " ms").c_str(),
             (String(idlePollIntervalMs) + " ms").c_str(),
             (String(effectiveMountPollIntervalMs()) + " ms").c_str());
  out.println();
  out.printf("%-24s %-24s %-20s\n", "POLLS STARTED", "POLLS MISSED", "LOGS");
  out.printf("%-24lu %-24lu %-20s\n",
             mountPollsStarted,
             mountPollsMissedDeadline,
             telnetMonitorActive ? (telnetMonitorSavedLiveLog ? "paused/on" : "paused/off") : (telnetLiveLogEnabled ? "on" : "off"));
  out.println();
  out.printf("%-12s %-12s %-12s %-12s %-12s\n", "CLIENT", "STATE", "TX", "RX", "ERRORS");
  out.printf("%-12s %-12s %-12lu %-12lu %-12lu\n",
             "Sky WiFi",
             skyWifiConnected ? "connected" : "idle",
             lx200WifiTxReplies,
             lx200WifiRxCommands,
             lx200WifiUnhandledCommands);
  out.printf("%-12s %-12s %-12lu %-12lu %-12lu\n",
             "Sky BT",
             btConnected ? "connected" : (bluetoothRuntimeEnabled ? "waiting" : "disabled"),
             lx200BtTxReplies,
             lx200BtRxCommands,
             lx200BtUnhandledCommands);
  out.printf("%-12s %-12s %-12lu %-12lu %-12lu\n",
             "Stellarium",
             stelConnected ? "connected" : "idle",
             stellariumTxPackets,
             stellariumRxPackets,
             stellariumBadPackets);
  out.printf("%-12s %-12s %-12s %-12lu %-12s\n",
             "Alpaca",
             alpacaConnected ? "active" : "idle",
             "-",
             alpacaHttpRequests,
             "-");
  out.println();
  out.printf("%-12s %-12s %-12s %-12s\n", "HEAP", "MIN HEAP", "LOOP", "MAX LOOP");
  out.printf("%-12u %-12u %-12s %-12s\n",
             ESP.getFreeHeap(),
#if defined(ESP32)
             ESP.getMinFreeHeap(),
#else
             0,
#endif
             (String(lastLoopLatencyMs) + " ms").c_str(),
             (String(maxLoopLatencyMs) + " ms").c_str());
  out.println();
  out.println("FAULT DETAIL");
  out.printf("%.76s\n", lastMountFault.length() ? lastMountFault.c_str() : "none");
  out.print("\x1B[J");
}

void telnetStartMonitor(Print &out, unsigned long refreshMs) {
  telnetMonitorRefreshMs = refreshMs;
  telnetMonitorSavedLiveLog = telnetLiveLogEnabled;
  telnetLiveLogEnabled = false;
  telnetMonitorActive = true;
  telnetMonitorLastDrawMs = millis();
  out.print("\x1B[2J\x1B[?25l");
  telnetDrawMonitor(out);
}

void telnetStopMonitor(Print &out) {
  telnetMonitorActive = false;
  telnetLiveLogEnabled = telnetMonitorSavedLiveLog;
  out.print("\x1B[?25h");
  out.println();
  out.println("Monitor stopped.");
}

void telnetDrawTasks(Print &out) {
  out.print("\x1B[H");
#if defined(ESP32) && defined(configGENERATE_RUN_TIME_STATS) && (configGENERATE_RUN_TIME_STATS == 1) && defined(configUSE_STATS_FORMATTING_FUNCTIONS) && (configUSE_STATS_FORMATTING_FUNCTIONS == 1)
  static char taskStats[2048];
  memset(taskStats, 0, sizeof(taskStats));
  vTaskGetRunTimeStats(taskStats);
  updateTelnetTasksCpuLoad(taskStats);
  printTasksBanner(out);
  out.println("q / Enter / Ctrl-C exits. Runtime percentages are cumulative since boot.");
  out.println("----------------------------------------------------------------------------");
  out.println(taskCpuLoadText());
  printFormattedTaskRuntimeStats(out, taskStats);
#else
  printTasksBanner(out);
  out.println("q / Enter / Ctrl-C exits. Runtime percentages are cumulative since boot.");
  out.println("----------------------------------------------------------------------------");
  out.println("FreeRTOS runtime stats are not enabled in this build.");
  out.println("Required:");
  out.println("  configGENERATE_RUN_TIME_STATS=1");
  out.println("  configUSE_STATS_FORMATTING_FUNCTIONS=1");
  out.println();
  out.println("The command is present as a safe no-op until those options are available.");
#endif
  out.print("\x1B[J");
}

void telnetStartTasks(Print &out, unsigned long refreshMs) {
  telnetTasksRefreshMs = refreshMs;
  telnetTasksSavedLiveLog = telnetLiveLogEnabled;
  telnetLiveLogEnabled = false;
  telnetMonitorActive = false;
  telnetTasksActive = true;
  telnetTasksLastDrawMs = millis();
  telnetTasksLastIdle0 = 0;
  telnetTasksLastIdle1 = 0;
  telnetTasksLastRuntimeTotal = 0;
  telnetTasksLastLoadMs = 0;
  telnetTasksCpuLoadPct = -1;
  out.print("\x1B[2J\x1B[?25l");
  telnetDrawTasks(out);
}

void telnetStopTasks(Print &out) {
  telnetTasksActive = false;
  telnetLiveLogEnabled = telnetTasksSavedLiveLog;
  out.print("\x1B[?25h");
  out.println();
  out.println("Tasks stopped.");
}

void telnetRunCommand(String line, Print &out) {
  line.trim();
  if (line.length() == 0) return;
  String cmd = line;
  cmd.toLowerCase();
  telnetRxCommands++;
  telnetLastRxMs = millis();
  Serial.print("[telnet] command: ");
  Serial.println(line);

  if (cmd == "help" || cmd == "?") telnetPrintHelp(out);
  else if (cmd.startsWith("help ")) {
    String topic = line.substring(5);
    topic.trim();
    topic.toLowerCase();

