gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
    if (topic == "mount" || topic == "scope" || topic == "nexstar") {
      out.println("Mount and polling commands:");
      out.println("  testinit                    Test '?' handshake and E payload read.");
      out.println("  get                         Query current RA/Dec.");
      out.println("  getaltaz                    Query current Alt/Az.");
      out.println("  pos | current_state | state Show cached coordinates and bridge state.");
      out.println("  rates                       Show nudge rates, poll interval, throttle.");
      out.println("  mountpoll                   Get active mount poll interval.");
      out.println("  mountpoll <ms>              Set active mount poll interval. 0 turns it off.");
      out.println("  nudge az+ | az- | alt+ | alt-");
      out.println("                              Perform one relative nudge at rate slot 2.");
      out.println("  drain                       Drain pending mount serial bytes.");
    } else if (topic == "mode" || topic == "boot" || topic == "runtime" || topic == "radio") {
      out.println("Mode and runtime commands:");
      out.println("  modebt | modebt_web         Save BT mode with tiny web enabled; reboot.");
      out.println("  modebt_telnet | modebt_noweb | modebt_telnetonly");
      out.println("                              Save BT Telnet-only mode; reboot.");
      out.println("  modewifi                    Save Full WiFi mode; reboot.");
      out.println("  web [status|on|off|toggle]  Control BT web server for this boot.");
      out.println("  reboot | restart            Restart immediately.");
    } else if (topic == "wifi" || topic == "network") {
      out.println("WiFi configuration commands:");
      out.println("  wifi [status|on|off|toggle] Show or change WiFi runtime state.");
      out.println("  setsta <ssid> <password>    Save STA credentials and connect.");
      out.println("  apdefault                   Restore default AP settings.");
    } else if (topic == "log" || topic == "logging" || topic == "logs") {
      out.println("log");
      out.println("  Show current level and enabled subsystems.");
      out.println("log <0..5> [systems]");
      out.println("  Set level and optional subsystem filter.");
      out.println("Levels:");
      out.println("  0 none   Disable stored/streamed firmware log output.");
      out.println("  1 error  Only failures that usually need action.");
      out.println("  2 warn   Errors plus abnormal/retry/fallback conditions.");
      out.println("  3 info   Normal high-level events: clients, saves, connect/disconnect.");
      out.println("  4 debug  Detailed decisions and state changes for troubleshooting.");
      out.println("  5 trace  Very chatty low-level flow; use briefly, can flood logs.");
    } else if (topic == "web" || topic == "webserver") {
      out.println("web | web status | webserver | webserver status");
      out.println("  Show the BT web-server runtime state.");
      out.println("web on | web off | web toggle");
      out.println("  Change the BT web-server state for this boot only.");
    } else if (topic == "reboot" || topic == "restart") {
      out.println("reboot | restart");
      out.println("  Restart the controller immediately and close Telnet.");
    } else if (topic == "testinit") {
      out.println("testinit"); out.println("  Test the NexStar '?' handshake and E payload read.");
    } else if (topic == "get") {
      out.println("get"); out.println("  Query the mount and print current RA/Dec.");
    } else if (topic == "getaltaz") {
      out.println("getaltaz"); out.println("  Query the mount and print current Alt/Az.");
    } else if (topic == "rates" || topic == "poll" || topic == "mountpoll") {
      out.println("rates"); out.println("  Show nudge rates, poll interval, and client throttle.");
      out.println("mountpoll | mountpoll <ms>");
      out.println("  Get or set the active mount poll interval. 0 turns it off.");
    } else if (topic == "nudge") {
      out.println("nudge az+ | nudge az- | nudge alt+ | nudge alt-");
      out.println("  Perform one relative nudge using rate slot 2.");
    } else if (topic == "drain") {
      out.println("drain"); out.println("  Drain and print pending mount serial bytes.");
    } else if (topic == "pos" || topic == "state" || topic == "current_state" || topic == "currentstate") {
      out.println("current_state | currentstate | state | pos");
      out.println("  Show cached coordinates and current bridge state.");
    } else if (topic == "health" || topic == "system_health" || topic == "systemhealth") {
      out.println("system_health | systemhealth | health");
      out.println("  Show counters, latency, memory, uptime, and errors.");
    } else if (topic == "tasks") {
      out.println("tasks [seconds|millisecondsms]");
      out.println("  Show FreeRTOS cumulative per-task runtime stats in place.");
      out.println("  Default refresh is 5 seconds. Examples: tasks | tasks 10 | tasks 1500ms");
      out.println("  Press q, Enter, or Ctrl-C to exit.");
      out.println("  Fields: Task=name, Abs Time=cumulative CPU ticks, % Time=CPU share since boot.");
      out.println("  CPU Load is interval load from IDLE0/IDLE1 deltas; first sample shows --%.");
      out.println("  IDLE0/IDLE1 idle core 0/1; high values mean spare CPU.");
      out.println("  tiT TCP/IP stack; Tmr Svc software timers; ipc0/ipc1 inter-core calls.");
      out.println("  esp_timer hi-res timers; wifi driver; sys_evt ESP events; arduino_events Arduino events.");
    } else if (topic == "gpio" || topic == "gpio_startup" || topic == "gpiostartup" || topic == "startup_pins") {
      out.println("gpio_startup | gpiostartup | startup_pins");
      out.println("  Show startup mode-pin readings and boot-mode source.");
    } else if (topic == "telnet") {
      out.println("telnet | telnet status");
      out.println("  Show Telnet port, connection, authentication, and counters.");
    } else if (topic == "monitor") {
      out.println("monitor [seconds|millisecondsms]");
      out.println("  Start a live in-place Telnet status view. Default refresh is 2 seconds.");
      out.println("  Examples: monitor | monitor 5 | monitor 750ms");
      out.println("  Press q, Enter, or Ctrl-C to exit.");
    } else if (topic == "telnetlog") {
      out.println("telnetlog");
      out.println("  Show whether log lines are streamed to the Telnet terminal.");
      out.println("telnetlog 0");
      out.println("  Turn off log streaming to the Telnet terminal.");
      out.println("telnetlog 1");
      out.println("  Turn on log streaming to the Telnet terminal.");
    } else if (topic == "idlepoll") {
      out.println("idlepoll | poll idle");
      out.println("  Show idle poll interval and effective poll interval.");
      out.println("idlepoll <ms> | poll idle <ms>");
      out.println("  Set and save idle poll interval from 0 to 60000 ms.");
    } else if (topic == "setsta" || topic == "sta") {
      out.println("setsta <ssid> <password>");
      out.println("  Save STA credentials and connect. Spaces are unsupported.");
    } else if (topic == "apdefault" || topic == "ap") {
      out.println("apdefault");
      out.println("  Restore AP SSID, password, and IP defaults.");
    } else {
      out.print("Unknown help topic: "); out.println(topic);
      out.println("Grouped topics: mount, mode, wifi");
      out.println("Specific topics: log, web, reboot, testinit, get, getaltaz, rates,");
      out.println("mountpoll, nudge, idlepoll, drain, pos, health, tasks, gpio, telnet,");
      out.println("telnetlog, setsta, apdefault");
    }
  }
  else if (cmd == "status") telnetPrintStatus(out);
  else if (cmd == "monitor" || cmd.startsWith("monitor ")) {
    telnetStartMonitor(out, parseMonitorRefreshMs(cmd));
  }
  else if (cmd == "gpio_startup" || cmd == "gpiostartup" || cmd == "startup_pins") {
    out.print(gpioStartupModeText());
  }
  else if (cmd == "current_state" || cmd == "currentstate" || cmd == "state" || cmd == "pos") {
    out.println();
    out.println("=== Current State ===");
    out.print(currentStateText());
    out.println("=== End Current State ===");
  }
  else if (cmd == "system_health" || cmd == "systemhealth" || cmd == "health") {
    out.println();
    out.println("=== System Health ===");
    out.print(systemHealthText());
    out.println("=== End System Health ===");
  }
  else if (cmd == "tasks" || cmd.startsWith("tasks ")) {
    telnetStartTasks(out, parseIntervalArgumentMs(cmd, "tasks", 5000UL));
  }
  else if (cmd == "telnetlog") {
    out.printf("Telnet live logs: %s lines=%lu\n",
               telnetLiveLogEnabled ? "enabled" : "disabled",
               (unsigned long)telnetLiveLogLines);
    out.println("Commands: telnetlog 0 | telnetlog 1");
  }
  else if (cmd == "telnetlog 0") {
    telnetLiveLogEnabled = false;
    out.println("Telnet live logs disabled.");
  }
  else if (cmd == "telnetlog 1") {
    telnetLiveLogEnabled = true;
    out.println("Telnet live logs enabled.");
  }
  else if (cmd == "telnet" || cmd == "telnet status") {
    out.printf("Telnet console: port=%u password=%s client=%s auth=%s commands=%lu authFailures=%lu liveLogs=%s liveLogLines=%lu\n",
               TELNET_PORT,
               telnetMaskedPassword().c_str(),
               (telnetClient && telnetClient.connected()) ? "connected" : "not connected",
               telnetAuthenticated ? "yes" : "no",
               (unsigned long)telnetRxCommands,
               (unsigned long)telnetAuthFailures,
               telnetLiveLogEnabled ? "enabled" : "disabled",
               (unsigned long)telnetLiveLogLines);
  }
  else if (cmd == "web" || cmd == "web status" || cmd == "webserver" || cmd == "webserver status") {
    out.printf("BT tiny web server runtime: %s\n", tinyWebServerRuntimeEnabled ? "enabled" : "disabled");
    out.println("Commands: web on | web off | web toggle");
  }
  else if (cmd == "web on" || cmd == "webserver on") {
    tinyWebServerRuntimeEnabled = true;
    out.println("BT tiny web server runtime enabled.");
  }
  else if (cmd == "web off" || cmd == "webserver off") {
    tinyWebServerRuntimeEnabled = false;
    out.println("BT tiny web server runtime disabled.");
  }
  else if (cmd == "web toggle" || cmd == "webserver toggle") {
    tinyWebServerRuntimeEnabled = !tinyWebServerRuntimeEnabled;
    out.printf("BT tiny web server runtime now: %s\n", tinyWebServerRuntimeEnabled ? "enabled" : "disabled");
  }
  else if (cmd == "wifi" || cmd == "wifi status") {
    out.printf("WiFi runtime: %s\n", wifiRuntimeEnabled ? "enabled" : "disabled");
    out.printf("Tiny web runtime: %s\n", tinyWebServerRuntimeEnabled ? "enabled" : "disabled");
    out.printf("WiFi mode text: %s\n", wifiModeText.c_str());
    out.printf("AP running: %d AP IP: %s STA connected: %d STA IP: %s\n",
               apRunning ? 1 : 0,
               WiFi.softAPIP().toString().c_str(),
               (staConnected && WiFi.status() == WL_CONNECTED) ? 1 : 0,
               WiFi.localIP().toString().c_str());
    out.println("Commands: wifi on | wifi off | wifi toggle");
  }
  else if (cmd == "wifi off") {
    out.println("WARNING: wifi off will shut down WiFi and disconnect this Telnet session.");
    out.println("Use USB serial or reboot to restore WiFi if needed.");
    delay(150);
    runtimeWifiOff();
  }
  else if (cmd == "wifi on") {
    runtimeWifiOn();
    out.println("WiFi runtime restore requested.");
  }
  else if (cmd == "wifi toggle") {
    if (wifiRuntimeEnabled) {
      out.println("WARNING: wifi toggle will turn WiFi off and disconnect this Telnet session.");
      out.println("Use USB serial or reboot to restore WiFi if needed.");
      delay(150);
      runtimeWifiOff();
    } else {
      runtimeWifiOn();
      out.println("WiFi runtime restore requested.");
    }
  }
  else if (cmd == "log") {
    out.printf("Log level: %d (%s), mask=0x%04X, systems=%s\n", LOG_LEVEL, logLevelName(LOG_LEVEL), LOG_SUBSYSTEM_MASK, consoleLogMaskNames(LOG_SUBSYSTEM_MASK).c_str());
  }
  else if (cmd.startsWith("log ")) {
    String arg = line.substring(4);
    arg.trim();
    int sp = arg.indexOf(' ');
    String lvlText = (sp >= 0) ? arg.substring(0, sp) : arg;
    lvlText.trim();
    int lvl = lvlText.toInt();
    if (lvl < 0) lvl = 0;
    if (lvl > 5) lvl = 5;
    LOG_LEVEL = lvl;
    if (sp >= 0) {
      String cats = arg.substring(sp + 1);
      cats.trim();
      if (cats.length()) LOG_SUBSYSTEM_MASK = consoleLogMaskFromList(cats);
    }
    out.printf("Log level applied: %d (%s), mask=0x%04X\n", LOG_LEVEL, logLevelName(LOG_LEVEL), LOG_SUBSYSTEM_MASK);
  }
  else if (cmd == "testinit") {
    bool ok = testInit();
    out.printf("testinit result: %s\n", ok ? "OK" : "FAILED");
  }
  else if (cmd == "get") {
    double ra = 0.0, dec = 0.0;
    bool ok = getRaDec(ra, dec, true);
    out.printf("get result: %s RA=%.6f DEC=%.6f\n", ok ? "OK" : "FAILED", ra, dec);
  }
  else if (cmd == "getaltaz") {
    double alt = 0.0, az = 0.0;
    bool ok = getAltAz(alt, az, true);
    out.printf("getaltaz result: %s ALT=%.6f AZ=%.6f\n", ok ? "OK" : "FAILED", alt, az);
  }
  else if (cmd == "rates") {
    out.printf("Nudge rates: %.3f %.3f %.3f %.3f poll=%lu idlePoll=%lu effectivePoll=%lu demand=%s throttle=%lu\n",
               nudgeRateDeg[0], nudgeRateDeg[1], nudgeRateDeg[2], nudgeRateDeg[3],
               pollIntervalMs, idlePollIntervalMs, effectiveMountPollIntervalMs(),
               positionDemandActive() ? "active" : "idle", minClientPollIntervalMs);
  }
  else if (cmd == "mountpoll") {
    printMountPollValue(out);
  }
  else if (cmd.startsWith("mountpoll ")) {
    long p = line.substring(10).toInt();
    bool ok = setMountPollValue(p);
    out.printf("mountpoll set to %lu ms%s\n", pollIntervalMs, ok ? "" : " (save failed)");
  }
  else if (cmd == "idlepoll" || cmd == "poll idle") {
    out.printf("Idle poll interval: %lu ms\n", idlePollIntervalMs);
    out.printf("Effective poll interval: %lu ms (%s)\n",
               effectiveMountPollIntervalMs(),
               positionDemandActive() ? "active demand" : "idle");
  }
  else if (cmd.startsWith("idlepoll ") || cmd.startsWith("poll idle ")) {
    String arg = cmd.startsWith("idlepoll ") ? line.substring(9) : line.substring(10);
    arg.trim();
    long p = arg.toInt();
    if (p < 0) p = 0;
    if (p > 60000) p = 60000;
    idlePollIntervalMs = (unsigned long)p;
    resetMountPollScheduler();
    bool ok = savePersistentSettings();
    out.printf("Idle poll interval set to %lu ms saved=%d\n", idlePollIntervalMs, ok ? 1 : 0);
  }
  else if (cmd == "nudge az+") out.printf("nudge az+ result: %s\n", nudgeRelativeAltAz(0.0, nudgeRateDeg[1]) ? "OK" : "FAILED");
  else if (cmd == "nudge az-") out.printf("nudge az- result: %s\n", nudgeRelativeAltAz(0.0, -nudgeRateDeg[1]) ? "OK" : "FAILED");
  else if (cmd == "nudge alt+") out.printf("nudge alt+ result: %s\n", nudgeRelativeAltAz(nudgeRateDeg[1], 0.0) ? "OK" : "FAILED");
  else if (cmd == "nudge alt-") out.printf("nudge alt- result: %s\n", nudgeRelativeAltAz(-nudgeRateDeg[1], 0.0) ? "OK" : "FAILED");
  else if (cmd == "drain") {
    drainMount();
    out.println("Mount serial drained.");
  }
  else if (cmd == "apdefault") {
    out.println("WARNING: apdefault may restart the AP/radio path and disconnect this Telnet session.");
    apSsid = "NexStar_Bridge";
    apPass = "12345678";
    apIp = "192.168.4.1";
    staRuntimeDisabled = true;
    bool ok = savePersistentSettings();
    scheduleApRestart("telnet apdefault");
    out.printf("AP defaults saved=%d; AP restarting as %s / %s / %s\n",
               ok ? 1 : 0, runtimeApSsid().c_str(), apPass.c_str(), apIp.c_str());
  }
  else if (cmd.startsWith("setsta ")) {
    out.println("WARNING: setsta changes WiFi connection state and may disconnect this Telnet session.");
    String rest = line.substring(7);
    rest.trim();
    int sp = rest.indexOf(' ');
    if (sp <= 0) {
      out.println("Usage: setsta <ssid> <password>");
    } else {
      String ssid = rest.substring(0, sp);
      String pass = rest.substring(sp + 1);
      ssid.trim();
      pass.trim();
      staRuntimeDisabled = false;
      bool saved = saveWiFiConfig(ssid, pass);
      bool connected = false;
      if (saved) {
        WiFi.mode(WIFI_STA);
        startFallbackAP();
        connected = connectConfiguredSTA();
      }
      out.printf("STA save=%d connected=%d ssid=%s ip=%s status=%s\n",
                 saved ? 1 : 0, connected ? 1 : 0, staSsid.c_str(),
                 WiFi.localIP().toString().c_str(), lastWifiStatus.c_str());
    }
  }
  else if (cmd == "modebt" || cmd == "modebt_web") {
    out.println("WARNING: modebt schedules a restart and will disconnect this Telnet session.");
    saveBluetoothLiteWebBootEnabled(true);
    saveBridgeMode(BRIDGE_MODE_BT_MIN_WEB);
    scheduleRestart("telnet modebt web");
    out.println("Saved BT mode with tiny web enabled; restarting soon.");
  }
  else if (cmd == "modebt_telnet" || cmd == "modebt_noweb" || cmd == "modebt_telnetonly") {
    out.println("WARNING: modebt_telnet schedules a restart and will disconnect this Telnet session.");
    out.println("Next boot will be BT with Telnet only; no tiny web page.");
    saveBluetoothLiteWebBootEnabled(false);
    saveBridgeMode(BRIDGE_MODE_BT_MIN_WEB);
    scheduleRestart("telnet modebt telnet-only");
    out.println("Saved BT Telnet-only mode; restarting soon.");
  }
  else if (cmd == "modewifi") {
    out.println("WARNING: modewifi schedules a restart and will disconnect this Telnet session.");
    saveBridgeMode(BRIDGE_MODE_WIFI_FULL);
    scheduleRestart("telnet modewifi");
    out.println("Saved full WiFi web mode; restarting soon.");
  }
  else if (cmd == "telnetlog") {
    Serial.printf("Telnet live logs: %s lines=%lu\n",
                  telnetLiveLogEnabled ? "enabled" : "disabled",
                  (unsigned long)telnetLiveLogLines);
    Serial.println("Commands: telnetlog 0 | telnetlog 1");
  }

  else if (cmd == "telnetlog 0") {
    telnetLiveLogEnabled = false;
    Serial.println("Telnet live logs disabled.");
  }

  else if (cmd == "telnetlog 1") {
    telnetLiveLogEnabled = true;
    Serial.println("Telnet live logs enabled.");
  }

