gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  else if (cmd == "reboot" || cmd == "restart") {
    out.println("WARNING: reboot will disconnect this Telnet session.");
    out.println("Reboot command received; restarting ESP32...");
    delay(250);
    ESP.restart();
  }
  else if (cmd == "exit" || cmd == "quit") {
    out.println("Closing Telnet session by request.");
    if (telnetClient) telnetClient.stop();
  }
  else {
    out.print("Unknown command: ");
    out.println(line);
    out.println("Type help.");
  }
}

void telnetExecuteCommand(String line, Print &out) {
  line.trim();
  if (line.length() == 0) return;

  String cmd = line;
  cmd.toLowerCase();

  if (telnetPendingConfirmCommand.length()) {
    if (consoleConfirmYes(cmd)) {
      String confirmedCommand = telnetPendingConfirmCommand;
      telnetPendingConfirmCommand = "";
      telnetPendingConfirmDescription = "";
      out.println("Confirmed.");
      telnetRunCommand(confirmedCommand, out);
    } else if (consoleConfirmNo(cmd)) {
      telnetPendingConfirmCommand = "";
      telnetPendingConfirmDescription = "";
      out.println("Cancelled.");
    } else {
      out.print("Pending confirmation for '");
      out.print(telnetPendingConfirmCommand);
      out.println("'. Enter y or n.");
    }
    return;
  }

  String description;
  if (commandRequiresDisconnectConfirm(cmd, true, description)) {
    telnetPendingConfirmCommand = line;
    telnetPendingConfirmDescription = description;
    printCommandConfirmPrompt(out, line, description);
    return;
  }

  telnetRunCommand(line, out);
}

void startTelnetConsoleServer(const char* reason) {
#if defined(ESP32)
  if (!telnetServerPtr) telnetServerPtr = new WiFiServer(TELNET_PORT);
  telnetServer.begin();
  Serial.printf("[TELNET] console server started on port %u (%s)\n", TELNET_PORT, reason ? reason : "no reason");
#endif
}

void serviceTelnetConsole() {
#if defined(ESP32)
  if (!wifiRuntimeEnabled) return;
  if (!telnetServerPtr) return;

  if (!telnetClient || !telnetClient.connected()) {
    if (telnetMonitorActive) {
      telnetMonitorActive = false;
      telnetLiveLogEnabled = telnetMonitorSavedLiveLog;
    }
    if (telnetTasksActive) {
      telnetTasksActive = false;
      telnetLiveLogEnabled = telnetTasksSavedLiveLog;
    }
    if (telnetClient) telnetClient.stop();
    WiFiClient nc = telnetServer.available();
    if (nc) {
      telnetClient = nc;
      telnetClientConnected = true;
      telnetAuthenticated = (telnetPassword.length() == 0);
      telnetLine = "";
      telnetLastWasCR = false;
      telnetMonitorActive = false;
      telnetTasksActive = false;
      telnetLastRxMs = millis();
      TelnetCRLFPrint telnetOut(telnetClient);
      telnetOut.println();
      telnetOut.printf("%s %s Telnet Console\n", FW_NAME, FW_VERSION);
      if (telnetAuthenticated) {
        telnetOut.println("Password disabled. Type help.");
        telnetOut.print("> ");
      } else {
        telnetOut.print("Password: ");
      }
      Serial.printf("[telnet] client connected on port %u\n", TELNET_PORT);
    }
    return;
  }

  TelnetCRLFPrint telnetOut(telnetClient);
  if (telnetAuthenticated && telnetMonitorActive && millis() - telnetMonitorLastDrawMs >= telnetMonitorRefreshMs) {
    telnetMonitorLastDrawMs = millis();
    telnetDrawMonitor(telnetOut);
  }
  if (telnetAuthenticated && telnetTasksActive && millis() - telnetTasksLastDrawMs >= telnetTasksRefreshMs) {
    telnetTasksLastDrawMs = millis();
    telnetDrawTasks(telnetOut);
  }

  while (telnetClient.available()) {
    uint8_t ch = (uint8_t)telnetClient.read();

    // Basic Telnet option negotiation: ignore IAC triplets.
    if (ch == 255) {
      if (telnetClient.available()) telnetClient.read();
      if (telnetClient.available()) telnetClient.read();
      continue;
    }

    if (telnetMonitorActive) {
      if (ch == '\n' && telnetLastWasCR) {
        telnetLastWasCR = false;
        continue;
      }
      if (ch == 'q' || ch == 'Q' || ch == 3 || ch == '\r' || ch == '\n') {
        telnetLastWasCR = (ch == '\r');
        telnetStopMonitor(telnetOut);
        if (telnetClient && telnetClient.connected()) telnetOut.print("> ");
      } else {
        telnetLastWasCR = false;
      }
      continue;
    }

    if (telnetTasksActive) {
      if (ch == '\n' && telnetLastWasCR) {
        telnetLastWasCR = false;
        continue;
      }
      if (ch == 'q' || ch == 'Q' || ch == 3 || ch == '\r' || ch == '\n') {
        telnetLastWasCR = (ch == '\r');
        telnetStopTasks(telnetOut);
        if (telnetClient && telnetClient.connected()) telnetOut.print("> ");
      } else {
        telnetLastWasCR = false;
      }
      continue;
    }

    bool telnetEndOfLine = false;
    if (ch == '\r') {
      telnetEndOfLine = true;
      telnetLastWasCR = true;
    } else if (ch == '\n') {
      if (telnetLastWasCR) {
        telnetLastWasCR = false;
        continue;  // CRLF already processed on CR.
      }
      telnetEndOfLine = true;
    } else {
      telnetLastWasCR = false;
    }

    if (telnetEndOfLine) {
      String line = telnetLine;
      telnetLine = "";
      line.trim();

      if (!telnetAuthenticated) {
        if (line == telnetPassword) {
          telnetAuthenticated = true;
          telnetOut.println();
          telnetOut.println("Authenticated. Type help.");
        } else {
          telnetAuthFailures++;
          telnetOut.println();
          telnetOut.println("Bad password. Closing.");
          telnetClient.stop();
          Serial.println("[telnet] bad password; client disconnected");
          return;
        }
      } else {
        telnetOut.println();
        telnetExecuteCommand(line, telnetOut);
      }

      if (telnetClient && telnetClient.connected()) telnetOut.print("> ");
      continue;
    }

    if (ch == 8 || ch == 127) {
      if (telnetLine.length() > 0) {
        telnetLine.remove(telnetLine.length() - 1);
      }
      continue;
    }

    if (ch >= 32 && ch <= 126) {
      if (telnetLine.length() < 160) {
        telnetLine += char(ch);
      }
    }
  }
#endif
}

