gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
void handleConsole() {
  if (!Serial.available()) return;

  String line = Serial.readStringUntil('\n');
  line.trim();
  String cmd = line;
  cmd.toLowerCase();

  Serial.print("[console] command echo: ");
  Serial.println(line);

  if (serialPendingConfirmCommand.length()) {
    if (consoleConfirmYes(cmd)) {
      line = serialPendingConfirmCommand;
      cmd = line;
      cmd.toLowerCase();
      serialPendingConfirmCommand = "";
      serialPendingConfirmDescription = "";
      Serial.println("Confirmed.");
    } else if (consoleConfirmNo(cmd)) {
      serialPendingConfirmCommand = "";
      serialPendingConfirmDescription = "";
      Serial.println("Cancelled.");
      return;
    } else {
      Serial.print("Pending confirmation for '");
      Serial.print(serialPendingConfirmCommand);
      Serial.println("'. Enter y or n.");
      return;
    }
  } else {
    String description;
    if (commandRequiresDisconnectConfirm(cmd, false, description)) {
      serialPendingConfirmCommand = line;
      serialPendingConfirmDescription = description;
      printCommandConfirmPrompt(Serial, line, description);
      return;
    }
  }

  if (cmd == "help" || cmd == "?") printHelp();
  else if (cmd.startsWith("help ")) printHelpTopic(line.substring(5));
  else if (cmd == "status") printConsoleStatus();

  else if (cmd == "gpio_startup" || cmd == "gpiostartup" || cmd == "startup_pins") {
    Serial.print(gpioStartupModeText());
  }

  else if (cmd == "current_state" || cmd == "currentstate" || cmd == "state") {
    Serial.println();
    Serial.println("=== Current State ===");
    Serial.print(currentStateText());
    Serial.println("=== End Current State ===");
  }

  else if (cmd == "system_health" || cmd == "systemhealth" || cmd == "health") {
    Serial.println();
    Serial.println("=== System Health ===");
    Serial.print(systemHealthText());
    Serial.println("=== End System Health ===");
  }

  else if (cmd == "tasks") {
    printTaskRuntimeStats(Serial);
  }

  else if (cmd == "reboot" || cmd == "restart") {
    Serial.println("Reboot command received; restarting ESP32...");
    delay(150);
    ESP.restart();
  }

  else if (cmd == "web" || cmd == "web status" || cmd == "webserver" || cmd == "webserver status") {
    Serial.printf("BT tiny web server runtime: %s\n", tinyWebServerRuntimeEnabled ? "enabled" : "disabled");
    Serial.println("Commands: web on | web off | web toggle");
    Serial.println("Note: runtime only; reboot restores enabled.");
  }

  else if (cmd == "web on" || cmd == "webserver on") {
    tinyWebServerRuntimeEnabled = true;
    Serial.println("BT tiny web server runtime enabled.");
  }

  else if (cmd == "web off" || cmd == "webserver off") {
    tinyWebServerRuntimeEnabled = false;
    Serial.println("BT tiny web server runtime disabled. Use serial 'web on' to re-enable, or reboot.");
  }

  else if (cmd == "web toggle" || cmd == "webserver toggle") {
    tinyWebServerRuntimeEnabled = !tinyWebServerRuntimeEnabled;
    Serial.printf("BT tiny web server runtime now: %s\n", tinyWebServerRuntimeEnabled ? "enabled" : "disabled");
  }

  else if (cmd == "wifi" || cmd == "wifi status") {
    Serial.printf("WiFi runtime: %s\n", wifiRuntimeEnabled ? "enabled" : "disabled");
    Serial.printf("Tiny web runtime: %s\n", tinyWebServerRuntimeEnabled ? "enabled" : "disabled");
    Serial.printf("WiFi mode text: %s\n", wifiModeText.c_str());
    Serial.printf("AP running: %d AP IP: %s STA connected: %d STA IP: %s\n",
                  apRunning ? 1 : 0,
                  WiFi.softAPIP().toString().c_str(),
                  (staConnected && WiFi.status() == WL_CONNECTED) ? 1 : 0,
                  WiFi.localIP().toString().c_str());
    Serial.println("Commands: wifi on | wifi off | wifi toggle");
  }

  else if (cmd == "wifi off") {
    runtimeWifiOff();
  }

  else if (cmd == "wifi on") {
    runtimeWifiOn();
  }

  else if (cmd == "wifi toggle") {
    if (wifiRuntimeEnabled) runtimeWifiOff();
    else runtimeWifiOn();
  }

  else if (cmd == "telnet" || cmd == "telnet status") {
    Serial.printf("Telnet console: port=%u password=%s client=%s auth=%s commands=%lu authFailures=%lu\n",
                  TELNET_PORT,
                  telnetMaskedPassword().c_str(),
                  (telnetClient && telnetClient.connected()) ? "connected" : "not connected",
                  telnetAuthenticated ? "yes" : "no",
                  (unsigned long)telnetRxCommands,
                  (unsigned long)telnetAuthFailures);
  }

  else if (cmd == "modebt" || cmd == "modebt_web") {
    saveBluetoothLiteWebBootEnabled(true);
    saveBridgeMode(BRIDGE_MODE_BT_MIN_WEB);
    scheduleRestart("serial modebt web");
    Serial.println("Saved BT mode with tiny web enabled; restarting...");
  }

  else if (cmd == "modebt_telnet" || cmd == "modebt_noweb" || cmd == "modebt_telnetonly") {
    saveBluetoothLiteWebBootEnabled(false);
    saveBridgeMode(BRIDGE_MODE_BT_MIN_WEB);
    scheduleRestart("serial modebt telnet-only");
    Serial.println("Saved BT Telnet-only mode; restarting without tiny web server...");
  }

  else if (cmd == "modewifi") {
    saveBridgeMode(BRIDGE_MODE_WIFI_FULL);
    scheduleRestart("serial modewifi");
    Serial.println("Saved full WiFi web mode; restarting...");
  }

  else if (cmd == "apdefault") {
    apSsid = "NexStar_Bridge";
    apPass = "12345678";
    apIp = "192.168.4.1";
    staRuntimeDisabled = true;
    bool ok = savePersistentSettings();
    scheduleApRestart("serial apdefault");
    Serial.printf("AP defaults saved=%d; soft AP restarting as %s / %s / %s\n",
                  ok ? 1 : 0, runtimeApSsid().c_str(), apPass.c_str(), apIp.c_str());
  }

  else if (cmd.startsWith("setsta ")) {
    String rest = line.substring(7);
    rest.trim();
    int sp = rest.indexOf(' ');
    if (sp <= 0) {
      Serial.println("Usage: setsta <ssid> <password>");
    } else {
      String ssid = rest.substring(0, sp);
      String pass = rest.substring(sp + 1);
      ssid.trim();
      pass.trim();
      staRuntimeDisabled = false;
      bool saved = saveWiFiConfig(ssid, pass);
      bool connected = false;
      if (saved) {
        WiFi.mode(WIFI_STA);
        startFallbackAP();
        connected = connectConfiguredSTA();
      }
      Serial.printf("STA save=%d connected=%d ssid=%s ip=%s status=%s\n",
                    saved ? 1 : 0, connected ? 1 : 0, staSsid.c_str(),
                    WiFi.localIP().toString().c_str(), lastWifiStatus.c_str());
    }
  }

