gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  else if (cmd == "log") {
    Serial.println("[console] log command accepted: current status");
    printConsoleLogStatus();
  }

  else if (cmd.startsWith("log ")) {
    String args = line.substring(4);
    args.trim();

    int sp = args.indexOf(' ');
    String lvlText = (sp >= 0) ? args.substring(0, sp) : args;
    lvlText.trim();

    int lvl = lvlText.toInt();
    if (lvl < 0) lvl = 0;
    if (lvl > 5) lvl = 5;
    LOG_LEVEL = lvl;

    Serial.printf("[console] log level applied: %d (%s)\n", LOG_LEVEL, logLevelName(LOG_LEVEL));

    if (sp >= 0) {
      String cats = args.substring(sp + 1);
      cats.trim();
      if (cats.length() > 0) {
        uint16_t mask = consoleLogMaskFromList(cats);
        LOG_SUBSYSTEM_MASK = mask;

        Serial.print("[console] log systems applied: ");
        Serial.println(cats);
        Serial.printf("[console] log system mask now: 0x%04X\n", LOG_SUBSYSTEM_MASK);
        Serial.print("[console] enabled systems now: ");
        Serial.println(consoleLogMaskNames(LOG_SUBSYSTEM_MASK));
      }
    }

    String msg = "[info][system] Serial console log command applied: level=";
    msg += logLevelName(LOG_LEVEL);
    msg += " mask=0x";
    msg += String(LOG_SUBSYSTEM_MASK, HEX);
    msg += " enabled=";
    msg += consoleLogMaskNames(LOG_SUBSYSTEM_MASK);
    msg += " command='";
    msg += line;
    msg += "'";
    addLogLine(msg);
  }

  else if (cmd == "testinit") {
    bool ok = testInit();
    Serial.printf("testinit result: %s\n", ok ? "OK" : "FAILED");
  }

  else if (cmd == "get") {
    double ra = 0.0;
    double dec = 0.0;
    bool ok = getRaDec(ra, dec, true);
    Serial.printf("get result: %s\n", ok ? "OK" : "FAILED");
  }

  else if (cmd == "getaltaz") {
    double alt = 0.0;
    double az = 0.0;
    bool ok = getAltAz(alt, az, true);
    Serial.printf("getaltaz result: %s\n", ok ? "OK" : "FAILED");
  }

  else if (cmd == "rates") {
    Serial.printf("Nudge rates: %.3f %.3f %.3f %.3f poll=%lu idlePoll=%lu effectivePoll=%lu demand=%s throttle=%lu\n",
                  nudgeRateDeg[0], nudgeRateDeg[1], nudgeRateDeg[2], nudgeRateDeg[3],
                  pollIntervalMs, idlePollIntervalMs, effectiveMountPollIntervalMs(),
                  positionDemandActive() ? "active" : "idle", minClientPollIntervalMs);
  }

  else if (cmd == "mountpoll") {
    printMountPollValue(Serial);
  }

  else if (cmd.startsWith("mountpoll ")) {
    long p = line.substring(10).toInt();
    bool ok = setMountPollValue(p);
    Serial.printf("mountpoll set to %lu ms%s\n", pollIntervalMs, ok ? "" : " (save failed)");
  }

  else if (cmd == "idlepoll" || cmd == "poll idle") {
    Serial.printf("Idle poll interval: %lu ms\n", idlePollIntervalMs);
    Serial.printf("Effective poll interval: %lu ms (%s)\n",
                  effectiveMountPollIntervalMs(),
                  positionDemandActive() ? "active demand" : "idle");
  }

  else if (cmd.startsWith("idlepoll ") || cmd.startsWith("poll idle ")) {
    String arg = cmd.startsWith("idlepoll ") ? line.substring(9) : line.substring(10);
    arg.trim();
    long p = arg.toInt();
    if (p < 0) p = 0;
    if (p > 60000) p = 60000;
    idlePollIntervalMs = (unsigned long)p;
    resetMountPollScheduler();
    bool ok = savePersistentSettings();
    Serial.printf("Idle poll interval set to %lu ms saved=%d\n", idlePollIntervalMs, ok ? 1 : 0);
  }

  else if (cmd == "nudge az+") Serial.printf("nudge az+ result: %s\n", nudgeRelativeAltAz(0.0, nudgeRateDeg[1]) ? "OK" : "FAILED");
  else if (cmd == "nudge az-") Serial.printf("nudge az- result: %s\n", nudgeRelativeAltAz(0.0, -nudgeRateDeg[1]) ? "OK" : "FAILED");
  else if (cmd == "nudge alt+") Serial.printf("nudge alt+ result: %s\n", nudgeRelativeAltAz(nudgeRateDeg[1], 0.0) ? "OK" : "FAILED");
  else if (cmd == "nudge alt-") Serial.printf("nudge alt- result: %s\n", nudgeRelativeAltAz(-nudgeRateDeg[1], 0.0) ? "OK" : "FAILED");
  else if (cmd == "drain") drainMount();
  else if (cmd == "pos") Serial.println(currentStateText());
  else { Serial.print("Unknown command: "); Serial.println(line); Serial.println("Type help."); }
}


#if defined(ESP32)
String httpParamValue(const String &url, const String &name) {
  String key = name + "=";
  int q = url.indexOf('?');
  if (q < 0) return "";
  int p = url.indexOf(key, q + 1);
  if (p < 0) return "";
  p += key.length();
  int e = url.indexOf('&', p);
  if (e < 0) e = url.length();
  return urlDecodeSimple(url.substring(p, e));
}

void applyHttpsBrowserTimeLocationFromUrl(const String &url, bool &gotLocation) {
  gotLocation = false;
  double latDeg = siteLatitudeDeg;
  double lonDeg = siteLongitudeDeg;
  bool hasElevation = false;
  double elevationMeters = siteElevationMeters;
  bool hasOffset = false;
  int offsetMinutes = utcOffsetMinutes;
  bool hasYear = false;
  int year = localYear;
  bool hasMonth = false;
  int month = localMonth;
  bool hasDay = false;
  int day = localDay;
  bool hasHour = false;
  int hour = localHour;
  bool hasMinute = false;
  int minute = localMinute;
  bool hasSecond = false;
  int second = localSecond;

  String v;
  v = httpParamValue(url, "lat");
  if (v.length()) {
    latDeg = v.toFloat();
    gotLocation = true;
  }
  v = httpParamValue(url, "lon");
  if (v.length()) {
    lonDeg = v.toFloat();
    gotLocation = true;
  }

  v = httpParamValue(url, "elev");
  if (v.length()) {
    hasElevation = true;
    elevationMeters = v.toFloat();
  }

  v = httpParamValue(url, "offset");
  if (v.length()) {
    hasOffset = true;
    offsetMinutes = v.toInt();
  }

  v = httpParamValue(url, "year");
  if (v.length()) {
    hasYear = true;
    year = v.toInt();
  }
  v = httpParamValue(url, "month");
  if (v.length()) {
    hasMonth = true;
    month = v.toInt();
  }
  v = httpParamValue(url, "day");
  if (v.length()) {
    hasDay = true;
    day = v.toInt();
  }
  v = httpParamValue(url, "hour");
  if (v.length()) {
    hasHour = true;
    hour = v.toInt();
  }
  v = httpParamValue(url, "minute");
  if (v.length()) {
    hasMinute = true;
    minute = v.toInt();
  }
  v = httpParamValue(url, "second");
  if (v.length()) {
    hasSecond = true;
    second = v.toInt();
  }

