gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  applyHttpsBrowserTimeLocationValues(
    gotLocation, latDeg, lonDeg,
    hasElevation, elevationMeters,
    hasOffset, offsetMinutes,
    hasYear, year,
    hasMonth, month,
    hasDay, day,
    hasHour, hour,
    hasMinute, minute,
    hasSecond, second
  );
  savePersistentSettings();

  LOG_TIME_I("Browser HTTPS site/time update: location=%s lat=%.6f lon=%.6f offset=%d date=%04d-%02d-%02d time=%02d:%02d:%02d",
             gotLocation ? "yes" : "no",
             siteLatitudeDeg,
             siteLongitudeDeg,
             utcOffsetMinutes,
             localYear,
             localMonth,
             localDay,
             localHour,
             localMinute,
             localSecond);
}

String httpsAutoDeviceTimeLocationScript() {
  String js;
  js.reserve(2600);
  String ret = cleanGpsReturnUrl(gpsSyncReturnUrl);
  ret.replace("\\", "\\\\");
  ret.replace("'", "\\'");
  js += "<script>";
  js += "function nxEnc(v){return encodeURIComponent(v)};";
  js += "function nxReturnUrl(){try{let p=new URLSearchParams(location.search);return p.get('return')||'";
  js += ret;
  js += "'}catch(e){return '";
  js += ret;
  js += "'}};";
  js += "function nxMsg(s){let m=document.getElementById('httpsMsg');if(m)m.textContent=s};";
  js += "function nxSendDeviceSite(lat,lon,acc){let d=new Date();let off=-d.getTimezoneOffset();";
  js += "let ret=nxReturnUrl();";
  js += "let u='/set_device_site_time?year='+d.getFullYear()+'&month='+(d.getMonth()+1)+'&day='+d.getDate()+'&hour='+d.getHours()+'&minute='+d.getMinutes()+'&second='+d.getSeconds()+'&offset='+off+'&return='+nxEnc(ret);";
  js += "if(lat!==null&&lon!==null){u+='&lat='+nxEnc(lat)+'&lon='+nxEnc(lon);if(acc!==null)u+='&elev=0'}";
  js += "fetch(u,{cache:'no-store'}).then(r=>r.text()).then(()=>{nxMsg(lat!==null?'Browser time/date/location saved. Returning to main page in 5 seconds...':'Browser time/date saved; location was not provided. Returning to main page in 5 seconds...');setTimeout(()=>{let sep=ret.includes('?')?'&':'?';location.replace(ret+sep+'gpssync_return='+Date.now())},5000)}).catch(e=>{nxMsg('GPS Sync save failed: '+e)});}";
  js += "function nxTryBrowserSiteTime(){nxMsg('Requesting browser location/time...');";
  js += "if(navigator.geolocation){navigator.geolocation.getCurrentPosition(p=>nxSendDeviceSite(p.coords.latitude,p.coords.longitude,p.coords.accuracy),e=>nxSendDeviceSite(null,null,null),{enableHighAccuracy:true,timeout:10000,maximumAge:300000});}";
  js += "else{nxSendDeviceSite(null,null,null)}};";
  js += "window.addEventListener('load',()=>setTimeout(nxTryBrowserSiteTime,800));";
  js += "</script>";
  return js;
}

String buildHttpsMainPage() {
  String page;
  page.reserve(3200);
  String ret = cleanGpsReturnUrl(gpsSyncReturnUrl);
  ret.replace("\\", "\\\\");
  ret.replace("'", "&#39;");
  page += "<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>";
  page += "<meta http-equiv='Cache-Control' content='no-store'>";
  page += "<title>NexStar GPS Sync</title></head><body style='font-family:Arial,sans-serif;background:#111;color:#eee;margin:18px'>";
  page += "<h2>NexStar GPS Sync</h2>";
  page += "<div id='httpsMsg' style='padding:10px;margin:10px 0;border:1px solid #555;background:#222;border-radius:8px'>Preparing GPS Sync...</div>";
  page += "<p>This HTTPS page lets the browser provide location permission. Browser time/date is also copied to the ESP32.</p>";
  page += "<p>Return target: <span style='color:#8cf'>";
  page += ret;
  page += "</span></p>";
  page += "<p><a style='display:inline-block;padding:10px 14px;background:#2d6cdf;color:#fff;text-decoration:none;border-radius:6px' href='";
  page += cleanGpsReturnUrl(gpsSyncReturnUrl);
  page += "'>Return without syncing</a></p>";
  page += "<p><a style='color:#8cf' href='/timeloc_status'>Time/Location Status</a> | <a style='color:#8cf' href='/status'>HTTPS Status</a></p>";
  page += httpsAutoDeviceTimeLocationScript();
  page += "</body></html>";
  return page;
}

void httpsSendText(httpd_req_t *req, const char *type, const String &body) {
  httpd_resp_set_type(req, type);
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  httpd_resp_send(req, body.c_str(), body.length());
}

String jsonBool(bool v) {
  return v ? "true" : "false";
}

esp_err_t httpsCatchAllHandler(httpd_req_t *req) {
  String uri = String(req->uri);
  String ret = httpParamValue(uri, "return");
  if (ret.length() && ret.startsWith("http://")) {
    gpsSyncReturnUrl = cleanGpsReturnUrl(ret);
  }

  String path = uri;
  int q = path.indexOf('?');
  if (q >= 0) path = path.substring(0, q);

  if (path == "/" || path == "/index.html" || path == "/gps_sync") {
    httpsSendText(req, "text/html", buildHttpsMainPage());
    return ESP_OK;
  }

  if (path == "/set_device_site_time") {
    bool gotLocation = false;
    applyHttpsBrowserTimeLocationFromUrl(uri, gotLocation);
    scheduleHttpsSetupStop(1800);
    ret = httpParamValue(uri, "return");
    if (ret.length() && ret.startsWith("http://")) gpsSyncReturnUrl = cleanGpsReturnUrl(ret);
    httpsSendText(req, "text/plain", gotLocation ? "HTTPS browser time/location saved" : "HTTPS browser time saved; location not provided");
    return ESP_OK;
  }

  if (path == "/timeloc_status") {
    String s;
    s.reserve(1200);
    s += "Time / Location status " + String(FW_VERSION) + "\n";
    s += "Time valid: " + String(timeValid ? "true" : "false") + "\n";
    s += "Time source: " + String(timeSourceName(currentTimeSource)) + "\n";
    s += "UTC offset minutes: " + String(utcOffsetMinutes) + "\n";
    s += "UTC offset source: " + utcOffsetSource + "\n";
    s += "Local date: " + String(localYear) + "-" + String(localMonth) + "-" + String(localDay) + "\n";
    s += "Local time: " + String(localHour) + ":" + String(localMinute) + ":" + String(localSecond) + "\n";
    s += "Site valid: " + String(siteValid ? "true" : "false") + "\n";
    s += "Location source: " + currentLocationSource + "\n";
    s += "Latitude: " + String(siteLatitudeDeg, 6) + "\n";
    s += "Longitude: " + String(siteLongitudeDeg, 6) + "\n";
    httpsSendText(req, "text/plain", s);
    return ESP_OK;
  }

  if (path == "/status") {
    String body = "{\"ok\":true,\"https\":true,\"timeValid\":" + jsonBool(timeValid) +
                  ",\"siteValid\":" + jsonBool(siteValid) +
                  ",\"apIP\":\"" + WiFi.softAPIP().toString() + "\"" +
                  ",\"staIP\":\"" + WiFi.localIP().toString() + "\"}";
    httpsSendText(req, "application/json", body);
    return ESP_OK;
  }

  if (path == "/mount_test") {
    String s = "Mount test is available on the normal HTTP web UI.\n";
    httpsSendText(req, "text/plain", s);
    return ESP_OK;
  }

