gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  httpsSendText(req, "text/plain", "HTTPS GPS Sync route not implemented in " + String(FW_VERSION) + ": " + uri);
  return ESP_OK;
}

void startHttpsSetupServer() {
  if (httpsSetupServerHandle) return;

  httpd_ssl_config_t conf = HTTPD_SSL_CONFIG_DEFAULT();
  conf.port_secure = HTTPS_SETUP_PORT;
  conf.servercert = (const unsigned char *)HTTPS_SETUP_CERT;
  conf.servercert_len = strlen(HTTPS_SETUP_CERT) + 1;
  conf.prvtkey_pem = (const unsigned char *)HTTPS_SETUP_KEY;
  conf.prvtkey_len = strlen(HTTPS_SETUP_KEY) + 1;
  conf.httpd.uri_match_fn = httpd_uri_match_wildcard;

  esp_err_t ret = httpd_ssl_start(&httpsSetupServerHandle, &conf);
  if (ret != ESP_OK) {
    Serial.printf("HTTPS web UI server failed to start: err=%d\n", (int)ret);
    httpsSetupServerHandle = NULL;
    return;
  }

  httpd_uri_t root_uri = {};
  root_uri.uri = "/";
  root_uri.method = HTTP_GET;
  root_uri.handler = httpsCatchAllHandler;
  root_uri.user_ctx = NULL;
  httpd_register_uri_handler(httpsSetupServerHandle, &root_uri);

  httpd_uri_t set_uri = {};
  set_uri.uri = "/set_device_site_time*";
  set_uri.method = HTTP_GET;
  set_uri.handler = httpsCatchAllHandler;
  set_uri.user_ctx = NULL;
  httpd_register_uri_handler(httpsSetupServerHandle, &set_uri);

  httpd_uri_t any_uri = {};
  any_uri.uri = "/*";
  any_uri.method = HTTP_GET;
  any_uri.handler = httpsCatchAllHandler;
  any_uri.user_ctx = NULL;
  httpd_register_uri_handler(httpsSetupServerHandle, &any_uri);

  Serial.printf("HTTPS web UI ready: https://%s/\n", WiFi.softAPIP().toString().c_str());
}
#endif

void handleModeRedirectHome() {
  webServer->sendHeader("Location", "/");
  webServer->sendHeader("Cache-Control", "no-store");
  webServer->send(303, "text/plain", "Redirecting to main UI");
}


String modeUrlEncode(const String &s) {
  String out;
  const char *hex = "0123456789ABCDEF";
  for (size_t i = 0; i < s.length(); i++) {
    uint8_t c = (uint8_t)s[i];
    if ((c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') || (c >= '0' && c <= '9') || c == '-' || c == '_' || c == '.' || c == '~') {
      out += char(c);
    } else {
      out += '%';
      out += hex[(c >> 4) & 0x0F];
      out += hex[c & 0x0F];
    }
  }
  return out;
}


String currentRequestBaseUrl() {
  String host = webServer->hostHeader();
  host.trim();
  if (host.length() == 0) {
    if (WiFi.status() == WL_CONNECTED) host = WiFi.localIP().toString();
    else host = WiFi.softAPIP().toString();
  }
  return String("http://") + host + "/";
}

String requestedReturnUrl() {
  String r = webServer->arg("return");
  r.trim();
  if (r.startsWith("http://")) return r;
  return currentRequestBaseUrl();
}


String deviceMacSuffix() {
#if defined(ESP32)
  uint64_t mac = ESP.getEfuseMac();
  char buf[5];
  snprintf(buf, sizeof(buf), "%04X", (uint16_t)(mac & 0xFFFF));
  return String(buf);
#else
  return "0000";
#endif
}

String appendMacSuffixToName(const String &base) {
  String suffix = deviceMacSuffix();
  if (base.endsWith("-" + suffix)) return base;
  if (base.endsWith("_" + suffix)) return base;
  return base + "-" + suffix;
}

String runtimeApSsid() {
  return appendMacSuffixToName(apSsid);
}

String runtimeBtName() {
  return appendMacSuffixToName(String(BT_NAME));
}


void handleFullWifiRebootPage() {
  String ret = requestedReturnUrl();
  if (ret.length() == 0 || !ret.startsWith("http://")) ret = currentRequestBaseUrl();

  String page;
  page.reserve(900);
  page += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
  page += F("<meta http-equiv='refresh' content='8;url=");
  page += ret;
  page += F("'><script>setTimeout(function(){location.replace('");
  page += ret;
  page += F("')},8000)</script>");
  page += F("<style>body{font-family:Arial,Helvetica,sans-serif;background:#0b1020;color:#edf2ff;margin:0;padding:20px}.card{max-width:560px;margin:25px auto;background:#151c2f;border:1px solid #2b3654;border-radius:12px;padding:18px}a{color:#8cc7ff}</style>");
  page += F("</head><body><div class='card'><h2>Rebooting</h2><p>The browser should return to the main UI automatically.</p><p><a href='");
  page += ret;
  page += F("'>Open main UI</a></p></div></body></html>");

  server.sendHeader("Cache-Control", "no-store");
  server.send(200, "text/html", page);
  delay(900);
  ESP.restart();
}

void setup() {
  Serial.begin(115200);
  
  LOGI("Serial log mirror enabled: Full WiFi log format [level][system]");
delay(500);

  Serial.println();
  Serial.printf("%s %s\n", FW_NAME, FW_VERSION);
#if defined(ESP32)
  Serial.println("ESP32/WROOM build: HardwareSerial UART2 on GPIO16/GPIO17; Stellarium receive-buffer fix active");
#endif
  Serial.printf("Board: %s\n", BOARD_NAME);
  Serial.printf("Mount serial RX=%d TX=%d baud=%lu\n", MOUNT_RX_PIN, MOUNT_TX_PIN, MOUNT_BAUD);

  mountTransportBegin();
  Serial.println("[BOOT] mount serial started");

  delay(200);

#if defined(ESP32)
  Serial.println("[NVS] ESP32 using Preferences/NVS for settings");
  if (!loadPersistentSettings()) {
    Serial.println("[NVS] No saved NVS settings; using defaults");
  }
  if (ESP32_BOOT_DISABLE_BACKGROUND_POLLING) {
    pollIntervalMs = 0;
    resetMountPollScheduler();
    Serial.println("[BOOT] ESP32 background mount polling disabled at boot");
  }
  if (!ESP32_BOOT_DISABLE_BACKGROUND_POLLING) {
    Serial.printf("[BOOT] ESP32 background mount polling loaded at %lu ms\n", pollIntervalMs);
  }
  if (ESP32_BOOT_AP_ONLY) {
    ntpEnabled = false;
    staConfigured = false;
    staSsid = "";
    staPass = "";
    Serial.println("[BOOT] ESP32 AP-only boot: STA credentials cleared and NTP disabled for this boot");
  }
#else
  {
    if (!LittleFS.begin()) {
      LOG_SET_E("LittleFS mount failed; persistent settings will not be available");
    } else {
      LOG_SET_I("LittleFS mounted for persistent settings");
      if (!loadPersistentSettings()) {
        LOGW("No valid LittleFS persistent settings found. This is normal after first flash, filesystem format change, or Clear Saved. Press Save Site / Time / Polling once to create valid settings.");
      }
    }
  }
#endif

  Serial.println("[BOOT] network/mode setup begin");
  loadBridgeMode();
  applyGpioStartupModeOverride();
  Serial.printf("[BOOT] bridge mode: %s source=%s pin=%d\n", bridgeModeName(), startupModeSource.c_str(), startupModePinUsed);
  if (bridgeMode == BRIDGE_MODE_BT_MIN_WEB) {
    ntpEnabled = false;
    loadBluetoothLitePollInterval();
    if (pollIntervalMs > 60000) pollIntervalMs = 2000;
    resetMountPollScheduler();
    resetMountPollFailures();
#if defined(ESP32)
    loadWiFiConfig(); // use saved STA/AP settings in exclusive STA-only or AP-only mode, but do not start the full WebServer.h UI
    WiFi.persistent(false);
    WiFi.disconnect(true, true);
    WiFi.softAPdisconnect(true);
    delay(150);
    staRuntimeDisabled = false; // BT should use saved STA when configured, not force AP-only
    setupWiFiFromSavedConfig();
    tinyWebServerRuntimeEnabled = btLiteBootWebEnabled;
    if (btLiteBootWebEnabled) {
      tinySetupServer.begin();
      Serial.println("[BT_MIN] tiny setup web server active");
    } else {
      Serial.println("[BT_MIN] tiny setup web server disabled; Telnet-only BT boot");
    }
    startTelnetConsoleServer("BT boot");
#endif
    wifiModeText = String(btLiteBootWebEnabled ? "BT exclusive WiFi + " : "BT Telnet-only WiFi + ") + wifiModeText;
    lastWifiStatus = String(btLiteBootWebEnabled ? "BT: full WebServer UI skipped; tiny setup server on saved WiFi mode. " : "BT Telnet-only: tiny setup server disabled on saved WiFi mode. ") + lastWifiStatus;
    Serial.printf("[BOOT] BT: tiny web=%s, Telnet active, WebServer.h services skipped, NTP disabled in BT mode, independent interval-only mount polling enabled at %lu ms\n", btLiteBootWebEnabled ? "enabled" : "disabled", pollIntervalMs);
  } else {
    setupWiFiFromSavedConfig();
  }
  Serial.println("[BOOT] network/mode setup done");

#if defined(ESP32)
  ALPACA_PORT = 11111;
  Serial.printf("[ALPACA] Forcing Alpaca HTTP server to port %u\n", ALPACA_PORT);
#endif

  Serial.printf("WiFi mode: %s\n", wifiModeText.c_str());
  Serial.printf("AP SSID: %s\n", apSsid.c_str());
  Serial.printf("AP IP: %s\n", WiFi.softAPIP().toString().c_str());
  Serial.printf("STA SSID: %s\n", staSsid.c_str());
  Serial.printf("STA IP: %s\n", WiFi.localIP().toString().c_str());
  Serial.printf("Web UI HTTP port: %u\n", HTTP_WEB_PORT);
  if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
    Serial.printf("Alpaca HTTP port: %u\n", ALPACA_PORT);
    Serial.printf("LX200/SkySafari TCP port: %u\n", LX200_PORT);
    Serial.printf("Stellarium TCP port: %u\n", STELLARIUM_PORT);
    Serial.printf("Telnet console port: %u\n", TELNET_PORT);
    Serial.printf("Alpaca UDP discovery port: %u\n", ALPACA_DISCOVERY_PORT);
  } else {
    Serial.println("Bluetooth minimal mode: Alpaca, Stellarium, SkySafari WiFi, and Alpaca discovery disabled; Telnet console enabled if WiFi is on");
  }

#if defined(ESP32)
  if (ESP32_BOOT_WEB_ONLY || bridgeMode == BRIDGE_MODE_WIFI_FULL) {
    Serial.println("[WEB_ONLY] Bluetooth init skipped");
  } else
#endif
  {
#if HAS_CLASSIC_BT
    bool btOk = SerialBT.begin(runtimeBtName(), false, true);
    if (!btOk) {
      Serial.println("Bluetooth SPP first start failed; retrying once");
      SerialBT.end();
      delay(500);
      btOk = SerialBT.begin(runtimeBtName(), false, true);
    }
    if (btOk) {
      bluetoothRuntimeEnabled = true;
      Serial.printf("Bluetooth SPP name: %s\n", runtimeBtName().c_str());
#if defined(ESP32)
      coexPreferenceResult = (int)esp_coex_preference_set(ESP_COEX_PREFER_BT);
      coexPreferenceText = "prefer_bt";
      Serial.printf("[COEX] preference=%s result=%d version=%s\n",
                    coexPreferenceText.c_str(),
                    coexPreferenceResult,
                    esp_coex_version_get());
#endif
    } else {
      Serial.println("Bluetooth SPP failed to start");
    }
#else
    Serial.println("Bluetooth SPP disabled on this board");
#endif
  }

