gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
#if defined(ESP8266)
  if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
    webServer = new ESP8266WebServer(HTTP_WEB_PORT);
    alpacaServer = new ESP8266WebServer(ALPACA_PORT);
    lx200ServerPtr = new WiFiServer(LX200_PORT);
    stellariumServerPtr = new WiFiServer(STELLARIUM_PORT);
  } else {
    webServer = nullptr;
    alpacaServer = nullptr;
    lx200ServerPtr = nullptr;
    stellariumServerPtr = nullptr;
    telnetServerPtr = nullptr;
  }
#else
  if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
    webServer = new WebServer(HTTP_WEB_PORT);
    alpacaServer = new WebServer(ALPACA_PORT);
    lx200ServerPtr = new WiFiServer(LX200_PORT);
    stellariumServerPtr = new WiFiServer(STELLARIUM_PORT);
  } else {
    webServer = nullptr;
    alpacaServer = nullptr;
    lx200ServerPtr = nullptr;
    stellariumServerPtr = nullptr;
  }
#endif

#if defined(ESP32)
  if (ESP32_BOOT_WEB_ONLY || bridgeMode == BRIDGE_MODE_BT_MIN_WEB) {
    Serial.println("[BT_MIN] UDP/LX200 WiFi/Stellarium listeners skipped; Telnet starts separately in BT");
  } else
#endif
  {
    Serial.println("[BOOT] starting UDP/LX200/Stellarium/Telnet listeners");
    discoveryUdp.begin(ALPACA_DISCOVERY_PORT);
    lx200Server.begin();
    stellariumServer.begin();
    startTelnetConsoleServer("Full WiFi boot");
    Serial.printf("[BOOT] TCP/UDP listeners started; Telnet console port %u\n", TELNET_PORT);
  }

  if (bridgeMode == BRIDGE_MODE_WIFI_FULL && webServer) {
    activeServer = webServer;
    LOG_WEB_I("Registering web UI routes on port %u", HTTP_WEB_PORT);
    server.on("/", HTTP_GET, handleRoot);
    server.on("/http_health", HTTP_GET, handleHttpHealthPage);
    server.on("/status", HTTP_GET, handleStatusPage);
    server.on("/btstatus", HTTP_GET, handleBtStatusPage);
    server.on("/bsc5_data", HTTP_GET, handleBsc5DataPage);
    server.on("/status_text", HTTP_GET, handleStatusTextPage);
    server.on("/sys_text", HTTP_GET, handleSystemTextPage);
    server.on("/setwifi", HTTP_GET, handleSetWiFiPage);
    server.on("/clearwifi", HTTP_GET, handleClearWiFiPage);
    server.on("/setap", HTTP_GET, handleSetApPage);
    server.on("/setmode", HTTP_GET, handleSetModePage);
    server.on("/reboot", HTTP_GET, handleFullWifiRebootPage);
    server.on("/setbtpoll", HTTP_GET, handleSetBtPollPage);
    if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
      server.on("/start_https", HTTP_GET, handleStartHttpsPage);
      server.on("/timeloc_status", HTTP_GET, handleTimeLocationStatusPage);
      server.on("/https_setup", HTTP_GET, handleHttpsSetupRedirectPage);
      server.on("/mount_test", HTTP_GET, handleMountTestPage);
      server.on("/logs", HTTP_GET, handleLogsPage);
      server.on("/setup_action", HTTP_GET, handleSetupActionPage);
      server.on("/setlog", HTTP_GET, handleSetLogPage);
      server.on("/setaltlimits", HTTP_GET, handleSetAltLimitsPage);
      server.on("/setdeclimits", HTTP_GET, handleSetDecLimitsPage);
      server.on("/setrates", HTTP_GET, handleSetRatesPage);
      server.on("/setwebrate", HTTP_GET, handleSetWebRatePage);
      server.on("/set_site_time", HTTP_GET, handleSetSiteTimePage);
      server.on("/set_manual_site_time", HTTP_GET, handleSetManualSiteTimePage);
      server.on("/set_device_site_time", HTTP_GET, handleSetDeviceSiteTimePage);
      server.on("/webnudge", HTTP_GET, handleWebNudgePage);
      server.on("/getradecweb", HTTP_GET, handleGetRaDecWebPage);
      server.on("/getaltazweb", HTTP_GET, handleGetAltAzWebPage);
      server.on("/webgoto_radec", HTTP_GET, handleWebGotoRaDecPage);
      server.on("/webgoto_altaz", HTTP_GET, handleWebGotoAltAzPage);
      server.on("/resetrates", HTTP_GET, handleResetRatesPage);
      server.on("/clearlogs", HTTP_GET, handleClearLogsPage);
      server.on("/clearlogalert", HTTP_GET, handleClearLogAlertPage);
      server.on("/fetch_ip_location", HTTP_GET, handleFetchIpLocationPage);
      server.on("/use_ip_location", HTTP_GET, handleUseIpLocationPage);
      server.on("/setntp", HTTP_GET, handleSetNtpPage);
      server.on("/syncntp", HTTP_GET, handleSyncNtpPage);
      server.on("/clearsettings", HTTP_GET, handleClearSettingsPage);
    }
    server.onNotFound(handleWebNotFound);
    webServer->on("/mode", handleModeRedirectHome);
    const char* headerKeys[] = {"Host"};
    webServer->collectHeaders(headerKeys, 1);

    // Start the Full WiFi HTTP listener exactly once. Starting the same
    // WebServer instance twice can leave the TCP listener in an unreliable
    // state after boot or restart.
    server.begin();
    Serial.printf("[WEB] HTTP server started once on port %u; AP=%s STA=%s heap=%u\n",
                  HTTP_WEB_PORT,
                  WiFi.softAPIP().toString().c_str(),
                  WiFi.localIP().toString().c_str(),
                  ESP.getFreeHeap());

    if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
      activeServer = alpacaServer;
      LOG_ALP_I("Registering Alpaca API routes on port %u", ALPACA_PORT);
      server.on("/management/apiversions", HTTP_GET, handleManagementApiVersions);
      server.on("/management/v1/description", HTTP_GET, handleManagementDescription);
      server.on("/management/v1/configureddevices", HTTP_GET, handleConfiguredDevices);
      server.onNotFound(handleNotFound);
      Serial.println("[BOOT] alpacaServer.begin");
      server.begin();
      Serial.printf("[ALPACA] HTTP server started on port %u\n", ALPACA_PORT);
    } else {
      Serial.println("[BT_MIN] Alpaca HTTP server skipped");
    }
  } else {
    Serial.println("[BT_MIN] Full Web UI disabled; BT main/status pages are available");
  }

  activeServer = webServer;

#if defined(ESP32)
  if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
    if (HTTPS_WEB_AUTO_START) {
      startHttpsSetupServer();
    } else {
      Serial.printf("HTTPS GPS Sync auto-start disabled; HTTP UI is active on port %u. Use GPS Sync button to start HTTPS on demand.\n", HTTP_WEB_PORT);
    }
  } else {
    Serial.println("[BT_MIN] HTTPS/GPS Sync disabled because WiFi/web mode is not active");
  }
#endif

  if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
    LOG_WEB_I("Web UI HTTP server ready AP: http://%s:%u/ STA: http://%s:%u/", WiFi.softAPIP().toString().c_str(), HTTP_WEB_PORT, WiFi.localIP().toString().c_str(), HTTP_WEB_PORT);
    LOG_SKY_I("LX200 SkySafari WiFi server ready AP %s:%u STA %s:%u", WiFi.softAPIP().toString().c_str(), LX200_PORT, WiFi.localIP().toString().c_str(), LX200_PORT);
    LOG_STEL_I("Stellarium server ready AP %s:%u STA %s:%u", WiFi.softAPIP().toString().c_str(), STELLARIUM_PORT, WiFi.localIP().toString().c_str(), STELLARIUM_PORT);
    LOGI("Alpaca discovery listening on UDP %u", ALPACA_DISCOVERY_PORT);
  }
#if HAS_CLASSIC_BT
  if (bluetoothRuntimeEnabled) LOG_SKY_I("Bluetooth LX200 SPP ready as %s", BT_NAME);
#endif

  printHelp();
}

void loop() {
  unsigned long loopStart = millis();

  // Highest-priority task: maintain the configured mount poll interval before
  // servicing console, web, protocol, Telnet, or other lower-priority work.
  serviceMountPolling();

#if defined(ESP32)
  serviceHttpsSetupStop();
#endif

