gumby2/nexstar-protocol-converter-esp32-chatgpt/firmware/Nexstar_Protocol_Converter/Nexstar_Protocol_Converter.ino
  handleConsole();
  serviceMountPolling();
  serviceHttpServers();
  serviceMountPolling();
  serviceRestart();
  serviceMountPolling();

#if defined(ESP32)
  if (ESP32_BOOT_WEB_ONLY) {
    static unsigned long lastWebOnlyBeatMs = 0;
    if (millis() - lastWebOnlyBeatMs > 5000) {
      lastWebOnlyBeatMs = millis();
      Serial.printf("[WEB_ONLY] alive ip=%s stations=%d heap=%u\n",
                    WiFi.softAPIP().toString().c_str(),
                    WiFi.softAPgetStationNum(),
                    ESP.getFreeHeap());
    }
    lastLoopTimeMs = millis() - loopStart;
    if (lastLoopTimeMs > maxLoopTimeMs) maxLoopTimeMs = lastLoopTimeMs;
    lastLoopLatencyMs = lastLoopTimeMs;
    if (lastLoopLatencyMs > maxLoopLatencyMs) maxLoopLatencyMs = lastLoopLatencyMs;
    yield();
    return;
  }
#endif

  if (bridgeMode == BRIDGE_MODE_WIFI_FULL) {
    handleAlpacaDiscovery();
    serviceMountPolling();
    handleLX200Server();
    serviceMountPolling();
    handleStellariumServer();
    serviceMountPolling();
    serviceTelnetConsole();
    serviceMountPolling();
    serviceNtpSync();
    serviceMountPolling();
    serviceGotoCompletionWatch();
    serviceGotoQueue();
    serviceAsyncSlew();
  } else {
    serviceTinySetupServer();
    serviceMountPolling();
    serviceTelnetConsole();
    serviceMountPolling();
    handleBluetoothLX200();
#if HAS_CLASSIC_BT
    if (BT_AUTO_WIFI_OFF_ON_CLIENT &&
        bridgeMode == BRIDGE_MODE_BT_MIN_WEB &&
        bluetoothRuntimeEnabled &&
        SerialBT.hasClient() &&
        wifiRuntimeEnabled &&
        !btAutoWifiOffDone &&
        btClientConnectedAtMs != 0 &&
        millis() - btClientConnectedAtMs > 1500UL) {
      btAutoWifiOffDone = true;
      Serial.println("[BT_MIN] Bluetooth client active; turning WiFi off for BT stability");
      runtimeWifiOff();
    }
#endif
    serviceMountPolling();
    serviceGotoCompletionWatch();
    serviceGotoQueue();
    serviceAsyncSlew();
  }
  applyPendingSiteTimeUpdate();
  serviceMountPolling();

  lastLoopTimeMs = millis() - loopStart;
  if (lastLoopTimeMs > maxLoopTimeMs) maxLoopTimeMs = lastLoopTimeMs;
  lastLoopLatencyMs = lastLoopTimeMs;
  if (lastLoopLatencyMs > maxLoopLatencyMs) maxLoopLatencyMs = lastLoopLatencyMs;

  yield();
}
